{
  "heros": [{
    "id": "1066",
    "name": "Havildar Hangpan Dada",
    "title": "2016",
    "operation": "Encounter with Terrorists-Naugam",
    "url": "http://media2.intoday.in/indiatoday/images/stories/dada-1824_647_081416024115.jpg",
    "moredescription": "\n\nReference : en.wikipedia.org",
    "description": "Unit :Assam Regiment",
    "description1": "Service-Indian Army (Rashtriya Rifles)",
    "description2": "Born on October 2, 1979\n",
    "description3": "\n     On the night of 26th May 2016, Dada, as Sabu Post Commander of 35 Rashtriya Rifles, while establishing a stop along with his section at 12,500 feet, led a charge on hiding terrorists in Naugam, Jammu and Kashmir resulting in the neutralisation of four heavily armed terrorists. \n\nHe along with his team spotted the movement of terrorists in the area and engaged them in a fierce encounter that went on for over 24 hours.\n\n He charged at the spot where terrorists were hidding themselves and killed two terrorists on the spot and later the third one after a hand-to-hand scuffle as they slid down the hill towards the Line of Control.\n\n Dada sustained a sudden burst of automatic fire from the hiding fourth terrorist, receiving a gun shot wound. He continued to pin down the fourth terrorist and later succumbed to his injuries before wounding the terrorist.Dada's action of eliminating three terrorists in an engagement at close quarters and injuring a fourth one, in disregard to his personal safety, foiled the infiltration bid and ensured the safety of his men. \n\nHe was honoured posthumously, with the government announcing the highest gallantry award during peace-time operations, the Ashok Chakra, on the eve of the Independence Day in 2016."

  }, {
    "id": "1065",
    "name": "Lance Naik Mohan Goswami",
    "title": "2015",
    "operation": "Encounter with Terrorists-Kupwara(J&K)",
    "url": "http://static.topyaps.com/wp-content/uploads/2016/01/IMG-20150905-WA0003.jpg",
    "moredescription": "\n\nReference : en.wikipedia.org",
    "description": "Unit :9 Parachute Regiment(Special Forces)",
    "description1": "Service-Indian Army",
    "description2": " \n",
    "description3": "\n     On the intervening night of 2nd and 3rd September 2015 Lance Naik Mohan Nath Goswami was part of an ambush in Haphruda forest at Kupwara district of Jammu and Kashmir.\n\n At about 20:15hrs, there was a fierce encounter with four terrorists wherein two of his comrades were injured and pinned down. Lance Naik Mohan along with his buddy dashed forward to rescue their injured colleagues, knowing well the risks to their own lives. \n \nHe first assisted in eliminating one terrorist. Sensing grave danger to three of his wounded colleagues, Lance Naik Mohan with utter disregard to his own personal safety, charged at the remaining terrorists drawing intense fire from them. He was hit in the thigh. \nUnmindful, he closed in and eliminated one terrorist, injured another and was again shot in the abdomen. Undeterred by his injuries, he hurled himself on the last terrorist and killed him at point blank range before succumbing to his wounds. \n\nLance Naik Mohan not only killed two terrorists, but also assisted in neutralizing the other two and save the lives of three of his wounded colleagues.\n\n Thus, Lance Naik Mohan Nath Goswami exhibited most conspicuous gallantry in personally eliminating two terrorists and assisting in evacuation of his wounded colleagues and made supreme sacrifice in the highest traditions of the Indian Army."
  }, {
    "id": "1064",
    "name": "Major Mukund Varadarajan",
    "title": "2014",
    "operation": "Encounter with Terrorists-Shupiyan(J&K)",
    "url": "https://propelsteps.files.wordpress.com/2014/04/mukund.gif",
    "moredescription": "\n\nReference : en.wikipedia.org",
    "description": "Unit :Rajput Regiment(22 Rajput)",
    "description1": "Service-Indian Army(44 Rashtriya Rifles)",
    "description2": "12 April 1983\n",
    "description3": "\n     On 25 April 2014, he led an anti-terrorist search operation to clear village of terrorists. During the operation, his team came under heavy fire.\n\n The officer responded swiftly, and killed three terrorists of the Hizbul Mujahideen who were responsible for killing election officials 24 hours earlier. However, he was gravely injured during the assault and was evacuated but he died due to the injuries.\n\nFor his brave actions during the operation, he was posthumously awarded the Ashok Chakra, India's highest peacetime gallantry award in 2014, for displaying valor beyond the call of duty.\n\nThe citation by the Government of India during the declaration of the Ashok Chakra read:During the operation, before attaining martyrdom, Major Mukund displayed exemplary leadership skills, raw courage, planning and swift action, which culminated in the elimination of the three top ranked Hizbul Mujaheddin terrorists.\n\nMukund is the fourth recipient of the Ashoka Chakra from the state of Tamil Nadu."
  }, {
    "id": "1063",
    "name": "Naik Neeraj Kumar Singh",
    "title": "2014",
    "operation": "Encounter with Terrorists-Kupwara(J&K)",
    "url": "http://netindian.in/sites/default/files/20150125neeraj250.jpg",
    "moredescription": "\n\nReference : en.wikipedia.org",
    "description": "Unit :57 Battalion Rashtriya Rifles",
    "description1": "Service-Indian Army(Rashtriya Rifles)",
    "description2": "\n",
    "description3": "\n     Based on specific intelligence, Brigade Ghataks launched a Search and Destroy Operation at General area Gurdaji of Kupwara district of Jammu and Kashmir on 24 August 2014. \n\nAt 1025 hours, party noticed movement of few terrorists close to a Dhok, who opened indiscriminate fire on own troops. In the ensuring fire fight, a friend of Naik Neeraj was hit on bullet proof jacket. \n\nWith utter disregard for his personal safety, Naik Neeraj crawled and extricated his friend. A terrorist threw grenades and brought heavy fire on Naik Neeraj. \n\nIn a daring act, he inched closer to the terrorist and shot him dead. Simultaneously, the NCO was attacked by another terrorist resulting in dropping of his Rifle and the terrorist shot him in the chest. \n\nDespite grievous injuries, displaying unparalleled courage, he pounced on the terrorist, snatched his weapon and killed him in hand-to-hand combat. He refused to be evacuated till he became unconscious and was evacuated by helicopter to 92 Base Hospital, where he succumbed to his injuries.\n\nNaik Neeraj Kumar Singh was an Indian Army brave heart who served in the 57 Battalion of the Rashtriya Rifles and was posthumously awarded the Ashok Chakra, the country’s highest peacetime military decoration on 26 January 2015."
  }, {
    "id": "1062",
    "name": "Sub-Inspector KLVSSNV Prasad Babu",
    "title": "2013",
    "operation": "Encounter with Maoists",
    "url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/K_Prasad_Babu.jpg/220px-K_Prasad_Babu.jpg",
    "moredescription": "\n\nReference : en.wikipedia.org",
    "description": "Unit :Greyhounds special operations",
    "description1": "Service-Andhra Pradesh Police",
    "description2": "Born in 1981\n",
    "description3": "\n    On 16 April 2013, a group of 70 Maoists ambushed the Greyhounds unit and bombed it. Prasad Babu lead the retaliating team and played a key role in killing nine top ranked attackers and injuring others in two encounters. \n\nThe police were being evacuated back by helicopters when about hundred men started attacking the helicopter. The helicopter had already performed 5 sorties and only 19 of the police were left to be evacuated. 14 of them boarded the aircraft while 5 of them including Babu stayed and provided cover.\n\nHowever, as the helicopter left, more maoists arrived and started surrounding Babu and others. Babu asked the other four policemen to leave south to a safe place while he handled about 200 of the militants. \n\nHe was then caught by them and was tortured to death.\nHe played a vital role in the death of nine Maoists and helped save the lives of four officers.\n\nOn 15 August 2013, he was nominated posthumously for Ashok Chakra, India's highest peacetime gallantry award. \n\nThe award was received on 26 January 2014 by his father Venkata Ramana Naidu from President Pranab Mukherjee in New Delhi.\n\n Babu is the first-ever police officer from Andhra Pradesh to be awarded the Ashok Chakra, which is usually conferred on soldiers."
  },


    {
      "id": "1061",
      "name": "Lt. Navdeep Singh",
      "title": "2012",
      "operation": "Encounter with Terrorists-LOC",
      "url": "http://im.rediff.com/news/2012/apr/12navdeep8.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit :Army Ordnance Corps",
      "description1": "Service-Indian Army(15 Maratha Light Infantry regiment)",
      "description2": " \n",
      "description3": "\n    Lieutenant Navdeep Singh was Ghatak Platoon Commander of 15 Maratha Light Infantry deployed in the High Altitude Area near the Line of Control.On receiving information about the infiltration of a group of terrorists at about 0030 hours on 20 August 2011, the officer gauged the likely route of the terrorists and laid an ambush at the appropriate spot.\n\n When the terrorists were spotted, the ambush was sprung by the officer himself. An exchange of intense fire ensued. Leading from the front, the officer eliminated three terrorists at close range. \n\nOn seeing another terrorist approaching their position, with utter disregard to his personal safety, the officer swiftly changed his firing position.The encounter lasted about 8 minutes in which 12 well trained terrorists were killed.\n\n While doing so, he got hit by a bullet on his head. He nevertheless managed to eliminate the fourth terrorist. Further, displaying utmost bravery and comradeship, he pulled an injured fellow-soldier to safety and kept firing till he became unconscious due to excessive blood loss.\n\nLieutenant Navdeep Singh displayed his indomitable spirit, determination and exceptional bravery while putting down the terrorists and making the supreme sacrifice for the nation.\n\nHe was awarded with the Ashoka Chakra posthumously on the 63rd Republic Day by President of India Pratibha Patil."
    }, {
      "id": "1060",
      "name": "Major Laishram Jyotin Singh",
      "title": "2011",
      "operation": "Encounter with Terrorists-Kabul",
      "url": "http://www.stratpost.com/wp-content/uploads/2011/01/Ashok_Chakra_Awardee.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit :Indian Army Medical Corps",
      "description1": "Service-Indian Army",
      "description2": "Born in 1972\n",
      "description3": "\n    Just thirteen days after his posting, on 26 February 2010, a suicide bomber attacked the guarded residential compound where he was staying.\n\nMajor Singh confronted the terrorist unarmed and forced him to detonate his vest, which resulted in his death. \n\nHe was awarded the Ashok Chakra For his act of exemplary courage, grit, selflessness and valour in the face of a terrorist attack, resulting in his sacrifice and saving 10 of his colleagues."
    }, {
      "id": "1059",
      "name": "Havildar Rajesh Kumar",
      "title": "2010",
      "operation": "Encounter with Terrorists-Kupwara(J&K)",
      "url": "http://3.bp.blogspot.com/_nZbsgcGX4l4/S18P7N-hz9I/AAAAAAAAAq4/dDhRgegvpW8/s320/HAVILDAR%2520RAJESH%2520KUMAR.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit :11th Battalion",
      "description1": "Service-Indian Army(Rajputana Rifles)",
      "description2": "",
      "description3": "\n    On 1 August 2009, he was leading a section of the Ghatak team that was on a search mission for terrorists in the forests of Kupwara district of Jammu and Kashmir. \n\nHe opened fire on the terrorists and killed three of them, saved his teammates, but got seriously hurt in the process. Finally he succumbed to injuries.\n\n He was posthumously awarded the Ashoka Chakra, the highest peace time military decoration in India.\n\nThe citation by the President of India during the awarding of the Ashoka Chakra read: Havildar Rajesh Kumar showed unparalleled feat of most conspicuous gallantry, fortitude and the rare spirit of self sacrifice in fighting the terrorists."
    }, {
      "id": "1058",
      "name": "Major Mohit Sharma",
      "title": "2010",
      "operation": "Encounter with Terrorists-Kupwara(J&K)",
      "url": "https://pbs.twimg.com/media/B7OjUF2CIAEPQAX.jpg",
      "moredescription": "\n\nReference : www.indianparachuteregiment.kar.nic.in",
      "description": "Unit :1 Para (Special Forces)",
      "description1": "Service- Indian Army",
      "description2": "\n",
      "description3": "\n    IC-59066N Major Mohit Sharma,was leading Bravo Assault Team in operations in Kupwara District of North Kashmir. \n\nA valiant warrior, he excelled in the art of fighting guerrillas in jungle terrain having earlier spent four years in Jammu & Kashmir.On 21 March 2009, after receiving information of presence of some infiltrating terrorists in dense Haphruda Forest, he planned meticulously and led his commandos in tracking them.\n\nOn observing suspicious movement, he alerted his scouts but terrorists fired from three directions indiscriminately.\n\n  In the heavy exchange of fire, four commandos were wounded immediately. With complete disregard to his safety, he crawled and recovered two soldiers to safety. Unmindful of the overwhelming fire, he threw grenades and killed two terrorists but was shot in the chest.\n\n In the brief respite that followed, he kept directing his commandos, inspite of serious injuries. Sensing further danger to his comrades, he charged in a daring close quarter combat killing two more terrorists and attained martyrdom fighting for his motherland in the finest traditions of Indian Army.\n\nFor this act of conspicuous gallantry, inspiring leadership and exceptional courage far beyond call of duty.\n\n Major Mohit Sharma, SM was awarded 'Ashok Chakra' (Posthumous) on 15 Aug 09."
    },
    //    {
    //      "id": "1057",
    //      "name": "Major D. Sreeram Kumar",
    //      "title": "title",
    //      "operation": "operation",
    //      "url": "https://i.ytimg.com/vi/kQ9gOJ8OtZ0/hqdefault.jpg",
    //      "moredescription": "moredescription",
    //      "description": "",
    //      "description1": "A",
    //      "description2": "A",
    //      "description3": "A"
    //    },
    {
      "id": "1056",
      "name": "Hemant Karkare-Ashok Kamte-Vijay Salaskar",
      "title": "2009",
      "operation": "2008 Mumbai attacks",
      "url": "http://epaper.timesofindia.com/Repository/getimage.dll?path=TOIBG/2009/11/22/40/Img/Pc0400700.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit :Mumbai Anti-Terror Squad(ATS)",
      "description1": "Department :Mumbai Police ",
      "description2": " \n",
      "description3": "\n    At 9.45 p.m. on November 26, 2008, while having his dinner at his Dadar residence, he received a call about a terrorist attack at Chatrapati Shivaji Terminus (C.S.T.) station. He switched on the TV for news and left at once with his driver and bodyguards for C.S.T. \n\nThere he donned a bullet-proof vest and helmet (shown on news channels live), and went to Platform No.1, but found it deserted. He was then informed that the terrorists had moved to the Cama and Albless Hospital ('Cama') next to the Azad Maidan police station.\n\nThe operation was difficult as it was dark and the terrorists were well prepared and virtually on a fidayeen mission. The officers, with a few constables, went into Cama from the back. A couple of constables were left stationed at the back entrance of Cama, while the rest boarded a Qualis jeep. \n\nSenior Police Inspector Vijay Salaskar asked the driver of the Qualis to let him take over at the wheel.\n\n About that time, they heard on the wireless that the terrorists were hiding behind a red car.As they turned from the Crime Branch office towards Rang Bhavan looking for the red car, near the Corporation Bank ATM, they saw a terrorist running. Ashok Kamte, ACP of Mumbai East, or Salaskar – or both – fired, the bullet hitting the terrorist on his arm, his AK-47 fell down. \n\nHe was Kasab, the lone terrorist captured alive later. As they were thinking of getting down, a second terrorist, Ismail Khan appeared and fired a volley of bullets at them. All but one, Assistant Police Inspector Jadhav, died.He was killed in action during the 2008 Mumbai attacks after being shot three times in the chest.\n\n Their bravery was honoured with the Ashoka Chakra on 26 January 2009."
    },
//    {
//      "id": "1055",
//      "name": "Vijay Salaskar",
//      "title": "2009",
//      "operation": "2008 Mumbai attacks",
//      "url": "https://www.iaspaper.net/wp-content/uploads/2016/08/12sld2.jpg",
//      "moredescription": "\n\nmoredescription",
//      "description": "",
//      "description1": "A",
//      "description2": "A",
//      "description3": "A"
//    },
//
//    {
//      "id": "1054",
//      "name": "Ashok Kamte",
//      "title": "2009",
//      "operation": "2008 Mumbai attacks",
//      "url": "https://www.inmemoryglobal.com/wp-content/uploads/2014/11/ashok-kamte-1.jpg",
//      "moredescription": "\n\nmoredescription",
//      "description": "",
//      "description1": "A",
//      "description2": "A",
//      "description3": "A"
//    },
    {
      "id": "1053",
      "name": "Tukaram Ombale",
      "title": "2009",
      "operation": "2008 Mumbai attacks",
      "url": "http://2.bp.blogspot.com/_zS2JDRBdNzk/TOz1wqRfdJI/AAAAAAAACsc/C8fbuisPHAg/s1600/t+omble.jpg",
      "moredescription": "\n\nReference : www.firstpost.com",
      "description": "",
      "description1": "Department : Mumbai Police",
      "description2": "\n",
      "description3": "\n    Omble was on the night shift at a police station off Chowpatty in south Mumbai, when a message was received about two gunmen speeding towards Malabar hill after hijacking a vehicle near Marine Drive.\n\nThe message came after reports of shooting at the Chhatrapati Shivaji rail terminus and hotels like Oberoi and Taj.Omble along with his colleagues took up positions near  Girgaum Chowpatty to stop the Skoda car.\n\n Omble was armed with a baton and a radio.The car approached at a high speed, but stopped 50 feet from the barricade. \n\nSuddenly, the beam lights went on, and the car swerved towards the barricades.Omble was the first to rush out from behind the barricades and attempted to grab Kasab who had jumped out of the vehicle.\n\nWith the terrorists momentarily distracted, Omble sprang toward one of them, Amir Kasab, and gripped the barrel of the AK47 rifle with both hands. With the barrel pointing towards Omble, Amir pulled the trigger. A spray of bullets entered his stomach and intestine. Omble collapsed, but held on to the gun till he breathed his last, stopping Amir from shooting anyone else.\n\nHe was rushed to a nearby hospital but was declared dead by doctors there.However, thanks to Omble's bravery, Kasab was caught alive and confessed to his crime revealing the masterminds who had plotted the attacks from across the border. It also resulted in Pakistan initiating a trial against accused like Jamaat-ud-Dawa chief Hafiz Saeed.\n\nOmble was awarded the nation's highest peace-time gallantry award, the Ashok Chakra."
    }, {
      "id": "1052",
      "name": "Havildar Gajender Singh Bisht",
      "title": "2009",
      "operation": "Operation Black Tornado",
      "url": "http://photogallery.indiatimes.com/photo/5267199.cms",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit: 51 SAG,NSG(Parachute Regiment)",
      "description1": "Service- Indian Army",
      "description2": "Born: 1972 Dehradun\n",
      "description3": "\n    In the night of 27th November 2008, Havildar Gajender Singh was leading his squad in the operation to rescue hostages from the terrorists at Nariman House, Mumbai.\n\nAfter clearing the top floor of the terrorists, he reached the place where the terrorists had taken position. As he closed in, the terrorists hurled a grenade injuring him. \n\nUndeterred, he kept firing and closing in on the terrorists by exposing himself to the hostile fire. In the act, he injured one of the terrorists and forced the others to retreat inside a room. He continued the encounter till he succumbed to his injuries.\n\nHavildar Gajender Singh displayed most conspicuous courage against grave odds and made the supreme sacrifice for the nation in combating the terrorists.\n\nHis act of bravery was honoured with the Ashoka Chakra award by the President of India on 26 January 2009, India's Republic Day."
    }, {
      "id": "1051",
      "name": "Major Sandeep Unnikrishnan",
      "title": "2009",
      "operation": "Operation Black Tornado",
      "url": "https://pbs.twimg.com/media/B3Y4EIACQAAiUQD.jpg:large",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit: 51 SAG,NSG;7 BIHAR",
      "description1": "Service- Indian Army",
      "description2": "Born: 15 March 1977\n",
      "description3": "\n    On the night of 26 November 2008, several iconic buildings in South Mumbai were attacked. One of the buildings where hostage were held was the 100-year-old Taj Mahal Palace Hotel. \n\nUnnikrishnan was the team commander of 51 Special Action Group (51 SAG) deployed in the operation at the hotel to rescue the hostages. He entered the hotel in a group of 10 commandos and reached the sixth floor through the staircase.\n\n As the team descended the stairs, they suspected perpetrators on the third floor. A few women were held as hostages in a room which was locked from the inside. \n\nAfter breaking open the door, the round of fire by the perpetrators hit Commando Sunil Yadav, who was Unnikrishnan's colleague.\nUnnikrishan engaged the perpetrators in a firefight. He arranged for Yadav's evacuation and gave chase to those he had engaged in the firefight who, meanwhile, escaped to another floor of the hotel.\n\nIn the encounter that followed, he was shot from the back before later succumbing to his injuries.\n\nHis last words were,\n \"Do not come up, I will handle them,\" \naccording to NSG officials.\nHe was consequently awarded the Ashoka Chakra, India's highest peace time gallantry award, on 26 January 2009."
    }, {
      "id": "1050",
      "name": "Inspector Mohan Chand Sharma",
      "title": "2009",
      "operation": "Batla House encounter-Delhi",
      "url": "http://im.rediff.com/news/2008/sep/20sld1.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit: Special Cell",
      "description1": "Service- Delhi Police",
      "description2": "Born: 23 September 1965\n",
      "description3": "\n    On 19th September 2008, Shri Mohan Chand Sharma, Inspector, Delhi Police received specific information that a suspected person wanted in connection with the serial bomb blasts in Delhi was hiding in a flat in Batla House area of Jamia Nagar, New Delhi.\n\nShri Sharma leading a seven-member team quickly reached the identified flat. As soon as he entered the flat he received the first burst of fire from the terrorists holed up inside the flat. Undaunted, he returned the fire. In the ensuing exchange of fire, two terrorists were killed and one captured.\n\nShri Mohan Chand Sharma showed exemplary courage and devotion to duty in fighting the terrorists and made the supreme sacrifice for the nation.Sharma was a much-decorated police officer and had won seven gallantry medals including the President of India's Medal in 2008. \n\nHe was awarded the Ashoka Chakra on 26 January 2009."
    }, {
      "id": "1049",
      "name": "Colonel Jojan Thomas",
      "title": "2009",
      "operation": "Encounter with Terrorists(J&K)",
      "url": "http://www.malankarasyriacvoice.com/Images/Col%20Jojan%20in%20Uniform.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org\n              www.daijiworld.com",
      "description": "Unit: 45 Rashtriya Rifles",
      "description1": "Service: Indian Army(Jat Regiment)",
      "description2": "\n",
      "description3": "\n     He once told me \n\"I am in a dangerous operation\" So I said \n\"As a colonel, you probably don't have to be on the front\", to which he said, \n\n\"If one of my soldiers has to be hurt, it has to be over my dead body,\" said Thomas, friend of Colonel Jojan Thomas.\n\nThose who worked with him in the Army also remember him.\n\"For one year, we shared the same tent, same food, he was like a mentor and was posted in Siachen, he was a fantastic leader. \n\nThe men under him were ready to do anything for him,\" said Major Sandhu, Room-mate during Operation Parakram.\n\nBright officer, brave soldier, and a role model leading from the front, Colonel Jojan Thomas will remain an inspiration to many.\n\n\nOn 22 August 2008, he led an operation against terrorists in the forests of Macchal sector in the Kupwara district of Jammu and Kashmir. \n\nIn the process, he killed three terrorists, but sustained several gunshot wounds and succumbed to injuries.\n\n For his bravery, he was posthumously awarded the Ashoka Chakra, the highest peace time military decoration in India."
    }, {
      "id": "1048",
      "name": "Havildar Bahadur Singh Bohra",
      "title": "2009",
      "operation": "Search Operation Lawanz(J&K)",
      "url": "http://www.indianparachuteregiment.kar.nic.in/11.gif",
      "moredescription": "\n\nReference : www.indianparachuteregiment.kar.nic.in",
      "description": "Unit: 10th Battalion(Special Forces)",
      "description1": "Service: Indian Army(Parachute Regiment)",
      "description2": "Born in Uttarakhand\n",
      "description3": "\n     On 25 September 2008, at 1815 hours he observed a group of terrorists.\n\nHavildar Bahadur Singh Bohra was the squad commander of A Assault Team tasked for search operations in snowbound, inhospitable mountainous terrain in General Area Lawanz at an altitude of 14000 feet.\n\n He stealthily approached to intercept the terrorists. Greatly outnumbered and sensing grave danger to his comrades, Havildar Bahadur Singh Bohra drew extremely heavy automatic fire onto himself. \n\nHe charged and killed one terrorist.In the intense fire, he suffered gun shot wounds to the left shoulder but unmindful of his physical condition, encouraging and directing his comrades, he pressed on with the assault and killed the second terrorist at extreme close range.\n\nRefusing evacuation, instructing his comrades to cover his move, he lobbed a grenade and in the last act of supreme valor charged and killed one more terrorist in hand to hand combat before succumbing to his injuries.\n\n Inspired by his supreme sacrifice his comrades killed ten more terrorists.For his inspiring leadership, conspicuous bravery, selflessness and supreme sacrifice for the nation beyond the call of duty.\n\nHavildar Bahadur Singh Bohra was awarded‘ASHOK CHAKRA’ (Posthumously) "
    },
    {
      "id": "1047",
      "name": "Meghalaya cop R. P. Diengdoh",
      "title": "2009",
      "operation": "Jungles Of Meghalaya",
      "url": "http://www.livefistdefence.com/wp-content/uploads/2009/01/1.-RP_DIENGDOH-762219.jpg",
      "moredescription": "\n\nReference : pib.nic.in",
      "description": "",
      "description1": "Service: Meghalaya Police",
      "description2": "\n",
      "description3": "\n     On 6th November 2007, information was received that about ten militants, armed with automatic rifles and a huge quantity of explosives have set up a camp in the jungles of Meghalaya.\n\nShri RP Diengdoh volunteered to lead the police party in the operations against the militants. \n\nThe police party reached the site the next day just before dawn and charged into the camp to flush out the militants.\n\n  The militants opened heavy fire on the assault team.  Shri Diengdoh boldly returned the fire and shot dead one militant. \n\n However, he was hit by a bullet.  Unmindful of the grave injury, he continued to lead the team and managed to capture two dreaded militants.\n\nShri RP Diengdoh displayed exemplary dedication to duty and pre-eminent valour in making the supreme sacrifice while fighting the militants.\n\n For his bravery, he was posthumously awarded the Ashoka Chakra, the highest peace time military decoration in India.\n\nThe President of India noted in the Ashoka Chakra citation that Diengdoh displayed exemplary dedication to duty and pre-eminent valour in making the supreme sacrifice while fighting the militants"
    }, {
      "id": "1046",
      "name": "Assistant Commandant Pramod Kumar Satapathy",
      "title": "2009",
      "operation": "Anti-Naxal Operation",
      "url": "http://orissadiary.com/shashwat/images/allnewsimage/5881.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit : Special Operation Group",
      "description1": "Service: Orissa Police",
      "description2": "\n",
      "description3": "\n     In the night of 15 February 2008 about 500 heavily armed Naxalites carried out simultaneous attacks on police at various locations in and around Bhubaneswar looting many weapons and killing several police personnel. \n\nThereafter, they hid in nearby jungles .Assistant Commandant Shri Pramod Kumar Satapathy training in charge of the Special Operation Group along with a mere 20 police personnel reached the elevated position taken by the naxalites inside the jungle and immediately mounted an assault on them.\n\n The Naxalites retaliated with heavy fire on the police team and in a fierce encounter lasting for about two hours. Shri Satapathy led the operations with exemplary courage before making the supreme sacrifice.\n\nShri Pramod Kumar Satapathy displayed highest degree of bravery and dedication to duty in the fight against Naxalites.\n\nHe laid down his life in the process of fighting armed naxalites on 15 February 2008 and has been awarded with the Ashoka Chakra posthumously."
    }, {
      "id": "1045",
      "name": "Major Dinesh Raghu Raman",
      "title": "2008",
      "operation": "Operation in Baramulla(J&K)",
      "url": "http://sainiksamachar.nic.in/englisharchives/2008/feb01-08/06-07(03).jpg",
      "moredescription": "\n\nReference : www.daijiworld.com",
      "description": "Unit : 19th Battalion(Jat Regiment)",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n     He was just days away from flying home to see his first child when he led his men upfront in a bloody encounter with intruding militants in Kashmir valley and rescued a colleague caught in the firing line.\n\nBraving heavy gunfire from holed up Lashkar-E-Toiba militants in Ringwari hamlet in Tangmarg in Baramulla district, the 34 Rashtriya Rifles officer led his men in the encounter billed as the bloodiest gunfight in Kashmir valley last year in which nine terrorists were killed.\n\nRaman rushed to the gunfight site on hearing about his forces cordoning off a house in the hamlet following inputs that a big group of terrorists were holed up in the house after managing to sneak across the LOC.\n\n Raman also went headlong into the terrorist firing line to rescue his colleague Major K P Vinay, in the best traditions of camaraderie in the army.\n\nAfter slaying a number of terrorists, Raman brought back Major Vinay from the firing line and in the process received shots in his chest and legs.Raman along with his injured fellow soldiers was airlifted to Srinagar base hospital where he succumbed to injuries.\n\nAs he was being taken away from the encounter site, the profusely bleeding Raman's last words to his men were \"don't let any terrorist escape\". Raman's wife Latha, an employee of Tata Consultancy Services (TCS) was on an assignment to London and had just returned as she was expecting her first child in two months time.\n\n Raman had applied for leave to join his wife.Receiving his body at Palam technical area here, his father veteran Subedar Major (honorary captain) S Krishnamurthy said \"despite losing my son I would still advise my grandchild who is yet to born, to join the Army and serve the nation\""
    }, {
      "id": "1044",
      "name": "Captain Radhakrishnan Nair Harshan",
      "title": "2007",
      "operation": "Encounter at Kaingur Nar",
      "url": "http://sainiksamachar.nic.in/englisharchives/2008/feb01-08/06-07(05).jpg",
      "moredescription": "\n\nReference : www.indianparachuteregiment.kar.nic.in",
      "description": "Unit : Elite‘Red Devil’2nd Battalion",
      "description1": "Service : Indian Army(Special Forces)",
      "description2": "Born : 15 April 1980\n",
      "description3": "\n     On 07 Mar 2007, Captain Harshan R, while leading a small team, observed suspicious movement in Kaingur Nar MT-3245.  Using his field craft skills the officer crawled into the underbrush and eliminated one terrorist at point blank range.\n\n  The other terrorist immediately opened heavy fire on Harshan at which the officer charged under fire and shot him too thus single handedly eliminating two terrorists.\n\nOn 20 Mar 07, on specific input of Chotimargi MT-3448, Captain Harshan, unmindful of continuous snowfall, cordoned off the suspect house with his troops.\n\n   At 0350 hours, four terrorists rushed out firing towards Harshan and his buddy.  Despite being outnumbered, Harshan displayed steel nerves and killed the leading terrorist on the spot but received a gunshot to his thigh.\n\n  Unmindful of his injury, the officer, displaying conspicuous bravery, killed another terrorist charging at him.\n\n  In the process, Harshan received gunshot wound on his neck.Despite being grievously injured, the officer lobbed a grenade and continued engaging the terrorists, injuring another one before succumbing to his injuries.\n\nCapt Harshan has displayed rarest of rare courage in eliminating four terrorists including two top leaders. For his selfless act and gallantry, Capt Harshan R was awarded ASHOKA CHAKRA (Posthumously)."
    }, {
      "id": "1043",
      "name": "Naib Subedar Chuni Lal VrC, SM",
      "title": "2007",
      "operation": "Militant flush-out operation(J&K)",
      "url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Naib_Subedar_Chuni_Lal.jpg/220px-Naib_Subedar_Chuni_Lal.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit :  8 JAK Light Infantry",
      "description1": "Service : Indian Army",
      "description2": "Born : 6 March 1968\n",
      "description3": "\n     On 24 June 2007, Lal was in charge of a post in Kupwara, Jammu and Kashmir. The post was at height of 14,000 feet where visibility on that cloudy night was just 5 metres and temperature was minus 5 degrees.\n\n Around 3:30am, he detected some movement across the fence on the Line of Control and decided to check it.\n He deployed his soldiers at the LoC. An exchange of fire followed, which continued for almost an hour. \n\nNaib Subedar Chuni Lal and his soldiers surrounded the whole area and searched for their assailants till dawn. Finally as Naib Subedar Chunni Lal and his team were approaching to search a sketchy bushy patch, they were suddenly fired upon.\n\n The men continued to close on to the area where their attackers were hiding and killed two of them on the spot. In the gunfire, two army soldiers were seriously wounded and lay close to where their attackers hid. With disregard to his personal safety, Chuni Lal crawled towards the wounded men and pulled them to safety thus saving their lives.\n\n Anticipating more hidden attackers, he continued to search the area. His anticipation proved right and he saw a third attacker trying to escape. Naib Subedar Chuni Lal charged at him with his weapon and killed him.\n\n Unfortunately, an exchange fire from the attacker split opened Naib Subedar Chunni Lal’s abdomen and he began to lose lot of blood. He took cover behind a rock, continued to fire and did not allow the other attackers to break the cordon.\n\n Under his leadership the two remaining attackers were also killed.Chuni Lal had lost a large volume of blood and died by the time a helicopter could airlift him to nearest Army Hospital.\n\n For his actions in battle, Naib Subedar Chuni Lal was posthumously awarded the Ashok Chakra on 15 August 2007 for saving the lives of his fellow men, displaying most conspicuous bravery, demonstrating battle field leadership and laying down his life to protect the country."
    }, {
      "id": "1042",
      "name": "Colonel Vasanth Venugopal",
      "title": "2007",
      "operation": "Operation in Uri(J&K)",
      "url": "http://www.thebetterindia.com/wp-content/uploads/2016/01/Subhashini-Vasanth7.png",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Unit : 9 Maratha Light Infantry",
      "description1": "Service : Indian Army",
      "description2": "Born : 25 March 1967",
      "description3": "\n     \"I go where my men go\", \n\nhe told his mother when she asked him if a colonel should participate in all operations conducted by his men. \n\n\nOn 28 October 2006 he took over as Commanding Officer of 9 Maratha Light Infantry. The battalion was at that time posted in Uri Sector of Jammu and Kashmir.\n\nOn July 31, his troops surrounded terrorists in a forest and blocked all their escape routes in the Uri sector in Kashmir. Despite being wounded, the colonel and his men engaged the terrorists in a fierce encounter.\n\n The daring officer led from the front and helped gun down the terrorists. Tragically, he was hit by a bullet and died in hospital.\n\n \"He ensured that all eight infiltrators were wiped out even as he laid down his life for the nation.\n\n \"He was a true soldier who was dedicated to the country and his force\",\n General J. J. Singh, Chief of Army Staff at the time, said after Colonel Vasanth's death.\n\nHe was posthumously awarded the Ashoka Chakra,the peacetime equivalent of the Param Vir Chakra, India's highest military decoration for gallantry awarded for the \"most conspicuous bravery or some daring or pre-eminent valour or self-sacrifice\" other than in the face of the enemy.\n\n Colonel Vasanth is the first person from the state of Karnataka, India to have received this honour."
    }, {
      "id": "1041",
      "name": "Lt. Triveni Singh",
      "title": "2004",
      "operation": "Terrorist attack on Jammu Railway Station",
      "url": "http://pib.nic.in/archieve/image/f2004030801.jpg",
      "moredescription": "\n\nReference : www.rediff.com",
      "description": "Unit : 5 J&K Light Infantry",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n     He was adjutant of his unit and was in the room adjoining the commanding officer's office when information about the terrorist attack came in.\n\n The commanding officer asked Triveni to alert the officers and the soldiers on duty at the barracks to move to the Jammu railway station.\n Triveni believed this would delay the operation. He suggested, instead, that he be allowed to lead the Quick Reaction Team to tackle the terrorists.\n\nAs the team neared the railway station, Triveni was told the terrorists were firing indiscriminately.\n\n Seven lives, including that a policeman, two BSF jawans, one railway policeman and two civilians had already been lost. Several others were injured.In order to save time, he asked his driver to race the jeep across the railway tracks towards the captive station.\n\n Triveni, who was leading his men from the front, succeeding in eliminating the first terrorist. He targeted the second one, who lobbed a grenade at him.\n\n According to army records, Triveni shot dead the second terrorist despite sustaining serious injuries in the grenade attack. \n\nThe young officer then reported to the general officer commanding his division.\n\n \"Task accomplished,\"\n\n he said, before collapsing.\n\n\"Let every mother give birth to children like Triveni who refuse to abandon their guns and run away from the battlefield even if their decision costs them their life,\"\n\n says his proud mother, even as the tears well in her eyes.\n\nLieutenant Triveni Singh was an Officer of the Indian Army from 5 Jammu and Kashmir Light Infantry and was posthumously awarded the Ashok Chakra Award."
    }, {
      "id": "1040",
      "name": "Paratrooper Sanjog Chhetri",
      "title": "2003",
      "operation": "Operations in\"Hill Kaka\"(J&K)",
      "url": "http://www.indianparachuteregiment.kar.nic.in/images/par.jpg",
      "moredescription": "\n\nReference \n: www.indianparachuteregiment.kar.nic.in",
      "description": "Unit : 9 PARA (Special Forces)",
      "description1": "Service :  Indian paratrooper",
      "description2": "\n",
      "description3": "\n     Paratrooper Sanjog Chhetri of 9 PARA (Special Forces) was part of a team tasked for carrying out operations on terrorist location at \"Hill Kaka\" (J&K) on 22nd April 2003.\n\n The commandos while approaching the terrorist hide out drew heavy automatic fire. Sensing danger for his comrades Sanjog assaulted the hideout and killed one terrorist.\n\n Inspite of being wounded and bleeding profusely the young commando kept on assaulting till he shot and killed one more terrorist.\n\n By his gallant action Paratrooper Sanjog Chhetri provided chance for his comrades to engage the remaining terrorists effectively, how ever he succumbed to his injuries. The team of commandos in retaliation killed all the remaining thirteen terrorists.\n\n For his brave action Paratrooper Sanjog Chhetri was awarded the highest peace time gallantry award of ASHOK CHAKRA posthumously."
    }, {
      "id": "1039",
      "name": "Subedar Surinder Singh",
      "title": "2002",
      "operation": "Encounter with Terrorists(LoC)",
      "url": "",
      "moredescription": "\n\nReference : www.rediff.com",
      "description": "3rd Battalion,Sikh Regiment",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n     On 3 March 2002,when Subedar Singh and his platoon spotted a group of terrorists near the LoC. The soldiers did not open fire, but waited for the terrorists to close in.\n\n When the group was hardly a few metres away, the sergeant sprang up and shot one of them dead.The other terrorists quickly dispersed into the nearby jungles.\n\n Subedar Singh then organized a search party and went after them. During the operation, he came under fire from behind a boulder.With utter disregard to his personal safety and with bullets whizzing about, the sergeant was crawling forward when a terrorist pounced upon him.\n\n In the ensuing close combat Surinder Singh shot him dead.Four other terrorists sneaked into a house in Village Tarala and started firing at the soldiers.\n\nWhile the sergeant was retreating after creating the opening, the terrorists threw a grenade at him. Subedar Surinder Singh sustained multiple splinter injuries all over the body, but continued fighting and killed two more terrorists.\n\nHe died while being evacuated from the scene of the encounter. But he had killed four of the six terrorists who were slain in that operation.\n\nFor his bravery, Singh was posthumously awarded the Ashoka Chakra, the highest peace time military decoration in India."
    }, {
      "id": "1038",
      "name": "Naik Rambeer Singh Tomar",
      "title": "2002",
      "operation": "Encounter with Terrorists(J&K)",
      "url": "",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "15th Battalion,Kumaon Regiment.",
      "description1": "Service : Indian Army",
      "description2": "Born : August 15, 1970\n",
      "description3": "\n     While being sent on deputation to 26 Rashtriya Rifles in Jammu and Kashmir,Tomar single-handedly searched a house for terrorists.\n\n In the process, he killed four of them but sustained severe gunshot wounds and succumbed to his injuries.\n\n For his bravery, he was posthumously awarded the Ashoka Chakra, the highest peace time military decoration in India."
    }, {
      "id": "1037",
      "name": "Kamlesh Kumari",
      "title": "2001",
      "operation": "2001 Indian Parliament attack.",
      "url": "https://pbs.twimg.com/media/Cbmev0IUAAQSc5H.jpg",
      "moredescription": "\n\nReference : archive.mid-day.com",
      "description": "Elite 104 Rapid Action Force",
      "description1": "Service : Central Reserve Police Force",
      "description2": "Born on 1969\n",
      "description3": "\n    On December 13, at around 11.40 am, Kamlesh heard gunshots and grenade blasts. She was carrying only her wireless set and along with every one present at the spot, she ducked for safety.\n\n But even though bullets were being fired from every direction, her mind was more than alert.\n\n \"She was the first to notice the suicide bomber. In fact every one got so busy after the first bullet was fired that nobody noticed that a human bomb was moving under the cover of fire towards the Building Gate No 11,\" said the senior officer.\n\nKamlesh was able to monitor the militants from inside her picket.\n\n She immediately informed the Duty Officer (DO) and the Guard Commander on their wireless sets about the human bomb.\n\n But by then the militants were dangerously close to Gate No 11. Kamlesh noticed a couple of CRPF men engaging the militants.\n\n Not thinking about her safety, she ran out of her picket to shout at Constable Sukhwinder Singh who had managed to stall the militants'  movement.\n\n \"Her shout alerted the securitymen about the bomber. But she was unarmed and in the open and her cries were heard by the militants too.\n\n Even before any one could respond, Kamlesh collapsed as terrorists' bullets hit her stomach,\" recalled Sukhwinder Singh, who was awarded the Shaurya Chakra for the same operation.\n\nSingh immediately shot dead the suicide bomber whose body exploded after hitting the ground.\n\n\"But a big tragedy was averted due to the alertness of a brave lady\",\n said the CRPF officer.\n\nConstable Kamlesh Yadav was posthumously awarded the nation's highest peacetime award, the Ashoka Chakra, by the President of India on Republic Day in 2002 in honour of her bravery and courage."
    }, {
      "id": "1036",
      "name": "Major Sudhir Kumar Walia",
      "title": "2000",
      "operation": "Encounter with Terrorists Kupwara(J&K)",
      "url": "http://2.bp.blogspot.com/_Tg_CazNpZKI/TSLnK9jZRqI/AAAAAAAAACw/KD_h0Rf4CRI/s1600/Sudhir.jpg",
      "moredescription": "\n\nReference : www.indianparachuteregiment.kar.nic.in",
      "description": "9 Parachute (Special Forces)",
      "description1": "Service : Indian Army(Jat Regiment)",
      "description2": "\n",
      "description3": "\n    On 29th August, Major Sudhir Kumar Walia with a squad of five commandos was on a \"Search and Destory\" mission in the dense jungle of \"Hafruda Forest\" in Kupwara district, J&K.\n\n The squad suddenly chanced upon a well camouflaged hide out having twenty terrorists.\n\n Major Sudhir Kumar surged ahead of his squad and taking advantage of the element of surprize, neutralised the sentries and single handedly killed four militants.\n\n Inspite of the grave injuries during this gallant action, which were to prove fatal, the brave officer kept directing his men with his radio set and ultimately ensured that the terrorists were eliminated.\n\n This gallant officer went beyond the call of duty and in the highest tradition of the Army sacrificed his life for the country, for which he was awarded the highest peace time gallantry award of ASHOK CHAKRA posthumously."
    }, {
      "id": "1035",
      "name": "Second Lt. Puneet Nath Dutt",
      "title": "1997",
      "operation": "Encounter ith Terrorists(Srinagar,J&K)",
      "url": "",
      "moredescription": "\n\nReference : unsungwarheroes.wordpress.com",
      "description": "1/11 Gorkha Rifles",
      "description1": "Service : Indian Army",
      "description2": "29 April 1973\n",
      "description3": "\n    The operation started in wee hours of 20 July 1997 and the building was completely surrounded by 0400 hours.\n\n The militants were secure within the three storied building located in a thickly populated and congested area.\n\n At daybreak when the terrorists found that they were surrounded, instead of surrendering to the Indian Army, they resorted to indiscriminate firing.\n\n Utmost restraint had to be exercised while trying to liquidate the onslaught so as to avoid any damage to innocent civilian life and property in the vicinity of the building. One militant visualizing the hopeless situation ran out firing on the search party.\n\n Seeing the militant firing on his troops, he ordered his troops to take cover and with utter disregard to personal safety sprang up and shot the militant in an eye-to-eye encounter.\n\n Meanwhile sensing that the militants were trying to escape, he showed exemplary presence of mind & initiative and maneuvered his position to block the rear exit of the building.\n\n Displaying indomitable courage and guts, he shot down another militant who was trying to escape. The remaining militants inside the building meanwhile continued firing on our troops and as a result of which he was seriously wounded.\n\n But he did not give in and maintained his sustained crusade against foreign mercenaries and taking courage in both hands, lobbed a grenade inside the building, killing the remaining militants and destroying a considerable amount of the enemy’s arms & ammunition.\n\n Almost single handedly destroying the enemy, our hero attained martyrdom and immortalized himself by carving a niche in the annals of his Regiment and the Indian Army’s history.\n\n For his bravery and in recognition of the initiative and dare devilry displayed in the pursuit of his mission to eliminate militancy from the face of his motherland, 2nd Lieutenant Puneet Nath Datt was awarded the Ashok Chakra (posthumously), the country’s highest gallantry award in peace time on 15 August 1997.\n\nMrs.Anita Datt received the award on behalf of her brave son."
    }, {
      "id": "1034",
      "name": "Lt Colonel Shanti Swaroop Rana",
      "title": "1997",
      "operation": "Encounter with Terrorists-Kupwara(J&K)",
      "url": "http://3.bp.blogspot.com/-TWzZiOMt4Wc/TrGCMjBPv4I/AAAAAAAAAN0/Acmz507QoVc/s1600/Singh.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "3rd Battalion, Bihar Regiment.",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n    On 2 November 1996, Lt Col Swarup Rana while serving with 13 Rashtriya Rifles was entrusted with the task of destroying two terrorist camps in the Hephrude forest of Kupwara District in Jammu & Kashmir. He spotted four well fortified hideouts stocked heavily with arms and ammunition including tonnes of explosives.\n\n In a gallant and swift strike, he destroyed these hideouts. One more well concealed hideout came to his notice. During the action that followed, the terrorists resorted to heavy firing from their well fortified bunker.\n\n Lt Col Rana organised his troops, crawled towards the bunker and threw hand grenades inside. Two foreign mercenaries came out firing heavily. He killed both of them instantaneously.\n\nMeanwhile, the terrorists seriously injured Lt Col Rana in heavy firing from another location. In spite of this, the gallant officer kept on boosting the morale of his soldiers. \n\nWhen one more terrorist advanced towards the soldiers, Lt Col Rana without caring for this own life, charged and killed him in a hand-to-hand encounter. In this action, this gallant officer sustained fatal bullet injuries and made the supreme sacrifice. Lt Col Rana displayed indomitable courage, patriotism and gallantry of the highest order.\n\n For this act of indomitable courage, Lt Col SS Rana was awarded the Ashoka Chakra posthumously."
    }, {
      "id": "1033",
      "name": "Captain Arjun Singh Jasrotia",
      "title": "1996",
      "operation": "Encounter with Terrorists Lolab Valley(J&K)",
      "url": "http://globalmarathi.com/20111227/images/5420480151731829347/4921604670787523160_Org.JPG",
      "moredescription": "\n\nReference : www.indianparachuteregiment.kar.nic.in",
      "description": "9 PARA (Special Forces)",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n    On 15 September 1995, terrorists attacked Jasrotia's team while leading his team in Lolab Valley, J&K came under heavy rocket and small arm fire.\n\n In order to extricate his men, this brave officer crawled forward and inspite of being injured gravely killed one terroist with his commando knife and neutralized the other terrorist by lobbing grenades.\n\n His brave and gallant action gave oppurtunity for his comrades to take cover and engage the remaining terrorists effectively. In the ensuing firefight the brave officer succumbed to his injuries. However in retaliation the commandos eliminated all remaining terrorists.\n\n For his gallant action Captain Arun Jasrotia was awarded with the highest peace time gallantry award of ASHOK CHAKRA posthumously. "
    }, {
      "id": "1032",
      "name": "Major Rajiv Kumar Joon",
      "title": "1995",
      "operation": "Search operation for Militants Pulwama(J&K)",
      "url": "http://tera-3.ul.cs.cmu.edu/NASD/4a7f1db4-5792-415c-be79-266f41eef20a/upgrade-archive-06-14-2007/data/upload-allbooks/disk%203/Jan%20N/ENGLISH/Bravest_Of_The_Brave_Heroes_Of_The_Indian_Army/HTML/00000106-1.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "22nd Battalion,Grenadiers Regiment.",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n    On 16 September 1994, he was leading a search operation for militants in the Pulwama of Jammu and Kashmir when his team came under heavy fire from the militants.\n\n He crawled forward to the militant hideout and lobbed hand grenades, killing a militant. Although he sustained serious injuries, he hesitated to be evacuated and killed another militant.\n\n Later, he succumbed to his injuries. For his bravery, he was posthumously awarded the Ashoka Chakra and Shaurya Chakra."
    }, {
      "id": "1031",
      "name": "Subedar Sujjan Singh",
      "title": "1995",
      "operation": "Encounter with Terrorists Kupwara(J&K)",
      "url": "http://indianarmy.nic.in/Site/FormTemplete/..%5C..%5Cwritereaddata%5CImages%5CContent%5C1396%5CSujjan.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "13th Battalion-Kumaon Regiment",
      "description1": "Service : Indian Army",
      "description2": "Born : March 30, 1953(Haryana)\n",
      "description3": "\n    On 26 September 1994, Singh was the search party commander of an operation to eliminate terrorists from the jungles near the Zalurah village of Kupwara in Jammu and Kashmir.\n\n The team identified the militant hideouts but faced heavy gunfire from them, within a distance of 15 metres from the hideout.\n\n Sensing that he needed to provide cover for his team, Singh physically charged towards the hideout. He sustained several gunshot wounds but still continued to move forward until bullets pierced his helmet and killed him instantly.\n\n Singh's act ensured that all the terrorists were killed, their arms and ammunitions recovered, and his team saved. \n\nFor his bravery, he was posthumously awarded the Ashoka Chakra, the highest peace time military decoration in India."
    }, {
      "id": "1030",
      "name": "Lt Colonel Harsh Uday Singh Gaur",
      "title": "1995",
      "operation": "Terrorists in Baramulla(J&K)",
      "url": "http://tera-3.ul.cs.cmu.edu/NASD/4a7f1db4-5792-415c-be79-266f41eef20a/upgrade-archive-06-14-2007/data/upload-allbooks/disk%203/Jan%20N/ENGLISH/Bravest_Of_The_Brave_Heroes_Of_The_Indian_Army/HTML/00000108-1.jpg",
      "moredescription": "\n\nReference : www.facebook.com/Indianarmy.adgpi",
      "description": "10 Bihar",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n    On 29 November 1994, he received an information that 10 to 12 foreign mercenaries were hiding in Dazipura village of Baramulla district.\n\n He immediately organised a combing operation to flush out the mercenaries. While combing the area along with his Quick Reaction Team at 0700 hours, he came under heavy gun fire of the mercenaries.\n\n Lieutenant Colonel Gaur quickly readjusted two companies so that all escape routes could be blocked while he himself got down to neutralise the gun fire.\n\n Despite heavy exchange of fire, he kept moving forward from a flank and reached close to the firing position of the mercenaries.\n\n His bold and unexpected action completely surprised the mercenaries. In the ensuing exchange of fire, he killed three mercenaries.\n\n Later he went ahead to neutralise the Universal Machine Gun that was firing at him from behind a rock.\n\n With bullets flying all around him, he bravely crawled forward and lobbed a hand grenade at the gun position, killing yet another mercenary and silenced the gun.\n\n During the encounter, he himself was fatally wounded. The sacrifice made by him was an act of courage,beyond the call of duty that set an example of grit and dogged determination to fight the militants.\n\n For the daredevil act Lt Colonel Harsh Uday Singh Gaur was posthumously awarded AshokaChakra."
    }, {
      "id": "1029",
      "name": "Colonel Neelakantan Jayachandran Nair",
      "title": "1994",
      "operation": "Ambushed by Naga rebels",
      "url": "https://upload.wikimedia.org/wikipedia/en/3/34/Col_N._J._Nair.jpg",
      "moredescription": "\n\nReference : www.revolvy.com",
      "description": "16 Maratha Light Infantry",
      "description1": "Service : Indian Army",
      "description2": "Born on 1951-Ernakulam, Kerala\n",
      "description3": "\n    In 1983, in Mizoram, Colonel Nair engaged the insurgents in close quarter combat and he was awarded the Kirti Chakra in recognition of his exceptional gallantry.\n\n In December 1993, he was leading an advance party of convoy in Nagaland, when they were ambushed by about one hundred insurgents.\n\n The overwhelming fire from automatic weapons killed 1 Junior Commissioned officer and 13 jawans on the spot.\n\n Colonel Nair who was seriously injured did not lose his courage nor was unnerved. Unmindful of his serious injury, he organised his jawans in an assault line and charged at the insurgents when they broke ranks and fled.\n\n For his courage and gallantry he was awarded the Ashoka Chakra posthumously in 1994."
    },

    {
      "id": "1015",
      "name": "Lt Rakesh Singh",
      "title": "1993",
      "operation": "Flushing out Afghan Mujahadeen",
      "url": "http://globalmarathi.com/20111227/images/5420480151731829347/5132119712378473174_Org.JPG",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "22nd battalion of Grenadiers",
      "description1": "Service : Indian Army",
      "description2": "Born :18 September 1970\n",
      "description3": "\n    On 5 December 1992 at the age of 22, from injuries sustained while attempting to cut off the escape of eight fleeing Afghan Mujahadeen who had been flushed out during operations.\n\n Single-handedly, he managed to kill five of the Mujahadeen, but sustained injuries during the encounter and died of his injuries.\n\nIn 1993 he was awarded India's highest peace time gallantry award, the Ashoka Chakra for his supreme sacrifice."
    },

    {
      "id": "1028",
      "name": "Sandeep Sankhla",
      "title": "1992",
      "operation": "Search and Cordon operation(Kupwara-J&K) ",
      "url": "http://images.tribuneindia.com/cms/newsimages/image/20150208/ed16.jpg",
      "moredescription": "\n\nReference : www.tribuneindia.com",
      "description": "18 Dogra",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n    On August 8, 1991, Major Shankla’s battalion, 18 Dogra, carried out a search and cordon operation at Zafarkhani village in Kupwara district.\n\n One soldier was injured in the crossfire with terrorists and Major Shankla, unmindful of the enemy fire, crawled out to drag him to safety, killing a terrorist.\n\n The terrorists then lobbed two grenades at the officer, of which one he hurled back at them, sustaining splinter and bullet injuries in the process.\n\n But he kept fighting till he lost consciousness.The operation had resulted in the elimination of nine terrorists and apprehension of 22.\n\n“Karmanye vadhikaraste ma phaleshu kada chana (do your duty without worrying about the result),” \n\nReads the Devangiri inscription on a scene of the battlefield of Kurukshetra from the Mahabharata on the wall next to the portrait of Major Sandeep Shankla in his parents’ living room in Panchkula.\n\nThe picture above, one of the few possessions that keep alive the warrior’s memory, had once adorned his room in Jammu and Kashmir when he fell in action while displaying conspicuous bravery, for which he was decorated with the Ashok Chakra."
    }, {
      "id": "1027",
      "name": "Randhir Prasad Verma IPS",
      "title": "1991",
      "operation": "Resisting a Robbery attempt(Dhanbad)",
      "url": "http://www.wnsstamps.post/stamps/2004/IN/IN037.04.jpg",
      "moredescription": "\n\nReference : www.wikiwand.com",
      "description": "Bihar Police(IPS)",
      "description1": "Service : Indian Police",
      "description2": "Born in 1952-Bihar\n",
      "description3": "\n    Randhir Prasad Verma was an Indian police officer who died while trying to resist a robbery attempt in a bank in Dhanbad. He was posthumously awarded the gallantry award Ashoka Chakra.\n\n The Government of India also issued a Commemorative postage stamp in his honor in 2004.\n\n He joined the Indian Police Service in 1974. As a police officer he eliminated many criminal gangs.While serving in Dhanbad as the Superintendent of Police he died while resisting robbery at Bank of India branch on 3 January 1991.\n\nHis widow Rita Verma later joined politics and was elected to Lok Sabha from BJP ticket.\n\n A Chowk named \"Randhir Verma Chowk\" is a busy lane named after him in Dhanbad. His wife lives with two growing sons."
    }, {
      "id": "1026",
      "name": "Neerja Bhanot",
      "title": "1987",
      "operation": "Plane Hijack-Karachi(Pakistan)",
      "url": "https://upload.wikimedia.org/wikipedia/en/f/f5/Neerja_Bhanot_(1963_%E2%80%93_1986).jpg",
      "moredescription": "\n\nReference : en.wikipedia.org \n               www.thebetterindia.com",
      "description": "Senior flight Purser on Pan Am Flight 73 ",
      "description1": "Pan American World Airways",
      "description2": "Born :  7 September 1963\n",
      "description3": "\n    On the morning of September 5, 1986, Pan Am Flight 73 landed in Karachi. It had arrived from Mumbai and, had nothing gone wrong, would have departed for Frankfurt and onward to New York City.\n\n The flight was carrying, among members of other nationalities, Indians, Germans, Americans, and Pakistanis.\n\nUnfortunately, the flight was hijacked while it was parked on the tarmac at Jinnah International Airport in Karachi.Four heavily-armed terrorists, dressed as airport security guards, entered the aircraft while firing shots from an automatic weapon and seized control of the plane.\n\nThe hijackers were part of the Abu Nidal Organization, a terrorist organization backed by Libya; they were targeting Americans and American assets.\n\n In the early minutes of the hijacking, they identified an American citizen, dragged him to the exit, shot him dead and threw his body on to the tarmac.After the terrorists boarded the plane, Neerja had alerted the cockpit crew, who escaped through an overhead hatch in the cockpit.\n\n As the senior-most crew member remaining on board, this left Neerja in charge. One of the terrorists asked the flight crew to collect and hand over the passports of all passengers on board.\n\n When Neerja realised that the primary targets of the terrorists were American passengers, she hid their passports – even discarding some of them down the rubbish chute.\n\n From a total of 41 American passengers, only 2 were killed.\n\nAfter holding passengers and crew members hostage for 17 hours on the runway, the terrorists opened fire. Neerja stayed on the plane to help passengers escape, even though she could have been the first to leave.\n\n She was shot while shielding three children from the bullets being fired by the terrorists.The hijack had occurred just two days before her twenty-third birthday.\n\nMost of us will never find ourselves in a high-pressure situation, facing life or death the way Neerja did.\n\n\"True bravery emerges in the face of fear\". \n\nWe might never know what Neerja was thinking or feeling during those terrible hours of the hijacking, but we do know that she chose to respond to the actions of the terrorists with exceptional grace, courage, and grit.\n\n Of the 380 passengers and crew members on Flight 73, 20 were killed.\n\nWhile many others were injured, they did survive – in no small part due to the actions of a 22-year-old flight attendant who chose compassion over cowardice and performed her duty till the very end.\n\nIn addition to saving the lives of many hostages, Bhanot had also helped prevent the plane from getting off the ground.\n\nThe Government of India posthumously awarded Bhanot the Ashoka Chakra Award, India's highest gallantry award for bravery in the face of the enemy during peace time.\n\n She is the youngest recipient and the first woman recipient of this award.\n\nShe also received Justice for Crimes Award(2005),Flight Safety Foundation Heroism Award(1987) and Special Courage Award(2006) for her courage from the United States government, and the Tamgha-e-Insaniyat from Pakistan, an award given for showing great human kindness."
    },
//    {
//      "id": "1025",
//      "name": "Lance Havildar Chhering Mutup",
//      "title": "1985",
//      "operation": "operation",
//      "url": "",
//      "moredescription": "\n\nReference :",
//      "description": " Ladakh Scouts",
//      "description1": "Service : Indian Army",
//      "description2": "Born in Likar,Leh-Ladakh(J&K)\n",
//      "description3": ""
//    },
    {
      "id": "1024",
      "name": "Naik Nirbhay Singh",
      "title": "1985",
      "operation": "operation",
      "url": "http://indianarmy.nic.in/Site/FormTemplete/..%5C..%5Cwritereaddata%5CImages%5CContent%5C1396%5CNirbhay1.jpg",
      "moredescription": "\n\nReferences: indianarmy.gov.in",
      "description": "15th Battalion-Kumaon Regiment",
      "description1": "Service : Indian Army",
      "description2": "Born : May 1, 1958\n",
      "description3": "\n    At 0530 hours on the day of action the company was tasked to storm a Complex.\n\n This building was a virtual fortress and all prior efforts to storm the building failed due to the massive firing from bunkers and pill boxes from inside the Complex and the buildings on the flanks.\n\n When a company advanced to storm the building, the company came under very heavy fire. The companies advance therefore came to a halt. At this stage, Major Bhukant Misra, set a personal example of leadership by running ahead alone.\n\n Seeing that his company commander was charging alone Naik Nirbhay Singh who was light machine gunner Number 1, immediately told his Number 2, Lance Naik Ram Bahor Singh to follow him with the light machine gun and charged towards the base of the Complex.\n\n Naik Nirbhay Singh soon reached the base, took position, mounted the light machine gun and covered his company commander, inspite of very heavy firing from 3-4 medium machine guns from different directions.\n\n This act of courage displayed by Naik Nirbhay Singh enabled Major Bhukant Mishra to hold on at the base until he charged into the foot steps leading into the Akal Takht.\n\n Naik Nirbhay Singh continued to remain in the open under very heavy fire alongwith his light machine gunner Number 2, Lance Naik Ram Bahor Singh, without any fear.\n\n Naik Nirbhay Singh continued to cover the move of his company commander with utter disregard to his personal life.\n\n When  Major Bhukant Misra ultimately stormed into the footsteps of the Complex, Naik Nirbhay Singh saw that a light machine gun was firing from a pot hole on the base of the Complex.\n\n Realising that his company commander's life was in danger, he immediately stood up, exposing himself to grave danger and charged towards the light machine gun that was firing from the pot hole.\n\n While doing so, he was hit by a burst of fire on his leg and was wounded! Undeterred by the injury suffered, Naik Nirbhay Singh, crawled towards the pot hole again exposing himself to the medium machine guns firing all around and lobbed a grenade into the basement, through the pot hole, which silenced the light machine gun.\n\n While Naik Nirbhay Singh was in the process of destroying the light machine gun, he was hit by a medium machine gun burst for the second time and thus laid down his life alongwith his company commander who was also killed by the same medium machine gun.\n\n For this act of gallantry supreme sacrifice, devotion to duty and supreme example of brotherhood, Naik Nirbhay Singh was awarded ASHOK CHAKRA (POSTHUMOUSLY)."
    },
//    {
//      "id": "1023",
//      "name": "Naik Bhawani Datt Joshi",
//      "title": "1984",
//      "operation": "Op Blue Star",
//      "url": "http://tera-3.ul.cs.cmu.edu/NASD/4a7f1db4-5792-415c-be79-266f41eef20a/upgrade-archive-06-14-2007/data/upload-allbooks/disk%203/Jan%20N/ENGLISH/Bravest_Of_The_Brave_Heroes_Of_The_Indian_Army/HTML/00000091-1.jpg",
//      "moredescription": "\n\nReferences: ",
//      "description": "5th Battalion- Garhwal Rifles",
//      "description1": "Service : Indian Army",
//      "description2": "Born : 15th July 1952(UP)",
//      "description3": "A"
//    },
    {
      "id": "1022",
      "name": "Lt. Ram Prakash Roperia",
      "title": "1985",
      "operation": "operation",
      "url": "http://www.jatland.com/w/images/b/b1/Lt_Ram_Prakash_Roperia.gif",
      "moredescription": "\n\nReferences: www.jatland.com",
      "description": " 26th Battalion-Madras Regiment",
      "description1": "Service : Indian Army",
      "description2": "Born : 10 June 1959(Haryana)\n",
      "description3": "\n    On the night of 5th/6th June 1984, during Operation Blue Star, 'C' Company of 26 Madras was tasked to secure the first floor of a strongly held building complex.\n\n The Building Complex was heavily fortified and strongly held by highly motivated terrorists. Lt Ram Prakash Roperia was officiating as the officer commanding 'C' Company 26 Madras.\n\n A few staircases leading to the first floor of the building were effectively covered with the automatic weapons by the terrorists.\n\n Lt Ram Prakash Roperia decided to climb on to the first floor of the building with the help of ladders. His progress was hampered due to effective Machine gun fires. Three attempts to reach the first floor failed and further move appeared difficult.\n\n Lt Ram Prakash Roperia asked for volunteers to accompany him.\n\n In utter disregard to personal safety he along with Nb Sub KG Koshy personally led the fourth attempt and succeeded in climbing the first floor of the building.\n\nThis personal example of indomitable courage inspired his men and enabled his company to reach its allotted objective.\n\n Thereafter Lt Ram Prakash Roperia along with Nb Sub KG Koshy started clearing the bunkers under heavy machine gun fire.\n\n He personally led his company and as he cleared the complete first floor of the staircase, he was fired upon by the terrorists. Lt Ram Prakash Roperia lobbed two hand grenades and entered the staircase.\n\n One of the terrorists though injured fired at Lt Roperia injuring him seriously in the shoulder and neck.\n\n In spite of this fact he fired at the terrorist and killed him. Unmindful of his injury and in complete disregard for his personal safety he climbed down the staircase and established line with 'D' Company.\n\n After reaching the ground floor he collapsed due to sheer exhaustion and excessive bleeding.\n\nHe was evacuated to Hospital where he succumbed to injuries.In this action Lt Ram Prakash Roperia displayed most conspicuous bravery, indomitable courage, exemplary personal valour, outstanding leadership and devotion to duty of exceptionally high order and laid down his life in the highest traditions of the Army."
    }, {
      "id": "1021",
      "name": "Captain Jasbir Singh Raina",
      "title": "1985",
      "operation": "Operation Bluestar",
      "url": "http://www.indianarmy.gov.in/writereaddata/PhotoGallery/The%20Ashok%20Chakra/4553/Small/4553.jpg?PhotoCategoryId=200&MenuID=7949&PhotoGallary=p",
      "moredescription": "\n\nReferences: www.rediff.com",
      "description": "",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n    I, [Lieutenant General (retired) Kuldip Singh Brar (Commanded Operation Bluestar)}] began at 4 am in the morning [of June 5], spent half an hour with the first unit; then half an hour with the next unit and so on.\n\n To every one of them, I explained this was not a mission against any religion or a temple, but a mission against some militants who have defiled the temple; it was no longer a place of sanctity but a defiled place and we were going to clean it out.\n\nEven so, I told my men if any one of them wanted to opt out of this operation, they were welcome.\n\n I gave them my word that they would not be hounded nor would their unit commanding officer mark them negatively.\n\nNo one put his hand up to back out, not in the first, not in the second, not in the thirdIn the fourth battalion, one hand went up.\n\n It belonged to a Sikh officer, Second Lieutenant Jasbir Singh Raina, in the unit commanded by [Lieutenant Colonel] Mohammad Israr [Lt Col Israr of the 10 Guards would lead the first unit into the Golden Temple].\n\n I told Raina if he wanted to stay out, he need have no fear in doing so.\n\n Raina replied he had a request:\n\n he wanted to be the first person to enter the Golden Temple to wipe the militants who had defiled his holiest shrine.\n I was very happy and told Israr that Raina must be allowed to lead the first charge.\n\nThe moment Raina entered, he came under a withering fire and suffered serious injuries to his legs. Yet, he refused to pull out.Lt Colonel Israr rang me up saying Raina was refusing to evacuate.\n\n I then ordered Israr to get Raina out and into the waiting ambulance.\n\n Months later, when he received the Ashoka Chakra [the highest bravery award in peace times], he came to receive the award in a wheelchair.\n\n I had tears in my eyes because I remembered this young boy standing up to say he wanted be the first to enter. These are things that not many people know."
    }, {
      "id": "1020",
      "name": "Major Bhukant Misra",
      "title": "1985",
      "operation": "operation",
      "url": "http://indianarmy.nic.in/Site/FormTemplete/..%5C..%5Cwritereaddata%5CImages%5CContent%5C1396%5CBhukant.jpg",
      "moredescription": "\n\nReferences: indianarmy.gov.in",
      "description": "",
      "description1": "Service : Indian Army",
      "description2": "Born: 15 Jun 1941 Agra (UP)\n",
      "description3": "\n    The Complex was very heavily fortified and was converted into impregnable bastion.\n\n Attempts to clear the building during the night suffered very heavy casualties.\n\n At 0440 hours one company led by Major Bhukant Misra advanced behind an Armoured Personnel Carrier, which was soon hit by anti tank gun fire.\n\n At the same time the company came under very heavy fire and suffered eight casualties, including the JCO of the leading platoon. Realising the loss of command and control in the leading platoon, Major Bhukant Misra rushed forward, irrespective of the heavy fire all around and soon established command and control.\n\n Two companies were launched at 0530 hours on the next day. Both the companies advanced at the given time but soon came under very heavy fire. Major Bhukant Misra’s company once again suffered very heavy casualties and the advance of this company stalled.\n\n Major Bhukant Misra at this stage stood in front of the company and asked them to follow him and charged at the base of the Complex.\n\n This daring act by Major Bhukant Misra inspired the company and they rushed behind him and gained a foothold.\n\n A light machine gun firing through a pot hole in the base was interfering in the further advance. Major Bhukant Mishra, without bothering for his safety, now crawled towards the base and destroyed the light machine gun and the crew by lobbing a grenade through the pot hole.\n\n This act was an example of cold courage. Immediately after destroying the light machine gun, Major Bhukant Mishra rushed to the steps leading into the Complex.\n\n As he was about to enter the Complex, he was shot down and killed by a burst of Medium Machine Gun.\n\n Throughout the action late Major Bhukant Misra displayed courage, bravery and a tremendous sense of duty towards the men he commanded and the country he served. The officer laid down his life like a gallant soldier leading his men right in front.\n\n For this supreme sacrifice and the gallantry displayed, Major Bhukant Misra was awarded ASHOK CHAKRA (POSTHUMOUSLY)."
    }, {
      "id": "1019",
      "name": "Sq Ldr Rakesh Sharma",
      "title": "1985",
      "operation": "Soviet rocket Soyuz T-11",
      "url": "http://cdn.publishyourarticles.net/wp-content/uploads/2015/06/90529_sharma_rakesh.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org \n               www.quora.com",
      "description": "Squadron Leader",
      "description1": "Service : Indian Air Force",
      "description2": "Born : 13 January 1949,Punjab\n",
      "description3": "\n    When the offer to send an Indian along with Russian cosmonauts was made to Shrimati Indira Gandhi by her then Soviet counterpart.\n\n India - Soviet Union relationship has always been a strategic one, with high levels of co-operation in the restricted areas of space and defense.\n\n The offer was a fairly political one, considering that it happened during the times of the Cold War between the US and the Soviet Union.\n\n Five IAF pilots were shortlisted based on their merit, health and experience, of which Rakesh Sharma and Ravish Malhotra (the backup cosmonaut) were finally chosen to fly aboard Soyuz capsule in the year 1982.\n\n They were sent to Moscow thereafter, where they learnt Russian and underwent cosmonaut training for one year duration.\n\n In 1984, the crew blasted off from Baikanour cosmodrome in the tiny Soyuz capsule, to later dock with Salyut - 7. Rakesh Sharma was in space for almost 8days, where he conducted experiments related to Earth observation, life sciences and materials processing experiments, including silicium fusing tests.\n\n He also experimented with practicing yoga to deal with the effects of prolonged orbital spaceflight, and this particular effort was highly appreciated by Roscosmos.\n\nHe was conferred with the honour of the Hero of the Soviet Union upon his return from space.\n\n The Republic of India conferred its highest peacetime gallantry award, the Ashoka Chakra on him and the other two Soviet members of his mission, Malyshev and Strekalov."
    }, {
      "id": "1018",
      "name": "Gennadi Strekalov",
      "title": "1984",
      "operation": "Soviet rocket Soyuz T-11",
      "url": "http://www.spacefacts.de/more/cosmonauts/photo/strekalov_gennadi_5.jpg",
      "moredescription": "\n\nReference : www.wikiwand.com",
      "description": "Flight Engineer",
      "description1": "Russian aerospace firm RSC Energia",
      "description2": "Born : October 26, 1940\n",
      "description3": "\n    His first spaceflight was November 27 to December 10 of 1980, as research engineer on Soyuz T-3's mission to the Salyut 6 station.\n\nHis next flight was to be new Salyut-7 space station. He and Vladimir Titov were the backup crew for the Soyuz T-5 mission, the first flight to the new station.\n\n The pair, together with Aleksandr Serebrov, launched in April 1983 on Soyuz T-8.\n\n As the spacecraft separated from the aerodynamic fairing that shielded it during launch, part of its Igla rendezvous radar system was damaged.\n\n The crew attempted a manual docking, using only optical instruments aboard their spacecraft and guided by ground radar, but the approach was unsuccessful and Titov had to brake and dive to avoid a collision.\n\nHaving used up too much of their propellant to attempt another approach, the crew were forced to return to Earth on 22 April.Strekalov and Titov were again scheduled to fly to Salyut-7 on September 26, 1983.\n\n The mission's Soyuz-U launcher developed a serious fuel leak in the minutes before launch, forcing launch control to attempt to fire the launch escape system to pull the spacecraft away from the rocket to safety.\n\n This initially failed, but finally operated only 20 seconds before the rocket exploded, devastating Baikonur's LC1 pad.\n\n Strekalov and Titov's capsule was dragged (at accelerations of more than 10G) to safety and landed 4 kilometres (2.5 mi) from the pad, its occupants bruised but otherwise uninjured.\n\n Strekalov and Titov's narrow escape is the only live use of a launch escape system in the history of human spaceflight.\n\n Titov and Strekalov would subsequently celebrate the anniversary of their dramatic escape, calling it their \"second birthday\".\n\n As it did not launch, the mission is known by its technical article designation Soyuz 7K-ST No.16L; it would have been Soyuz T-10, a codename that was instead used the following year.\n\nStrekalov's next spaceflight was aboard Soyuz T-11, with Yury Malyshev and Indian cosmonaut Rakesh Sharma.\n\n The flight launched from Baikonur's Site 31 on 3 April 1984 and, unlike Strekalov's previous two attempts, successfully docked with Salyut-7.\n\n The crew stayed on Salyut-7 until 11 April, and returned to Earth not in the spacecraft in which they had come, but in the reentry module of Soyuz T-10, which was already docked at the space station.From 1 August to 10 December 1990 he was the flight engineer on Soyuz TM-10's flight to Mir, with Gennadi Manakov and Japanese reporter-cosmonaut Toyohiro Akiyama.\n\n At 130 days, this was his longest spaceflight.\n\nHe was decorated twice as Hero of the Soviet Union and many other awards and honour which also included the Ashoka Chakra Award presented to him by the Indian government."
    }, {
      "id": "1017",
      "name": "Yury Malyshev",
      "title": "1984",
      "operation": "Soviet rocket Soyuz T-11",
      "url": "http://www.spacefacts.de/more/cosmonauts/photo/malyshev_yuri_3.jpg",
      "moredescription": "\n\nReference : en.wikipedia.org",
      "description": "Air Force Group 4",
      "description1": "Soviet Air Force",
      "description2": "Born : 27 August 1941",
      "description3": "\n\nHe was decorated twice as Hero of the Soviet Union and many other awards and honour which also included the Ashoka Chakra Award presented to him by the Indian government."
    }, {
      "id": "1016",
      "name": "Maj Gen Cyrus Addie Pithawalla",
      "title": "1981",
      "operation": "Raid on People's Liberation Army",
      "url": "http://indianarmy.nic.in/writereaddata/images/gocas160414.jpg",
      "moredescription": "\n\nReference : timesofindia.indiatimes.com",
      "description": "17 J&K Rifles",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n    As a Second-Lieutenant leading a company of his 17 J&K Rifles in July 1981, had conducted a daring raid on a hideout of the People's Liberation Army, leading to the capture of the insurgent outfit's chief N Bisheshwar Singh and death of seven militants.\n\n Despite being hit in the right shoulder by bullets, he refused to be evacuated till the entire operation was over.\n\n He was awarded the Ashoka Chakra during the 1982 Republic Day parade."
    },




//    {
//      "id": "1014",
//      "name": "BSF Jawan Gurunam Singh",
//      "title": "title",
//      "operation": "operation",
//      "url": "http://i.ndtvimg.com/i/2016-10/gurnam-singh-pti_650x400_41477167474.jpg",
//      "moredescription": "moredescription",
//      "description": "",
//      "description1": "A",
//      "description2": "A",
//      "description3": "A"
//    },
    {
      "id": "1013",
      "name": "Captain Ummed Singh Mahra",
      "title": "1972",
      "operation": "Insurgents in Nagaland",
      "url": "http://4.bp.blogspot.com/__XBIb4FH_Fs/TTqQW_6rbII/AAAAAAAAAR8/pGFe0Lvxp5A/s1600/Captain-Umed-Singh-Mahra.jpg",
      "moredescription": "\n\nReference : Ashoka Chakra Recipients-By Rashmi Aggarwal",
      "description": "19th Battalion, The Rajputana Rifles ",
      "description1": "Service : Indian Army",
      "description2": "Born : January 21, 1942",
      "description3": "\n    On 5th July 1971, at 5:30 pm, Ummed Singh Mahra along with his 60 men set off on a twelve hour long trek through the steams and tunnels of the hilly region.\n\n On 6th July 1971, at 5:45 am, they were at a distance of about 500 meters from the militant hideout.\n\n Then, he divided his men in to three troops. Two troops were ordered to simultaneously attack the hideout from two sides and the third troop was held back for emergency situations.\n\n When the troop led by Mahra was about 30 meters away from the hideout, the militants opened fire on them.\n\n Captain Mahra commanded his men to start firing and attacked the hideout by shooting from a stain machine gun himself. He shot down the sentry rebels.\n\n But in this deed, he got shot on his abdomen and right hand. His wounds were bleeding but he still held fast and inspired his men to keep going.\n\n Meanwhile, the second troop stormed into the base. This dual attack left the rebels shocked.\n\n They started fleeing from the place leaving behind the dead bodies of their companions, arms and ammunitions. Many of their important documents were left behind.\n\n Captain Ummed Singh Majra was badly injured during this shootout.He somehow managed to come back ,but he couldn't survive and attained martyrdom.\n\nCaptain Ummed Singh Majra was posthumously awarded the \"Ashoka Chakra\" for his unique leadership and bravery."
    }, {
      "id": "1012",
      "name": "Captain Jas Ram Singh",
      "title": "1969",
      "operation": "Rebels at Mizo Hills",
      "url": "not found",
      "moredescription": "\n\nReference : Ashoka Chakra Recipients\n   -By Rashmi Aggarwal",
      "description": "Rajput Regiment",
      "description1": "Service : Indian Army",
      "description2": "Born : 1st March 1935",
      "description3": "\n    On the night of 30th October, 1968, his unit got a message that around 50 armed rebels with Light Machine Guns, Rifles and Stain Guns were moving towards a village of Mizo Hills.\n\n Captain Jasram Singh was on duty in that area at the same time.\n\n He, with his two platoons, immediately started towards that village.\n\n In the morning, around 4:30 am, when they were about to reach the village, rebels started tremendous firing at them. He understood the situation, and started counter attack and captured the enemy’s camp. Captain Jasram Singh showed immense bravery and good leadership skills during that fight.\n\n Because of his courage and bravery, enemies got weak and were forced to run away. They could not take 2 dead bodies of their soldiers and six wounded fellows.\n\n They ran away leaving them behind. They also left a huge amount of ammunition behind. Later, on that day only, 3 more rebels were forced to surrender.\n\n In this entireoperation, Captain Jasram Singh showed  amazing bravery and military skills.\n\nCaptain Jasram Singh was awarded the \"Ashoka Chakra\" for his bravery and courage."
    },
//    {
//      "id": "1011",
//      "name": "Jia Lal Gupta",
//      "title": "title",
//      "operation": "",
//      "url": "not found",
//      "moredescription": "",
//      "description": "",
//      "description1": "",
//      "description2": "",
//      "description3": "A"
//    }, {
//      "id": "1010",
//      "name": "Subedar Major Kharka Bahadur Linibu",
//      "title": "title",
//      "operation": "operation",
//      "url": "http://www.indianarmy.gov.in/writereaddata/PhotoGallery/Ashok%20Chakra/4462/Big/4462.jpg?PhotoCategoryId=197&MenuID=7982&PhotoGallary=p",
//      "moredescription": "\n\nReference : ",
//      "description": "",
//      "description1": "A",
//      "description2": "A",
//      "description3": "A"
//    }, {
//      "id": "1009",
//      "name": "Captain Mani Bahadur Rai",
//      "title": "title",
//      "operation": "operation",
//      "url": "",
//      "moredescription": "\n\nReference : ",
//      "description": "",
//      "description1": "A",
//      "description2": "A",
//      "description3": "A"
//    },
//
//
//    {
//      "id": "1008",
//      "name": "Eric James Tucker",
//      "title": "title",
//      "operation": "operation",
//      "url": "http://www.indianarmy.gov.in/writereaddata/PhotoGallery/Ashok%20Chakra/4460/Big/4460.jpg?PhotoCategoryId=197&MenuID=7982&PhotoGallary=p",
//      "moredescription": "moredescription",
//      "description": "",
//      "description1": "A",
//      "description2": "A",
//      "description3": "A"
//    }, {
//      "id": "1007",
//      "name": "Jem Bajirao Sakpal",
//      "title": "title",
//      "operation": "operation",
//      "url": "",
//      "moredescription": "moredescription",
//      "description": "",
//      "description1": "A",
//      "description2": "A",
//      "description3": "A"
//    },
    {
      "id": "1006",
      "name": "Lt Col J R Chitnis",
      "title": "1957",
      "operation": "operation",
      "url": "http://www.indianarmy.gov.in/writereaddata/PhotoGallery/Ashok%20Chakra/4457/Big/4457.jpg?PhotoCategoryId=197&MenuID=7982&PhotoGallary=p",
      "moredescription": "\n\nReference : From the book-Third and Ninth Gorkhas",
      "description": "Gorkha Riflies",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n    On 14th June 1956,Lieutenant Colonel JR Chitnis and Subedar Major Nain Singh were proceeding from Mokokchung to Zunhebeto with the treasury chest containing the pay of the Battalion.\n\n He had a convoy of eight jeeps with a platoon as escort. Suddenly the middle vehicle of the convoy was fired upon by about 100 hostiles armed with LMGs, sten guns and ritles.\n\n Three of his jeeps got separated. He halted the remaining jeeps, quickly marshalled the party and arranged for covering fire.\n\n Grabbing his sten gun and accompanied by the rest of his party, he charged the hostile position.The party halted 150 yards from the hostile’s bunkers and although he was already wounded in the leg, he was already wounded in the leg, he led a bayonet assault on the hostiles, personally killing one hostile and wounding another.\n\n At this stage an LMG located at a flank opened up on his party.\n\n Lieutenant Colonel Chitnis again led a bayonet charge against his LMG post and was Grievously wounded in the stomach and fell some 15 yards from the bunker,he continued to urge his men forward and the position was ultimately cleared of the hostiles who suffered heavy casualties including 20 dead.\n\nLieutenant Colonel Chitnis though mortally wounded continued to lead his men till his last breath and set an example of conspicuous bravery and leadership.\n\nLieutenant Colonel JR Chitnis was awarded the Ashoka Chakra Class 1 posthumously."
    }, {
      "id": "1005",
      "name": "Second Lt. P M Raman",
      "title": "1957",
      "operation": "title",
      "url": "http://www.indianarmy.gov.in/writereaddata/PhotoGallery/Ashok%20Chakra/4458/Big/4458.jpg?PhotoCategoryId=197&MenuID=7982&PhotoGallary=p",
      "moredescription": "\n\nReference : @Indianarmy.adgpi",
      "description": "",
      "description1": "Service : Indian Army",
      "description2": "\n",
      "description3": "\n    3 June 1956,'A' Company of Sikh LI battalion was ordered to attack and clear a hostile militant stronghold in a village of Kohima strict in Nagaland.\n\nSecond Lieutenant P M Raman was commanding one of the Platoons of this Company.As the Company.As the Company reached Chephema village,early morning,it encountered intense hostile firing.\n\nSeizing an opportunity ,he rushed towards the hut and in the first burst of his Sten gun killed two militants.\n\nHe kept on advancing towards the hut and with another burst eliminated another hostile.\n\nIn the process he was injured himself.His relentless and determined pursuit however demoralised the hostiles,who took to their heels.\n\n Inspite of profusely bleeding ,he continued to press on and killed one more militant.\n\nSecond Lieutenant Raman's gallant action stands out as a shining example of courage, leadership and selfless devotion to duty in the best traditions of the Indian Army.\n\nHe was awarded the Ashoka Chakra posthumously. "
    },

//    {
//      "id": "1004",
//      "name": "Hon Lt. Joginder Singh",
//      "title": "title",
//      "operation": "operation",
//      "url": "",
//      "moredescription": "moredescription",
//      "description": "",
//      "description1": "A",
//      "description2": "A",
//      "description3": "A"
//    },

    {
      "id": "1003",
      "name": "Flt Lt. Suhas Biswas",
      "title": "1952",
      "operation": "operation",
      "url": "http://www.bharat-rakshak.com/IAF/images/awards/AC01-Biswas.jpg",
      "moredescription": "\n\nReference : www.bharat-rakshak.com",
      "description": "Flight Lieutnant,2883 GD(P)",
      "description1": "Service : Indian Airforce",
      "description2": "\n",
      "description3": "\n    On the 3rd of February, 1952, The U.P. Area command of the Indian Army was holding a tactical Exercise in Lucknow.\n\n To Witness this Exercise, High ranking Army Officials decided to fly down to the Exercise to observe.\n\n The Then GOC-in-C Western Command Lt General S.M Shrinagesh (Later COAS) , The Quarter Master General Major-Gen K.S.Thimayya (later COAS), The Chief of General Staff Major General S.P.P. Thorat (later GOC-inC East), The Military Secretary Major General Sarda Nand, Maj Gen Mohinder Singh Chopra and Brig Ajaib Singh boarded the IAF HQ and Communications Flight De Havilland Devon (HW 516) which was being flown by Flight Lt Suhas Biswas.\n\n The Devon reached Lucknow and after the exercises were completed, the Officers returned for the return flight to Delhi.\n\n The Devon took off at 1800 Hrs and moments after the aircraft took off, the Crew observed the port engine was spewing smoke and soon a fire broke out.\n\n The Devon became difficult to control and as the fire kept creeping towards the main fuselage, Biswas, the pilot put the Devon in a dive in an attempt to reduce altitude and attempt a crash landing before the aircraft fuel reserves caught fire and blew up.\n\n As the Devon was put into the dive, The Aircraft shuddered in the airflow and The Engine mounting broke away, resulting in the Burning Engine seperating from the wing and falling off.\n\n Biswas levelled the Aircraft and belly landed successfully at a village near the Sandilla Railway Station.\n\n All the occupants walked out of the crashed aircraft unhurt with the pilot being the last to leave.Flt Lt Suhas Biswas awarded the First Ashoka Chakra to the Indian Air Force for the presence of mind, Skill and cool courage in maintaining the Stricken aircraft and saving the lives of many Senior Army Officers."
    }
//  ,
//    {
//      "id": "1002",
//      "name": "Havildar Bachittar Singh",
//      "title": "1900",
//      "operation": "operation",
//      "url": "",
//      "moredescription": "moredescription",
//      "description": "",
//      "description1": "A",
//      "description2": "A",
//      "description3": "A"
//    }, {
//      "id": "1001",
//      "name": "Naik Nar Bahadur Thapa",
//      "title": "",
//      "operation": "",
//      "url": "",
//      "moredescription": "moredescription",
//      "description": "",
//      "description1": "",
//      "description2": "",
//      "description3": ""
//    }

  ]
}