{
  "heros": [
    {
      "id": "1001",
      "name": "Havildar	Chuni Lal",
      "title": "2000",
      "operation": "Operation Vijay-Kargil",
      "url": "http://i2.wp.com/standforindia.com/wp-content/uploads/2016/06/Naib_Subedar_Chuni_Lal.jpg?fit=220%2C283",
      "moredescription": "\n\nReferences: en.wikipedia.org",
      "description": "Unit: 8 JAK LI",
      "description1":"Service : Indian Army",
      "description2":"Born: 6 March 1968\n",
      "description3":"\n     Havildar Chuni Lal was part of a special mission operation at the Line of Control in Doda- Poonch Sector in Jammu and Kashmir.\n\n On 24 August 2000, he successfully thwarted enemy's attack to capture own forward post. On the night 23rd/24th August 2000, the enemy started shelling and firing heavily at own post.\n\n Despite heavy shelling, Havildar Chuni Lal displayed undaunted bravery by moving from bunker-to bunker in his section and motivating his troops who brought down effective medium machine gun fire on the enemy's attacking column.\n\n Subsequently, he inspired his men by personal example to fight a close quarter battle in open trenches.\n\nObserving that two enemy soldiers have jumped inside own communication trench, he picked up a light machine gun and rushed I at them disregarding own safety and shot them dead.\n\n Taken by surprise at the ferocity of the pro-active stance of own troops, the enemy quickly retreated leaving behind several weapons at our post.\n\n Twelve enemy soldiers were killed in the action. Havildar Chuni Lal displayed conspicuous courage and relentless offensive action in the face of the enemy."
    },
    {
      "id": "1002",
      "name": "Colonel	Lalit Rai",
      "title": "1999",
      "operation": "Operation Vijay-Kargil",
      "url": "http://www.simplylifeindia.com/uploads/8/1/1/5/8115412/8604072.jpg?296",
      "moredescription": "\n\nReferences: en.wikipedia.org",
      "description": "11 Gorkha Rifles",
      "description1":"Service: Indian Army ",
      "description2":"Born : 24 January 1956\n",
      "description3":"\n     The first unit deployed during Operation Vijay was 1/11 GR (1st battalion, 11 Gorkha Rifles), who were specialists in high-altitude warfare. Colonel Rai was the battalion's CO. One of his platoons was led by Captain Manoj Pandey (later PVC).\n\nDuring the advance, Indian troops were pinned down by effective and heavy volume of enemy fire. Realising the danger of getting day lighted in this vulnerable position, Colonel Rai ordered 5 Platoon to clear the interfering enemy positions while he himself led a handful of troops, available in front, to reach the top.\n\n The enemy, sensing the danger, counter-attacked these troops from three sides with 30-40 personnel. During this counterattack, Colonel Rai was injured in the knee.\n\n Despite his injury, he exhorted and encouraged his troops to fight courageously by setting a very high standard of bravery. He refused to be evacuated till such time the objective was captured.\n\n This act boosted the morale of his troops who regrouped and captured the objective in one charge. This capture turned out to be the turning point in the battle of the Batalik sub-sector.\n\n This operation accounted for killing of 25 enemy soldiers and capture of large amount of arms and ammunition including a Stinger missile, air defence guns and important documents.\n\nFor his inspirational leadership and conspicuous bravery of a very high order, he was awarded the Vir Chakra on 15 August 1999, by the President of India"
    },
    {
      "id": "1003",
      "name": "Major Mariappan Saravanan",
      "title": "1999",
      "operation": "Operation Vijay-Kargil",
      "url": "https://upload.wikimedia.org/wikipedia/en/thumb/a/ac/Defaul1.jpg/200px-Defaul1.jpg",
      "moredescription": "\n\nReferences: Major Mariappan Saravanan VC Citation",
      "description": "Bihar Regiment",
      "description1":"Service: Indian Army ",
      "description2":"Born : August 10, 1972\n",
      "description3":"\n     Major M Saravanan was the Company Commander of one of the companies of 1 Bihar launched in the battalion attack on Point 4268 In the Batalik sector during \"Operation Vijay\" While moving forward to eliminate the last position held by the enemy, Major Saravanan was fired upon by the enemy with a heavy volume of small arms fire.\n\n Unmindful of the enemyfire, he crawled forward to destroy the last remaining enemy position and before being fatally hit by an enemy bullet, killed two enemy soldiers.\n\nMajor M Saravanan displayed exceptional bravery, valour and exemplary leadership, fighting from front, destroying two enemy sagars and killing few enemy soldiers before laying his life for the motherland and in the process eliminating an important enemy position."
    },
    {
      "id": "1004",
      "name": "Capt	Jintu Gogoi",
      "title": "1999",
      "operation": "Operation Vijay-Kargil",
      "url": "http://3.bp.blogspot.com/-Wg_F6zJesV4/UmUnrozPocI/AAAAAAAAAHg/gEIBDKVdu_c/s1600/19reggogoi.jpg",
      "moredescription": "\n\nReferences: standforindia.com ",
      "description": "17 Garhwal ",
      "description1":"Service: Indian Army ",
      "description2":"\n",
      "description3":"\n     On the night of 29/30 June 1999 during “Operation Vijay”, Captain Jintu Gogoi wad tasked to evict the enemy from ridge line Kala Pathar near the Line of control in general area of Juber Hill complex in Batalik sub-sector.\n\nWith utter disregard to his personal safety, he led the troops in the face of heavy enemy fire and reached the top by first light.\n\n However, he was immediately surrounded by the enemy and was asked to surrender. As he had no chance to protect himself, he chose the honorable way of fighting with valour and dignity.\n\n He opened fire on the enemy killing two enemy soldiers before making the supreme sacrifice. Before this action, lie made sure that his group had taken cover for safety.\n\nCaptain Jintu Gogoi displayed most conspicuous act of bravery, unparalleled devotion to duty and leadership of most exceptional order in the face of the enemy in the most inhospitable terrain, and made the supreme sacrifice in the highest tradition of the Indian Army."    },
    {
      "id": "1005",
      "name": "Capt	R Jery Prem Raj",
      "title": "1999",
      "operation": "Operation Vijay-Kargil",
      "url": "http://orkut.google.com/imgs/91875139.jpg",
      "moredescription": "\n\nReferences: Captain R Jery Prem Raj VC Citation ",
      "description": "158 Med Medium Regiment (SP)",
      "description1":"Service: Indian Army ",
      "description2":"\n",
      "description3":"\n     On the night of 6th/7th July 1999 during \"Operation Vijay\", Captain R. Jery Prem Raj was the Forward Observation Post Officer with 2 Naga tasked to launch an assault on Twin Bumps in area Gun Hill in Drass sub-sector.\n\n During the assault, Captain R. Jery Prem Raj searched, sought and identified enemy positions and directed accurate artillery fire onto them with devastating effect.\n\nIn this endeavor, he was shot by enemy sniper fire. Undeterred, he continued to bring down effective fire on enemy positions. However he was again hit by a volley of enemy machine gun fire.\n\n Though severely wounded, he continued to direct accurate fire onto the enemy until he succumbed to his injuries.\n\n By then he had inflicted heavy casualties on the enemy that not only assisted in the capture of the objectives but also helped in minimizing casualties to own infantry.\n\nCaptain R. Jery Prem Raj displayed bravery of a very high order and tremendous professional acumen with total disregard to his safety and made the supreme sacrifice."    },
    {
      "id": "1006",
      "name": "Squadron Leader	Ajay Ahuja",
      "title": "1999",
      "operation": "Operation Safed Sagar-Kargil",
      "url": "http://www.kotacity.com/images/stories/ShriAjayAhuja.jpg",
      "moredescription": "\n\nReferences: www.revolvy.com ",
      "description": "Golden Arrows – Squadron No. 17",
      "description1":"Service: Indian Airforce",
      "description2":"Born: 22 May 1963\n",
      "description3":"\n     On 27 May 1999, as part of Operation Safed Sagar in Kargil, a photo reconnaissance mission was launched over the Indian side of the line of control in Kashmir. A member of the mission, Flt Lt Nachiketa ejected from his MiG-27L after an engine flame out.\n\nSquadron Leader Ahuja stayed over enemy positions to help the rescue attempts knowing full well the existence of enemy surface-to-air missiles in the area. However, his MiG-21MF fighter, C-1539,was hit by a shoulder-fired FIM-92 Stinger. Ahuja gave a radio call – \"Hercules, something has hit my plane, possibility of missile hit cannot be ruled out, I am ejecting over...(location).\". IAF authorities lost track of his aircraft and all communication shortly afterward.\n\nAccording to the data released by the Indian Air Force, Ahuja's aircraft had been within the Indian side of the Line of Control, a ceasefire line and pseudo-border agreed upon by India and Pakistan in the early 1970s to maintain status quo in Kashmir. A post-mortem examination conducted at the Srinagar Base Hospital claimed that Ahuja had landed safely after ejecting from his plane, but had been killed later by Pakistani soldiers.\n\nThe post-mortem report of Squadron Leader Ajay Ahuja spoke of three grievous wounds:\n\n1.	There is a penetrating gunshot wound; entry near right ear, exit near the external orifice of left ear.\n2.	Gunshot wound: entry 2 cm medial to right nipple, exit near left iliac crest damaging internal viscera like liver, intestine and peritonium.\n3.	Compound comminuted fracture left knee.\n4.	Suffered multiple punctured wounds over left and right thighs, rupture of right lung, injury to neck vessels, small intestine and left liver.\n\nIt was reported that the left knee fracture was sustained when he parachuted down, but the gunshots show that he landed alive and was shot. And his death was called as a cold blooded murder.\n\nOn 15 June 1999 The Deputy high commissioner of the Pakistani Embassy in New Delhi was summoned and a notice for the breach of Geneva conventions was submitted for the torture and killing of the prisoners of War during the Kargil War.\n\n The Government of India lodged a protest with Pakistan's ambassador, accusing the Pakistani paramilitary forces of having fired at Ajay while still descending in his parachute. Pakistani authorities denied the accusations and suggested Ahuja was killed due to accidental injuries during the ejection or landing. No further investigations were carried out by either government nor impartial, outside entities and the case remains unresolved.\n\nOn 29 May 1999, Ahuja's body was flown to the local Air Force station from Srinagar by an Indian Air Force plane. Angry public demonstrations broke out there, at his cremation, and near the Pakistani embassy in Delhi.\n\nAhuja remains a great hero for Indians, and his widow and family are often honoured guests at patriotic public events and official ceremonies. The family received much support from Government authorities and Indian political leaders, as well as emotional and financial support from people across India.\n\n A statue of Ahuja was installed at the nearby crossing on the Bhatinda-Muktsar road. On 15 August 1999, India's 52nd anniversary of Independence, Squadron Leader Ajay Ahuja was posthumously awarded the Vir Chakra, one of India's highest gallantry honours for military personnel."
    },
    {
      "id": "1007",
      "name": "Squadron Leader	M A Ganapathy",
      "title": "1971",
      "operation": "Boyra Encounter (1971)",
      "url": "http://www.bharat-rakshak.com/IAF/images/officers/09464.jpg",
      "moredescription": "\n\nReferences: www.bharat-rakshak.com",
      "description": "22 Squadron unit",
      "description1":"Service: Indian Airforce",
      "description2":"\n",
      "description3":"\n     On 22nd November, 1971, at about 1450 hours order was given to intercept four Pakistani aircraft which had intruded into our territory.\n\n Flight Lieutenant Mandepanda Appachu Ganapathy who was detailed to fly as No. 3 in a formation of 4 Gnat aircraft proceeded to intercept the enemy.\n\n On sighting the enemy aircraft, he skillfully maneuvered his section and got behind one Sabre Jet and shot it down.\n\nIn this action, Flight Lieutenant Mandepanda Appachu Ganapathy displayed gallantry, professional skill and devotion to duty of a high order."
    },
    {
      "id": "1008",
      "name": "Vice Admiral	Arun Prakash",
      "title": "1971",
      "operation": "Operation Cactus Lily",
      "url": "http://tedxbitsgoa.com/wp-content/uploads/2015/11/098.jpg",
      "moredescription": "\n\nReferences: www.bharat-rakshak.com",
      "description": "",
      "description1":"Service: Indian Navy",
      "description2":"Born: October 1944 \n",
      "description3":"\n     As a young officer, Admiral Prakash served afloat on the aircraft carrier INS Vikrant, the ASW frigate INS Kirpan and the light cruiser INS Delhi. In subsequent years, he was privileged to command a variety of seagoing units which included the missile boat INS Chatak, the training frigate INS Beas and the ASW frigate INS Vindhyagiri, and the aircraft carrier INS Viraat.\n\n He commanded the Eastern Fleet from 1995 to 1997. On promotion to Rear Admiral in 1993, he served as ACNS (Air) and as the Assistant Chief of Personnel.\n\n In the rank of Vice Admiral, he has been the Commandant of the National Defence Academy (from 1997 to 1999) and Chief of Personnel at Naval HQ (from 1999 to 2001).\n\n In October 2001, he was appointed the first Commander-in-Chief of the newly created Andaman & Nicobar Command and served in that capacity till taking over as Flag Officer Commanding-in-Chief of the prestigious Western Naval Command - the sword arm of the Indian Navy - on 31 December 2002.\n\n He took over as the Vice Chief of Naval Staff at Naval HQ on 17 October 2003 and held that post till he became the Chief on Naval Staff on 31 July 2004. He was appointed as the Chairman Chiefs of Staff Committee (COSC) on 28 January 2005.\n\nAdmiral Prakash graduated from the IAF's Test Pilots School in 1976, from the Defence Services Staff College (DSSC) in 1979 and from the US Naval War College in 1990.\n\n As a young Lieutenant, during the 1971 war, he served with an IAF fighter-bomber unit (No.20 Lightnings Squadron) flying Hawker Hunters, and was awarded the Vir Chakra for gallantry in air action over West Pakistan and Jammu & Kashmir."    },
    {
      "id": "1009",
      "name": "Air Commodore Jasjit Singh",
      "title": "1971",
      "operation": "Operation Cactus Lily",
      "url": "http://www.indiastrategic.in/image/Air_Cmde_Jasjit_Singh.jpg",
      "moredescription": "\n\nReferences: www.bharat-rakshak.com",
      "description": "3 Squadron",
      "description1":"Service: Indian Airforce",
      "description2":"Born: 8th July 1934\n",
      "description3":"\n     During the operations against Pakistan in 1971, Squadron Leader Jasjit Singh flew a number of operational missions over heavily defended enemy areas.\n\n In spite of heavy ground opposition he pressed home his attacks and destroyed a number of enemy tanks, gun positions and bunkers. He also supervised the servicing of aircraft and thus ensured maximum serviceability of aircraft for operations.\n\n Throughout, Squadron Leader Jasjit Singh displayed gallantry, professional skill and devotion to duty of a high order."
    },
//    {
//      "id": "1010",
//      "name": "Lt Colonel Satish Nambiar",
//      "title": "1971",
//      "operation": "Operation Cactus Lily",
//      "url": "http://uploads.edubilla.com/awards-winners/b1/71/satish-nambiar.jpeg",
//      "moredescription": "\n\nReferences: ",
//      "description": "",
//      "description1":"A",
//      "description2":"A",
//      "description3":"A"
//    },
//    {
//      "id": "1011",
//      "name": "Lt Colonel Raj Singh",
//      "title": "1971",
//      "operation": "Operation Cactus Lily",
//      "url": "",
//      "moredescription": "\n\nReferences: ",
//      "description": "",
//      "description1":"A",
//      "description2":"A",
//      "description3":"A"
//    },
    {
      "id": "1012",
      "name": "Admiral	Laxminarayan Ramdass",
      "title": "1971",
      "operation": "Operation Cactus Lily",
      "url": "http://images.indianexpress.com/2015/10/admiral-ramdas-759.jpg",
      "moredescription": "\n\nReferences: www.bharat-rakshak.com",
      "description": "",
      "description1":"Service: Indian Navy",
      "description2":"Born: 30 Nov 1990\n",
      "description3":"\n     A Communication Specialist, Admiral Ramdas underwent Royal Naval Staff College at England and as a Commander he established and commanded the Naval Academy at Cochin where he distinguished himself for which he was awarded Vishisht Seva Medal (VSM).\n\n During the 1971 Indo-Pak Operations, whilst in command of INS Beas, Admiral Ramdas took part in the most effective naval blockade of East Pakistan (Bangladesh) which frustrated Pakistan's attempt to evacuate 91,000 of their troops who eventually surrendered to the Indian Forces.\n\nINS Beas also captured a large number of ships carrying contraband to East Pakistan, bombarded Cox Bazar and took part in the landing and other operations in an area infested with mines and submarines.\n\n For his resolute, bold, gallant and imaginative action in the face of great danger, he was decorated with the Vir Chakra. He later commanded a Patrol Vessel Squadron in the Indian Navy."
    },
    {
      "id": "10013",
      "name": "Air Marshall Denzil Keelor",
      "title": "1965",
      "operation": "Operation Riddle",
      "url": "https://quintype-01.imgix.net/thequint%2F2015-12%2F007693f4-58f9-4898-a864-18764bb1cc5b%2FScreen%20Shot%202015-12-06%20at%207.41.26%20pm.png?auto=format&q=60&w=976&fm=pjpg",
      "moredescription": "\n\nReferences: Vir Chakra Citation of Air Marshall Denzil Keelor  ",
      "description": "Commands held: 4 Squadron",
      "description1":"Service: Indian Air Force",
      "description2":"Born: 7 December 1933\n",
      "description3":"\n     On 19th September 1965, Squadron Leader Denzil Keelor was providing fighter escort to Mystere aircraft during a strike mission in the operations against Pakistan.\n\n His section of four Gnat aircraft was engaged by four enemy Sabre jet aircraft and the battle was fought at a height of less than 2,000 feet from the ground where enemy anti-aircraft guns were also active.\n\n Under his guidance, his subsection leader shot down a Sabre jet aircraft. Thereafter Sqn Ldr Keelor himself engaged another Sabre jet and crippled it.\n\n Throughout the operations, Sqn Ldr Keelor was a source of inspiration to his pilots and ground personnel. His courage and devotion to duty were in the best traditions of the Air Force. For this he was awarded the Vir Chakra.\n\n The Sabre kill by Denzil earned the Keelor family a unique distinction. Both the brothers now had Sabres to their credit and both earned the Veer Chakra, making it the first time brothers had won the Veer Chakra for identical feats."
    },
//    {
//      "id": "10014",
//      "name": "Lt Gen Mohammad Ahmad Zaki",
//      "title": "1965",
//      "operation": "Operation Riddle",
//      "url": "http://www.cs.rpi.edu/~zaki/Personal/martial/profile_19991028_files/og-0.jpg",
//      "moredescription": "\n\nReferences: ",
//      "description": "19 Maratha Light Infantry",
//      "description1":"Service: Indian Army",
//      "description2":"Born: 20 January 1935\n",
//      "description3":"A"    },
    {
      "id": "1015",
      "name": "Air Cmde	Alfred Tyrone Cooke",
      "title": "1965",
      "operation": "Operation Riddle",
      "url": "https://marutfans.files.wordpress.com/2015/09/cot2sjluaaesaav.jpg",
      "moredescription": "\n\nReferences: jaganpvs.tripod.com",
      "description": "No.14 Squadron flying Hunters",
      "description1":"Service: Indian Air Force",
      "description2":"\n",
      "description3":"\n     A T Cooke's achievement is yet to gain acceptance in official Indian Air Force Circles as his feat came to light only in the recent years.  Cooke was serving in the Eastern Sector during the 65 War with No.14 Sqn flying Hunters.\n\n Based at Kalaikunda, Cooke was flying a CAP along with Fg Off S C Mamgain, when ground Control directed them to intercept an incoming PAF Raid of Four Sabres.\n\nRight from the moment the aircombat began, Cooke does not remember specific details, only that he had fired at numerous PAF Sabres. It was only after the examination of his Gun Camera Film that his Kills have been documented.\n\nCooke hit and destroyed atleast One attacking Sabre, which was being flown by Fg Off Afzal Khan, who was killed  in the crash.\n\n Subsequently his gun camera film shows him repeatedly hitting another Sabre that had a drop tank hang-up under one of its wings.\n\n This particular aircraft was flown by Flt Lt Tariq Habib Khan, who managed to fly back to base. Pakistani Sources mention that this particular aircraft was written off due to the damage it suffered.\n\nCooke also fired at a third aircraft, before exhausting his ammunition. The IAF credited Cooke with one Sabre Destroyed and it remains the official score to this day."
    },
    {
      "id": "1016",
      "name": "Wing Commander Trevor Keelor",
      "title": "1965",
      "operation": "Operation Riddle",
      "url": "https://tkstales.files.wordpress.com/2010/03/panthers1964-tushar-sen.jpg",
      "moredescription": "\n\nReferences: Vir Chakra Citation of Wing Commander Trevor Keelor ",
      "description": "",
      "description1":"Service: Indian Air Force",
      "description2":"Born: 8 December 1934\n",
      "description3":"\n     On 3rd September 1965, on receipt of a report that a formation of Pakistani fighters were circling over our Army position in the Chhamb Sector of J&K, a formation of Gnat aircraft was ordered to intercept the intruders.\n\n Approaching the area, Sq Ldr Trevor Keelor, who was a section leader in the Gnat formation, sighted enemy F-86 Sabre jets and engaged them in air battle. When the combat was in progress, F-104 Starfighters of the Pakistani Air Force also joined in.\n\n Unmindful of the numerical superiority of the enemy, Sq Ldr Keelor chased a Sabre jet and pressed home his attack until the enemy aircraft caught fire and disintegrated in the air. This was the first victory of our Air Force in the air battles against the Pakistani Air Force.\n\n In this operation, Sqn Ldr Keelor displayed courage and leadership of a high order in the best traditions of the Air Force."
    },
    {
      "id": "1017",
      "name": "Lt General Zorawar Chand Bakshi",
      "title": "1965",
      "operation": "Operation Ablaze",
      "url": "https://media.gqindia.com/wp-content/uploads/2014/10/gq-zoru-top-866x487.jpg",
      "moredescription": "\n\nReferences: ",
      "description": "5 Gorkha Rifles (Frontier Force)",
      "description1":"Service: Indian Army, British Indian Army",
      "description2":"Born: October 21, 1921",
      "description3":"\n     In 1965, Zoru was promoted to the rank of Brigadier, and posted as Commander 68 Infantry Brigade in Kashmir. The war clouds had gathered once again. Pakistani infiltration began just a few days after Zoru assumed command.\n\n  While infiltration was being effectively addressed, it was felt that to prevent further ingress,  by guerrillas and to block routes being used by them, some key tactical features had to be captured. The Hajipir Pass was one of them.\n\nThe Hajipir Pass was strategically very important as it provided one of the main routes of ingress into the Kashmir Valley. Zoru was assigned the mission to capture the Pass.\n\n In fact, so strong was the faith of the senior command in Zoru’s capability, that the whole operation was codenamed ‘Operation Bakshi’\n\nIn one of the most brilliantly executed operations in the 1965 conflict, Zoru captured the Hajipir Pass and wrote his name in the Indian Military history.\n\nThe credit for the capture went to Major Ranjit Dayal, who actually captured the feature, and to Zoru for planning and executing a bold plan, fraught with risk.\n\n There is no doubt that if this plan had failed, Zoru would have been solely held responsible, as he had not taken permission from his senior command to execute it.\n\n  For his role as a commander in executing this mission, Brigadier Zoru Bakshi was awarded the Maha Vir Chakra, India’s second highest medal for gallantry.\n\n With a Vir Chakra already under his belt, Zoru became  the only Indian Army officer to have been awarded both medals."    },
    {
      "id": "1018",
      "name": "Wing Cdr Krishan Kant Saini",
      "title": "1962",
      "operation": "Operation",
      "url": "Operation Leg Horn",
      "moredescription": "\n\nReferences: Vir Chakra Citation of Wing Commander (Retd.) Saini ",
      "description": "Unit: 104 Squadron",
      "description1":"Service: Indian Airforce",
      "description2":"Born: 26 Oct 1931\n",
      "description3":"\n     Flight Lieutenant Krishan Kant Saini had been operating in NEFA area since October, 1960. On 18th November, 1962, he, along with his co-pilot was evacuating seriously injured battle casualties in Walong area.\n\n He was instructed to land at a helipad close to the enemy line which was reported to be clear of enemy troops. When he was over the helipad, Chinese troops opened fire from many directions.\n\n His helicopter was hit at several places; the main reducter was damaged and oil from it gushed out in a thick spray which blinded him temporarily. His right ankle was also injured by a splinter and he was bleeding profusely.\n\n With great determination, presence of mind and skill, he dived the helicopter almost to ground level to avoid further damage from enemy fire. He thus saved the helicopter and the lives of his co-pilot and passengers.\n\n In spite of the damaged hydraulic system and the personal injury, he skilfully brought the aircraft back to base.\n\nFlight Lieutenant Saini displayed courage, determination and professional skill of a high order."
    },
    {
      "id": "1019",
      "name": "Captain Harbaksh Singh",
      "title": "1948",
      "operation": "Operation Polo",
      "url": "https://sikhchic.com/cms/articles/photo1/harbaksh-b.jpg",
      "moredescription": "\n\nReferences:en.wikipedia.org",
      "description": "Unit: 5 Sikh",
      "description1":"Service: Indian Army",
      "description2":"Born: 1 October 1913\n",
      "description3":"\n     Kuantan on 5 January 1942, the then Capt. Harbaksh Singh drove into a Japanese ambush and was seriously injured. He was taken Prisoner of war as Singapore fell to the Japanese. He was repatriated only in September 1945 after cessation of hostilities.\n\nHe recuperated in Ambala, and was soon posted as second-in-command of 4th battalion, Sikh Regiment at Campbelpur. In 1947, he completed the Long Staff Course at Command and Staff College, Quetta and was posted as GSO-1 (operations and training), Eastern Command.\n\nWhen Lt Col Dewan Ranjit Rai, CO of 1st battalion, Sikh Regiment was killed during the Kashmir operations in 1948, he volunteered to command the battalion. However he was posted as Deputy commander at the headquarters of 161 Infantry Brigade.\n\nHe conducted the main battle against the raiders at Shelatang Bridge on 7 November 1947. This decisive battle, involving 1st battalion Sikh and 4th battalion Kumaon regiments, proved to be a turning point in the war.\n\nOn 12 December 1947, on hearing about the heavy casualties suffered by 1st battalion Sikh, he proceeded to Uri and took over the command of the battalion voluntarily, dropping a star from his rank. He brought back the battalion to Srinagar and began to rehabilitate it.\n\nHowever, even before the rehabilitation was complete, the battalion was called out to fight the enemy who had crossed the snow-clad Pharikian ki Gali and had occupied Handwara.\n\nHe led the truncated battalion, in a daring operations in which, after a series of battles, the battalion drove out the enemy from the valley.\n\nIn 1948, he was promoted to the rank of Brigadier and took over the command of 163 Infantry Brigade and began to advance to Tithawal. The movement forward started on 12 May 1948, and after six days, Tithawal was captured. Brigadier Harbaksh Singh was awarded a Vir Chakra for his bravery.\n\nAfter the Kashmir operations, he went on to serve as the Deputy commandant of the Indian Military Academy at the western command headquarters, director of infantry at the Army headquarters, and in 1957 attended a course at the Imperial Defence College (now Royal College of Defence Studies), UK.\n\n In January 1959, he became the first foreign officer to go on attachment with German Army's first division to be raised after their disbandment at the end of World War II."
    }

  ]
}