{
  "heros": [{
    "id": "1001",
    "name": "Captain Gurjinder Singh Suri",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "http://tuskerfootprints.in/ShowImage.ashx?AwardDetailID=%2013",
    "moredescription": "\n\nReference: oneindiaonepeople.com ",
    "description": "Ordinance Corp (12 Bihar)",
    "description1": "Service: Indian Army",
    "description2": "Born on 4 July 1974\n",
    "description3": "\n    After the defeat in Kargil conflict, the Pakistan Army had started using mercenaries to launch suicide attacks and had intensified artillery attacks in the 60 km stretch from Yusmarg to Tangdhar. The militants and soldiers would try to infiltrate under cover of artillery fire.\n\n Faulad post at a height of 11200 feet provided a commanding position in the Gulmarg Sector. Pakistan Army’s plan was not merely to capture Indian Army post, but to also carve a passage for infiltration into Gulmarg region, which would allow them to reach Pattan and Baramula.\n\nThe Pakistan Army launched an attack on the Faulad post on 9 November 1999. The attack was preceded by a heavy artillery bombardment.\n\n One of the shells fell close to the ropeway station but no major damage occurred. It was perhaps not a deliberate attack on the ropeway system. The Pakistan attack was repulsed. Gurjinder deployed his men to deal with any reinforcements or interference by the enemy.\n\n He started to clear the enemy bunkers one by one. One of his soldiers was hit badly. He dashed forward to kill two enemies with his AK 47 rifle and silence the machine gun.\n\n He received a burst of gunfire in his arm. Unmindful of his injury, he continued to lead his men and lobbed two hand-grenades into a bunker.\n\n He then entered the bunker spraying bullets, and killed one enemy soldier. At this point, he was hit by an enemy rocket-propelled grenade and was critically wounded.\n\n He declined to be evacuated and continued to exhort his men till he breathed his last. Captain Suri displayed extraordinary leadership, inspired by which his men fell upon the enemy with vengeance and annihilated them.\n\n He displayed extraordinary courage and outstanding leadership in the face of the enemy and made the supreme sacrifice in the highest traditions of the Indian Army.\n\n He was awarded MVC in recognition of the gallantry."
  }, {
    "id": "1002",
    "name": "Subedar Imliakum Ao",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "http://www.thebetterindia.com/wp-content/uploads/2016/08/imliakum-ao.jpg",
    "moredescription": "\n\nReferences: indianarmy.gov.in",
    "description": "Company of NAGA",
    "description1": "Service : Indian Army",
    "description2": "Born -25 July 1976(Nagaland)\n",
    "description3": "\n    It was July 1999 a company of NAGA was tasked to raid enemy mortar position. Sepoy Imli Akum AO formed part of the Assault Group and  was tasked to  stealthily silence the  enemy sentry who  was on  duty on the  outer perimeter of enemy  mortar  position.\n\n Sepoy Imliakum AO  approached  the enemy  sentry during  broad daylight  and killed him.He  kept moving forward and  killed one more sentry and subsequently stormed the mortar position alongwith the Assault Group.\n\n Sepoy Imliakum showed exemplary courage and determination killing two enemy soldiers. His determination, grit, cool confidence and raw courage in the face of enemy was exemplary in the true spirit and traditions of the Indian Army and the Regiment which was a factor in eliminating the enemy from the almost indomitable mortar position.\n\n The raid was a big success wherein three 120 mm and two 81 mm Mortars were captured alongwith a huge stockpile of ammunition.\n\nFor the exemplary courage in the face of enemy, sustained and successful performance in storming the enemy mortar position and killing two enemy soldier, Sepoy Imliakum AO was awarded MAHAVIR CHAKRA."
  }, {
    "id": "1003",
    "name": "Major Vivek Gupta",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "http://1.bp.blogspot.com/-rllOVXdz10A/UmQ0frZhH0I/AAAAAAAAAGM/vp_H1U4MRYE/s1600/Gupta.jpg",
    "moredescription": "\n\nReference:  indiatoday.intoday.in",
    "description": "2nd Rajputanana Rifles",
    "description1": "Service:  Indian Army",
    "description2": "\n",
    "description3": "\n    Like so many company commanders, Gupta was leading a dangerous uphill assault against entrenched intruders. He captured two bunkers before being cut down.\n\nOnly a few days ago Major Vivek Gupta was having the time of his life in Drass. He said as much in a letter of June 8 to his father, Lt-Colonel (retd) B.R.S. Gupta.\n\n \"You should feel proud of me . . . I am contributing something for the nation in this uniform I have worn . . . being a company commander at this time is the greatest experience one can have.\"\n\nIronically, the elder Gupta was to receive the letter in his Dehradun house only at noon on June 17. By then the Army band had played out Dead Body Slow March. And his son's last rites had been completed, just half an hour before.\n\nVivek died on June 12 after capturing two difficult posts the same day on the wind-swept, icy slopes of the Drass sector. He perished on the battlefront when a fusillade of bullets from the Pakistanis tore open his torso, but not before he and his company men had slain seven members in the enemy camp.\n\nDeath came swiftly, said a colleague, who saw Vivek mowed down by that first burst from a bunker and from the hills. Death can be very lonely in Kargil.\n\n The major lay in the snow alongside dead colleagues for two days.\n\n It was only on June 15 that a team could keep the enemy fire at bay and secure his body from the slopes.\n\n It ended, literally, exactly seven years of army life for \"Vicky\" who was commissioned in the 2nd Rajputana Rifles on June 13, 1992."
  },{
    "id": "1004",
    "name": "Major Padmapani Acharya",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "https://unsungwarheroes.files.wordpress.com/2015/04/major-padmapani-acharya.jpg",
    "moredescription": "\n\nReference:  greatindianheroes.com",
    "description": "2nd Rajputanana Rifles",
    "description1": "Service:  Indian Army",
    "description2": "Born:  June 21, 1969\n",
    "description3": "\n    He was instructed to destroy and capture the enemy bunker at the Tololing Top. This was a very strategic position as it overlooked the Srinagar Leh highway.\n\n In a way, the battle of Tololing and the early demolition of this enemy bunker was crucial to the success of the battalion.\n\nMajor Acharya took the reserve platoon and led them through heavy firing. The risks were huge and so were the causalities but achieving his mission was his sole purpose.\n\n  He kept encouraging and motivating his soldiers inspite f heavy odds and mass injuries. He managed to crawl up to the bunker and lobbed grenades at the enemy bunker.\n\n In the process, he suffered severe injuries which made him immobile.\n\nHe ordered his men to march ahead and keep attacking the enemies while he kept firing. The battle of Tololing Top was fierce and night long but in the end, Major Acharya’s team succeeded in recapturing Tololing Top.\n\nMany say that this win was pivotal and turned the course of the kargil war. As for the great Indian hero, he closed his eyes only after the Indian flag was flying high once again on Tololing Top.\n\n  He was posthumously awarded the Maha Vir Chakra award."
  }, {
    "id": "1005",
    "name": "Captain Neikezhakuo Kenguruse",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/92/Captain_Neikezhakuo_Kenguruse.jpg/220px-Captain_Neikezhakuo_Kenguruse.jpg",
    "moredescription": "\n\nReference:  www.indiatimes.com",
    "description": "2nd Rajputana Rifles",
    "description1": "Service:  Indian Army",
    "description2": "Born : July 15, 1974",
    "description3": "\n    When the Kargil War started Captain Kenguruse was a junior commander in the Rajputana Rifles battalion. For his determination and prowess, he was made the lead commander of the Ghatak Platoon of his battalion.\n\n Only the most physically fit and motivated soldiers make it into the dreaded Ghatak platoon that makes up the first wave of Indian Army’s counter forces.\n\nAs the leader of the Ghatak Platoon he was tasked with the capture of the area ‘Black Rock’ in Drass sector during the Kargil War. The commando mission involved attacking the well entrenched enemy position on a cliff face. The position had been interfering with the capture of the main objective of the battalion.\n\nThe Ghatak Platoon, as it was scaling the cliff face, came under intense enemy fire in which Captain Kenguruse was injured in the abdomen. Despite the severe injury and profuse bleeding, the brave Naga carried on with the assault.\n\n Unmindful of his injury, he led the platoon to the top of the cliff and was faced with a sheer rock that separated the platoon from the enemy.\n\nWhile securing the rope for his men to climb the rock face, his feet started slipping. Neglecting the bitter cold and sharp rocks, he kicked off his boots and launched the final assault barefoot. He fired a rocket launcher and charged at the enemy, killing two infiltrators with his rifle and another two with his commando knife in hand-to-hand combat.\n\nA hail of bullets threw him off the cliff and he would later succumb to his injuries, but not before he was able to neutralise the enemy position single-handedly. An act of unmatched gallantry and courage."
  },{
    "id": "1006",
    "name": "Havildar Digendra Kumar",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "http://images.jagran.com/naidunia/Digendra-kumar.jpg",
    "moredescription": "moredescription",
    "description": "Rajputana Rifles regiment",
    "description1": "Service:  Indian Army",
    "description2": "Born: 3 July 1969\n",
    "description3": "\n    On 13 June 1999, on nearing its objective, the Assault Group came under enemy fire leading to casualties in the Assault Group.\n\n Naik Digendra Kumar was hit by a bullet in his left arm. Naik Digendra Kumar kept firing on the enemy with his Light Machine Gun.\n\n His fire facilitated his men’s advancement. Finally his troops physically assaulted the enemy position and cleared it after a hand to hand fight.\n\nThis victory was very important. It meant that the Pakistanis could be beaten. Retaking Tololing was perhaps the turning point of the war.\n\nThe role of Digendra in the Kargil conflict was crucial. In the Kargil war the most important task was to recapture the top of Tololing.\n\n This task was entrusted to the Rajputana Rifles – 2nd Battalion. General Malik called a meeting of the Rajputana Rifles at Gumri to make plans to free the Tololing hill.\n\n Digendra introduced himself as Digendra Kumar, known as cobra, soldier of the 2 Rajputana Rifles and a commando of the Indian Army. He chalked out a plan through which victory was certain.\n\nDigendra indicated that he needed 100 meters of Russian rope that should weigh 6 kg with bearing capacity of 10 tonnes along with Russian nails which could be easily put in the rocks.\n\n He also demanded injections of high power that could remove fatigue and provide courage. With this material they would climb the hill during the night and put the rope up to hill top with the help of nails.\n\n The path was formidable and inaccessible but he had examined and tested the area well with field binoculars.\n\nThe day before the execution of the plan, at about 11 a.m., General Malik, encouraging Digendra, said, “Son! Accept congratulations of V. P. Malik 48 hours in advance of our success.\n\n Son! If we win the Kargil, Malik himself will bring breakfast for you tomorrow morning. ” The plan was executed on the evening of 10 June 1999.\n\n There was deadly silence in the hills except for the blasts. There was snow all around. Slowly and slowly with cautious steps Digendra and his companions moved ahead with military goods.\n\n They put nails in the rocks and tied the rope. When they got tired halfway up they took the injections. When Digendra’s hands stopped working, he gripped the rope with his teeth. There was a 5000 feet deep chasm below. After 14 hours they reached the top of Tololing.\n\n After all, the entire journey was with a rope. They reached back the battalion with the hanging rope.\n\nThe commando team included Major Vivek Gupta, Subedar Bhanwar Lal Bhakar, Subedar Surendra Singh Rathor, Lance Naik Jasvir Singh, Naik Surendra, Naik Chaman Singh Tewatia, Lans Naik Bachchan Singh, CMH Jashvir Singh, Havaldar Sultan Singh Narwar and Digendra Kumar. The Pakistani army had made 11 bunkers on the Tololing hill top. Digendra was to target the first and the last (11th) bunkers. The rest were to target the remaining 9 bunkers. They ascended the hill with ammunition.\n\nThe wind blew very cold at Kargil. The darkness was dense and the paths very inaccessible. There were frequent, sudden blasts.\n\n All that could be seen was blackness. They started climbing hill along the rope fixed to nails in the rock. Crawling Digendra unknowingly reached a machine gun nest.\n\n Digendra’s hands touched the hot barrel of a machine gun from which the enemy was blasting the balls. Perceiving the presence of enemy, he removed the barrel and within moments threw a grenade in the bunker where there was an explosion.\n\nDigendra hit the target accurately. The first bunker began to fire and was reduced to ashes. From behind there was firing by Artillery tanks and 250 commandos.\n\n The Pak Army also played an equal role. Cobra’s colleagues fired intensely but were unable to move. Cannons were fired from a meter above.\n\n Digendra was badly wounded. Three bullets had hit him in the chest, one leg was badly wounded and his upper body faced 18 bullets, his pitthu was badly torn, one of his shoes was missing, his pants and shirt were reduced to pieces.\n\n His LMG was also missing from his hands. He bandaged himself to prevent blood loss.\n\nSubedar Bhanwar Lal Bhakar, Lance Naik Jasvir Singh, Naik Surendra, and Naik Chaman Singh were killed.\n\n Digendra was given a pistol from Lans Naik Bachhan Singh, and a grenade from Sultan Singh. Major Vivek Gupta was killed with a bullet in the head.\n\n Digendra hurled the grenades in the other bunker successfully destroying all bunkers. He threw 18 grenades into 11 bunkers. Major Anwar Khan, from the enemy camp, appeared over Digendra, who had only one bullet remaining. He shot Khan and dislodged his pistol from his hands.\n\n Not realizing he was out of bullets, Digendra tried to shoot with the pistol but in vain. He quickly jumped on Anwar Khan, eventually beheading him and hailed Mother India.\n\nCoincidentally a U.S. satellite passed over the top of Tololing at that moment a captured a file photo of the him binding a scarf around the decapitated head of Major Anwar Khan and trying to plant an Indian flag.\n\nThus, Digendra recaptured the top of the hill and planted the Indian tri-colour flag on 13 June 1999 at four O’clock in the morning.”"
  },{
    "id": "1007",
    "name": "Captain Keishing Clifford Nongrun",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "http://www.newsgram.com/wp-content/uploads/2015/07/nongrum.jpg",
    "moredescription": "\n\nReferences: en.wikipedia.org",
    "description": "Unit: 12 JAK LI",
    "description1": "Service: Indian Army",
    "description2": "Born: March 7, 1975\n",
    "description3": "\n     On the night of 30 June/1 July 1999, in the operations to capture Point 4812, Capt. Keishing Clifford Nongrum was tasked to assault the feature from the southeastern direction.\n\nCaptain Nongrum led his column over the near impossible vertical feature.\n\n On reaching the top, his column encountered strong enemy opposition.\n\n The enemy was well entrenched in interconnected bunkers,carved out of boulders, and remained invulnerable to even artillery fire.\n\n The enemy pinned CaptainNongrum's column down with heavy and accurate automatic fire for about two hours. On seeing the futility of own fire against the fortified bunkers, Captain Nongrum, with utter disregard to his personal safety, charged through the fire zone. Closing in with the first bunker, he threw grenades into it and killed six enemy soldiers.\n\n He then tried to snatch the universal machine gun of the enemy from the bunker and received a volley of bullets.\n\n The audacious action of Capt. Nongrum stunned the enemy, giving valuable reaction time to his troops to close in and finally clear the position.\n\nThough severely wounded, Capt. Nongrum refused to be evacuated and fought valiantly till he succumbed to his injuries. This act resulted in the ultimate capture of Point 4812.For conspicuous gallantry and supreme sacrifice, Captain Keishing Clifford Nongrum was honored with the Maha Vir Chakra, posthumously."
  }, {
    "id": "1008",
    "name": "Colonel Sonam Wangchuk",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "http://www.reachladakh.com/images/product/main/13_1057097983_Col-Sonam-Wangchuk.jpg",
    "moredescription": "\n\nReferences: en.wikipedia.org",
    "description": "Unit: Assam Regiment, The Ladakh Scouts",
    "description1": "Service: Indian Army",
    "description2": "Born on 1964\n",
    "description3": "\n     On 30 May 1999, Major Sonam Wangchuk was leading a column of The Indus Wing, Ladakh Scouts as a part of ongoing operations in Op VIJAY in the Batalik Sector.\n\n The column was tasked to occupy Ridge Line on the Line of Control in a glaciated area at a height of about 5,500 metres. This was essential so as to pre-empt its occupation by the enemy and any subsequent infiltration.\n\nWhile moving towards the Line of Control, the enemy ambushed the column by firing from a vantage position. In the process, one NCO of The Ladakh Scouts was killed.\n\n Major Sonam Wangchuk held his column together and in a daring counter ambush, led a raid on the enemy position from a flank, killing two enemy soldiers. The officer also recovered one heavy machine gun and one Universal machine gun, ammunition, controlled stores and three dead bodies of the enemy personnel.\n\nThereafter, the officer took stock of all forces along the Chorbatla axis in the Batalik Sector and cleared the axis up to the Line of Control of all enemy intrusions at great risk to his life.\n\nMajor Sonam Wangchuk displayed exceptional bravery and gallantry of the highest order in the presence of enemy fire and in extreme climatic conditions in the glaciated area."
  },{
    "id": "1009",
    "name": "Major Rajesh Singh Adhikari",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "http://image.newsdog.today/origin_a51f7ce618e6d9c7ceee534b7dd4485b",
    "moredescription": "\n\nReferences: en.wikipedia.org",
    "description": "Unit: 18 GRENADIERS",
    "description1": "Service: Indian Army",
    "description2": "Born: December 25, 1970\n",
    "description3": "\n     When heavy fighting broke out in the Kargil region of the Indian state of Jammu and Kashmir owing to planned infiltration by militants backed by the Pakistan army, the Indian Army was ordered to clear the heights of those intruders.\n\n Many tough battles took place in the region. The Mechanized Infantry's Major Rajesh Singh Adhikari, the second army officer to die in the operations against infiltrators, had caused heavy casualties to the intruders and forced them to withdraw before succumbing to injuries in Drass sector. It was one of the most significant battles, the Battle of Tololing, where Rajesh made a valiant sacrifice.\n\nOn 30 May 1999, as a part of battalion operations to capture the Tololing feature, Major Rajesh Singh Adhikari, 18 Grenadiers was tasked to secure the initial foothold by capturing its forward spur where the enemy held a strongly fortified advance position. The post was located in a treacherous, mountainous terrain at about 15,000 feet and covered with snow. While Major Rajesh Singh Adhikari was leading his team towards the objective, he was fired at from two mutually supporting bunkers with universal machine guns.\n\n The officer immediately directed the rocket launcher detachment to engage the bunker and without waiting, rushed into the bunker and killed two intruders in close quarter combat.\n\nThereafter, the officer, displaying presence of mind under heavy fire, ordered his medium machine gun (MMG) detachment to fix position behind a rocky feature and engage the enemy.\n\n The assault party continued to inch their way up. Despite suffering grievous bullet injuries, Major Rajesh Singh Adhikari continued to direct his sub unit. Refusing to be evacuated, the officer charged at the second bunker and killed one more occupant, thus capturing the second bunker at Tololing which later facilitated capture of Point 4590.\n\n For conspicuous gallantry and supreme sacrifice, Major Rajesh Singh Adhikari was posthumously awarded the second highest Indian Army decoration Maha Vir Chakra for his actions in the battle."
  }, {
    "id": "1010",
    "name": "Lt Balwan Singh",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "https://www.ncaacademy.com/wp-content/uploads/2015/07/Lieutenant-Balwan-SinghMaha-Vir-Chakra-.jpg",
    "moredescription": "\n\nReferences: www.ilagarg.com",
    "description": "Unit: 18 Grenediers regiment",
    "description1": "Service: Indian Army",
    "description2": "\n",
    "description3": "\n     Lieutenant Balwan Singh and his Ghataks were tasked to assault Tiger Hill Top on 03 July 1999 as part of multi-pronged attack from the North East direction.\n\nThe route to the objective was untrodden, interspersed with pointed rocks and thick snow at a height of 16,500 feet. The officer executed his task with courage and determination.\n\nThe team led and exhorted by him moved over twelve hours under intense artillery shelling to reach the designated spur. This move took the enemy totally by surprise as his team used cliff assault mountaineering equipment to reach the Tiger Hill Top stealthily.\n\nOn seeing the Ghataks, the enemy reacted in panic with intense automatic fire causing serious injury to the officer and his team.\n\nHe refused to be evacuated and unmindful of his injury and grave condition, moved swiftly to encircle the intruders. His adversaries had no choice but to flee from the fury of accurate fire of the Ghataks.\n\nThe officer’s unparalleled courage under enemy fire and determination led to capturing Tiger Hill, the most important objective of our troops in Operation Vijay."
  }, {
    "id": "1011",
    "name": "Captain Anuj Nayyar",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "http://timesofindia.indiatimes.com/photo/9126004.cms",
    "moredescription": "\n\nReferences:MVC Citation of Captain Anuj Nayyar ",
    "description": "Unit: 17 JAT",
    "description1": "Service: Indian Army",
    "description2": "Born: August 28, 1975\n",
    "description3": "\n     On 06 July 1999, Charlie Company was tasked to capture an objective, which was a part of the Pimple Complex on the Western Slopes of Point 4875, in the Mushkoh Valley.\n\n At the beginning of the attack the Company Commander got injured and the command of the company devolved on Captain Anuj Nayyar. Captain Nayyar continued to command his leading platoon into the attack under heavy enemy artillery and mortar fire.\n\n As the platoon advanced, the leading section reported location of 3 to 4 enemy positions.\n\n Captain Nayyar moved forward towards the first enemy position and fired rocket launcher and lobbed grenades into it.\n\nThereafter, the section, along with Captain Nayyar, physically assaulted and cleared the position. The enemy, which was well entrenched, brought heavy volume of automatic fire.\n\n Captain Anuj Nayyar, unmindful of his personal safety, motivated his men and cleared two more enemy positions. While clearing the fourth position an enemy rocket propelled grenade hit the officer killing him on the spot.\n\n This action led by Captain Anuj Nayyar resulted in killing nine enemy soldiers and destruction of three medium machine gun positions of the enemy.\n\n The success ofthis operation after a brief setback was largely due to the outstanding personal bravery and exemplary junior leadership of this daring officer.\n\n Captain Anuj Nayyar displayed indomitable resolve, grit and determination and motivated his command by personal example acting beyond the call of duty and made the supreme sacrifice in true traditions of the Indian Army."
  },{
    "id": "1012",
    "name": "Colonel Vijay Kumar Bakshi",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "",
    "moredescription": "\n\nReference: fauziveterans.com ",
    "description": "Gorkha Rifles",
    "description1": "Service: Indian Army",
    "description2": "Born: 3rd April 1943",
    "description3": "\n     On 2 March 1989, Colonel Vijay Kumar Bakshi led a company group of 6/8 Gorkha Rifles on a search and destroy mission. The company encountered a militants’ camp in the area of Nayaroo Lagoon in the Wani Sector (Sri Lanka).\n\n This contact which started as an exchange of fire involving firing by the militants from multiple directions, turned into a prolonged engagement, lasting over twenty-four hours. During the action, Colonel Bakshi personally led his troops and, despite being injured, refused to break contact with the militants and continued to press forward.\n\n Through his personal example, Colonel Bakshi ensured continued pressure on the militants, which resulted in inflicting heavy damage and casualties on them.\n\n Finally, he received a bullet injury and died. Throughout the operation, Colonel Vijay Kumar Bakshi displayed conspicuous courage, determination and valiant combat leadership."
  },{
    "id": "1013",
    "name": "Captain Pratap Singh",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "https://rejinces.files.wordpress.com/2014/09/pratap.jpg",
    "moredescription": "\n\nReferences: rejinces.net",
    "description": "75 Medium Regiment",
    "description1": "Service: Indian Army",
    "description2": "Born: 17th Jan 1970\n",
    "description3": "\n     “Captain Pratap Singh was deployed as an observation post officer Siachen area in April 1985.\n\nThe adversary made repeated attempts to retake a key post vital for our defences of Siachen, without success. Their last attempt to take a post was on 9th May, 1988, when they fixed four ropes and a ladder-system on the ice-wall below the post for the purposes.\n\n This attack was successfully beaten back by our forces. The ropes and the ladder-system fixed by the adversary, however, remained in position, making it possible for them to use it again in their fresh attempts to take the post. It was imperative that the fixed ropes were cut and the ladder unfixed to prevent fresh attempts. On the 18th May, 1988, Second-Lieutenant Ashok Choudhary was able to reach and cut four of the ropes. On the 26th May, 1988, it was decided to cut the remaining two ropes and unfix the ladder.\n\n Captain Pratap Singh undertook this mission with the help of a jawan, descending the ice wall. On reaching the location, Captain Pratap Singh found a large quantity of ammunition and grenades lying at the head of the ropes. While examining the same, a grenade booby-trapped him, severely wounding his right arm and chest. Despite being badly wounded the brave officer crawled forward to the fixed ropes and cut them with his knife.\n\n Then he unfixed the ladder system and let it fall down the ice wall. Then the gallant officer inched back to his own rope to come up the ice wall to return to the post, but collapsed due to his severe wounds and made the supreme sacrifice of his life for the nation.\n\nCaptain Pratap Singh thus displayed conspicuous gallantry in eliminating a great threat to a key post of our vital defence of Siachen Glacier at the cost of his life.”\n\nAfter over 25 years, Captain Pratap Singh, MVC, continues to be my hero and always has a special place in my heart."
  },{
    "id": "1014",
    "name": "Second Lt.Rajeev Sandhu",
    "title": "1987",
    "operation": "Operation Pawan-Sri Lanka",
    "url": "http://www.bharat-rakshak.com/ARMY/images/Rajeev.jpg",
    "moredescription": "\n\nReferences: ",
    "description": "Assam Regiment",
    "description1": "Service: Indian Army",
    "description2": "A",
    "description3": "\n     On 19 July 1988, morning, Rajeev took out a small convoy of two vehicles, an open RCL (Recoilless Gun) jeep and a 1 ton lorry to collect rations from 19 Madras post which was about 8 kms away.\n\n As the convoy was passing an abandoned building in the jungle, the jeep came under heavy automatic and 40 mm Rocket Launcher fire from right side of the road.\n\n Lance Naik Nandeshwar Das and Sep Lalbuanga who were seated in the rear of jeep were killed instantaneously by automatic fire while the 40 mm Rocket hit the front of the jeep.\n\n The driver, Nk Rajkumar was very seriously wounded with lower half of his jaw blown off and thrown out of the jeep.\n\n 2nd Lieutenant Rajeev Sandhu seated in co-driver’s seat received the direct hit of rocket that mutilated both his legs. Totally crippled and bleeding profusely, Rajeev managed to roll out of the jeep with his 9 mm carbine and crawled to a fire position nearby.\n\n Presuming that everyone in the jeep had been killed, one of the militants came out of hiding and approached the jeep to pick up weapons and ammunition.\n\n Despite the fact that Rajeev’s legs were shattered and his body was riddled with bullets, he lifted his carbine with blood soaked hands and shot the militant dead.\n\n The militant was later identified as the personal hench man of a sector commander.\n\n  The militants continued firing at Rajeev, who determinedly held on to his position and prevented movement of the militants to recover their dead or collect our weapons.\n\n Meanwhile, on hearing the sound of firing, collection party traveling in 1 ton jumped out and crawled forward to engage the militants.\n\n Naik Bhagirath came forward towards the jeep and saw 2/Lt Rajeev firing at the militants despite being mortally wounded and bleeding profusely.\n\n Rajeev signaled to him in a choked voice to outflank the militants and cut them off. This was quickly done. The militants, on seeing the flanking movement, fled away into the jungle leaving behind dead bodies of their comrades with their weapons and ammunition.\n\n The 1 ton group gave chase to fleeing militants but lost contact. Meanwhile, Sepoy Kamkholum moved his vehicle forward towards the jeep and came to lift Rajeev Sandhu; Naik Rajkumar and the other fallen comrades of protection party.\n\n  Very weakened by grievous wounds and loss of blood and barely audible, 2nd Lieutenant Rajeev Sandhu ordered Nk Rajkumar and protection party to be evacuated first; the weapons be collected and a group left behind to keep the area under surveillance.\n\n  Having displayed great courage, determination, professionalism and selflessness, Rajeev went into coma and breathed his last while being evacuated by a chopper.\n\nThe Mahavir Chakra awarded to Rajiv posthumously was received by his proud father Shri Devinder Singh Sandhu on 26 Mar 1990 at Rashrapati Bhavan."
  },
//    {
//    "id": "1015",
//    "name": "Inder Bal Singh Bawa",
//    "title": "1984",
//    "operation": "Operation Meghdoot-Siachen",
//    "url": "",
//    "moredescription": "\n\nReferences: ",
//    "description": "",
//    "description1": "A",
//    "description2": "A",
//    "description3": "A"
//  },{
//    "id": "1016",
//    "name": "Subedar Sansar Chand",
//    "title": "1987",
//    "operation": "Operation Pawan-Sri Lanka",
//    "url": "",
//    "moredescription": "\n\nReferences: ",
//    "description": "",
//    "description1": "A",
//    "description2": "A",
//    "description3": "A"
//  },{
//    "id": "1017",
//    "name": "Sqn Ldr Ajjamada B. Devaiah",
//    "title": "1987",
//    "operation": "Operation Pawan-Sri Lanka",
//    "url": "http://coorgnews.in/wp-content/uploads/2015/09/MVC19-Devayya-e1442457731229.jpg",
//    "moredescription": "\n\nReferences: ",
//    "description": "",
//    "description1": "A",
//    "description2": "A",
//    "description3": "A"
//  },
    {
    "id": "1018",
    "name": "Captain Arvind Singh",
    "title": "1987",
    "operation": "Operation Pawan-Sri Lanka",
    "url": "",
    "moredescription": "\n\nReferences: infogalactic.com ",
    "description": "Indian Marine Special Force",
    "description1": "Service: Indian Navy",
    "description2": "\n",
    "description3": "\n     Lieutenant Arvind Singh was the Officer-in-Charge of the Indian Marine Special Force (IMSF) team which along with 10 Para Commandos was given certain specific tasks as part of the Indian Peace Keeping Force operation in Sri Lanka.\n\nLieutenant Singh leading a team broke out from Jaffna Fort at 1430 hours on 19 October 1987. During this operation, the team had to negotiate through heavily mined road - with booby traps laid by the militants.\n\n The team was under militants' fire from buildings and roof-tops. Lieutenant Singh by his personal example of bravery motivated his men to secure the area which resulted in link up of 41 Brigade with 1 Maratha Light Infantry on 20th October 1987.\n\nOn the Night of 21/22 October 1987, IMSF team under his leadership was tasked to destroy Guru Nagar Jetty and the militant speed Boats in the Jaffna Lagoon. The team successfully placed and detonated explosive charges and extensively damaged the Jetty and destroyed six militant speed boats.\n\n In order to destroy the remaining militant speed boats, the team reached its destination by swimming over a mile underwater and successfully planted demolition charges in 11 speed boats, kept ready for the escape of hard core militants.\n\n Before the charges could be exploded, the team came under heavy fire from the militants.\n\n Lieutenant Arvind Singh once again effectively took charge of the situation and provided diversion by exposing himself to militants' fire without regard to his life and personal safety.\n\nThis act inspired his men who accomplished the task of destruction of all of the speed boats.\n\nLieutenant Arvind Singh thus displayed exceptional devotion to duty and gallantry in utter disregard to his personal safety."
  },{
    "id": "1019",
    "name": "Brigadier Manjit Singh",
    "title": "1987",
    "operation": "Operation Pawan-Sri Lanka",
    "url": "",
    "moredescription": "\n\nReferences: ",
    "description": "41 Infantry Brigade",
    "description1": "Service: Indian Army",
    "description2": "\n",
    "description3": "\n     In October 1987,Brigadier Manjit Singh assumed commond of the 41 Infantry Brigade,deployed in Sri Lanka as part of India's peacekeping forces.\n\nOne of brigades first task was to clear Jaffna,a terrorist stronghold , and and to establish a link with the Maratha Light Infantary in Jaffna port.\n\n All the approach roads were heavily mined,and the Brigadier on arriving at palali airfield,found several Indian troops facing stiff resistance at Anna Collai and Manipal.\n\nThe brigadier took charge.Deploying just two companies of the Rajstana Rifles,he was able to break militant cordon and secure a link with forces at jaffna fort.\n\n His able leadership inspired men to overcome onslaugt of militants.\nBrigadier Singh was honoured with Mahavir Chakra."
  },{
    "id": "1020",
    "name": "Major Daljit Singh Narang",
    "title": "1971",
    "operation": "Operation Cactus-Lilly",
    "url": "",
    "moredescription": "\n\nReferences: Department of Sainik Welfare",
    "description": "Unit : 45 Cavalry",
    "description1": "Service : Indian Army",
    "description2": "Born: 20 May 1935\n",
    "description3": "\n     Major Daljit Singh Narang was commanding a squadron of cavalry which was attacked by two enemy battalions, supported by a squadron of Chaffee tanks.\n\n He skillfully and boldly maneuvered his squadron despite heavy enemy fire and engaged and destroyed the enemy tanks.\n\n With utter disregard for his personal safety and undeterred by heavy enemy fire, he directed the fire of his squadron standing on the turret of his tank.\n\n When one of the tanks of his squadron was hit, he immediately, at immense risk to himself, rushed to assist its crew in pulling out.\n\n His courage and fearlessness so inspired his command that they successfully decimated the enemy squadron of Chaffee tanks and stemmed the enemy advance.\n\n Major Narang was killed atop his tank by machine gun fire while leading his squadron.\n\nThroughout this action, Major D.S. Narang displayed outstanding leadership and determination. \n\nHis conspicuous bravery, devotion to duty and supreme sacrifice is in the highest tradition of the Army."
    },
//    {
//    "id": "1021",
//    "name": "Rear Admiral Santosh Kumar Gupta",
//    "title": "1971",
//    "operation": "Operation Cactus-Lilly",
//    "url": "",
//    "moredescription": "\n\nReferences: www.jatland.com ",
//    "description": "",
//    "description1": "Service : Indian Navy",
//    "description2": "Born: 21 December 1936\n",
//    "description3": ""
    //  },
    {
    "id": "1022",
    "name": "Major Vijay Rattan Choudhry",
    "title": "1971",
    "operation": "Operation Cactus-Lilly",
    "url": "",
    "moredescription": "\n\nReferences: www.jatland.com ",
    "description": "9 Engineers Regiment",
    "description1": "Service : Indian Army",
    "description2": "Born: 9th July, 1939\n",
    "description3": "\n     On the night of 11/12 December, 1971, the movement of tanks was disrupted near Chakra town when a trawler got bogged down in the nullah running across a minefield.\n\n At the same time the Pakistanis were regrouping to launch a counter attack on the captured town of Chakra. Therefore it became very important that the movement of traffic across the minefield was restored.\n\n Major Chaudhary started on the work to clear the lane despite coming under heavy enemy fire.\n\n Displaying utter disregard for his personal safety, he personally supervised the work, moving from man to man giving instructions.\n\n Due to his brave leadership while under heavy enemy fire, the traffic was restored and tanks and other vehicles could move into the town.\n\nHe also cleared major minefields at Thakurdwara Lohra and Basantar river, in addition to one at Chakra of 1000 to 1500 yards.\n\n While supervising the clearing of minefield lane near Basantar river, this tireless and brave officer was killed due to enemy artillery fire.\n\n Major V R Chaudhary displayed exceptional devotion to duty, extraordinary bravery and made the supreme sacrifice.\n\n For his role he was awarded the Maha Vir Chakra (MVC) posthumously in December, 1971."
  },
//    {
//    "id": "1023",
//    "name": "Captain Gautam Mubayi",
//    "title": "1965",
//    "operation": "Operation Riddle",
//    "url": "",
//    "moredescription": "\n\nReferences: ",
//    "description": "",
//    "description1": "A",
//    "description2": "A",
//    "description3": "A"
//  },
//    {
//    "id": "1024",
//    "name": "Major Asa Ram Tyagi",
//    "title": "1965",
//    "operation": "Operation Ablaze",
//    "url": "",
//    "moredescription": "\n\nReferences: ",
//    "description": "",
//    "description1": "A",
//    "description2": "A",
//    "description3": "A"
//  },
    {
    "id": "1025",
    "name": "Wing Cdr Jag Mohan Nath",
    "title": "1965",
    "operation": "Operation Riddle",
    "url": "http://i.dailymail.co.uk/i/pix/2014/09/05/article-2745590-2118BA2F00000578-493_308x425.jpg",
    "moredescription": "\n\nReference: www.bharat-rakshak.com",
    "description": " 106 Squadron ",
    "description1": "Service: Indian Air Force",
    "description2": "\n",
    "description3": "\n    Bar to MVC During the Indo-Pak War 1965, Sqn Ldr Nath was again the Flight Commander with the Strategic Photo Reconnaissance Squadron flying the Canberra aircraft.\n\n He led his unit several times over the hostile territory to obtain vital information about the enemy.\n\n The unescorted missions, which were in the nature of reconnaissance, entailed flying long distances over the enemy territory and well-defended airfields and installations during day light.\n\n Sqn Ldr Nath was fully aware of the risk he was running on each of these missions. Still, he chose to undertake the risky missions himself.\n\n It was after great persuasion that he allowed his colleagues to do some risky assignments. The information gathered by him during his missions proved vitally important to Indian air effort.\n\n The missions enabled our Air Force to attack vital enemy targets and this adversely affected enemy's war effort.\n\n Squaderan Leader Nath was awarded Bar to Mahavir Chakra for displaying courage, determination and devotion to duty"
  },{
    "id": "1026",
    "name": "Lt General	Zorawar Chand Bakshi",
    "title": "1965",
    "operation": "Operation Ablaze",
    "url": "",
    "moredescription": "\n\nReference: faujibyheart.blogspot.in",
    "description": "16/10 Baluch Regiment",
    "description1": "Service : Indian Army",
    "description2": "Born in 1921\n",
    "description3": "\n    In 1945, Zoru fought in the Battle of Kangaw, one of the hardest fought battles of the Burma campaign. It was in this Battle that Zoru won the first of the series of decorations. He was 'Mentioned in Dispatches'\n\nAt the time of partition, Zoru was assigned to the Punjab Boundary Force, entrusted to maintain peace in Punjab. Contrary to plans, the Punjab Boundary Force was found inadequate to manage the situation arising out of the riots and disturbances.\n\n Responsibility of maintaining peace in the disturbed areas was handed over to the respective Governments, and the Punjab Boundary Force officially ceased to exist.\n\nIn 1948, in the J&K operations, Zoru fought valiantly, and was awarded the 'Vir Chakra'. What was unique about this achievement was that Zoru was a staff officer and staff officers rarely got an opportunity to be in a combat situation.\n\nIn 1949, Zoru was awarded his next medal - \"Mac Gregor Memorial Medal'.  This was instituted in memory of Major General Charles Metcalf Macgregor, and was awarded every year for the best military reconnaissance or journey of exploration or survey of remote areas of India. Zoru was assigned the task of conducting a very important strategic military reconnaissance of some areas of Tibet.\n\n Zoru, disguised as a Tibetan monk, covered a distance of 400 kms in 80 days, and traversed some of the highest mountain passes of the Himalayas.\n\n For successfully completing this assignment, Zoru was awarded this medal - the fist one after India's independence.\n\nIn 1951, Zoru was selected for the 4th course of the Defence Services Staff College at Wellington, and completed this with flying colours. He performed so well, that was recommended for an Instructional appointment.\n\n After completing Staff College, Zoru took up the assignment of Brigade Major – 121 Infantry Brigade. Zoru thus had the unique distinction of completing this assignment on two occasions.\n\nAfter two quick stints – one as Instructor – Infantry School, Mhow, and then as Instructor Staff College (on promotion to Lt. Col.) Zoru got his command of a Battalion – that of 2/5 Gorkha Rifles which was in Calcutta. This was in 1951. Soon after, Bakshi’s Battalion sailed for Congo (erstwhile Zaire), for peacekeeping duties.\n\n For leading his battalion in effective implemtation of law and order and peace in Congo, Zoru was awarded the Vishisht Sewa Medal.\n\nIn 1965, Zoru was promoted to the rank of Brigadier, and posted as Commander 68 Infantry Brigade in Kashmir. The war clouds had gathered once again. Pakistani infiltration began just a few days after Zoru assumed command.\n\n  While infiltration was being effectively addressed, it was felt that to prevent further ingress,  by guerrillas and to block routes being used by them, some key tactical features had to be captured. The Hajipir Pass was one of them.\n\nThe Hajipir Pass was strategically very important as it provided one of the main routes of ingress into the Kashmir Valley. Zoru was assigned the mission to capture the Pass. In fact, so strong was the faith of the senior command in Zoru’s capability, that the whole operation was codenamed ‘Operation Bakshi’\n\nIn one of the most brilliantly executed operations in the 1965 conflict, Zoru captured the Hajipir Pass and wrote his name in the Indian Military history.\n\nThe credit for the capture went to Major Ranjit Dayal, who actually captured the feature, and to Zoru for planning and executing a bold plan, fraught with risk. There is no doubt that if this plan had failed, Zoru would have been solely held responsible, as he had not taken permission from his senior command to execute it.\n\n  For his role as a commander in executing this mission, Brigadier Zoru Bakshi was awarded the Maha Vir Chakra, India’s second highest medal for gallantry. With a Vir Chakra already under his belt, Zoru became  the only Indian Army officer to have been awarded both medals.\n\nIn March 1967, Zoru was appointed Brigadier General Staff of the Eastern Command, where Lt. Gen. Manekshaw as the Army Commander.  Soon after Zoru was selected to do the senior command course at the Imperial Defence College, London. Zoru passed the course with distinction. He returned, and after a brief stint in the Military Training Directorate, Zoru was promoted to Major General and posted at GOC 8 Mountain Division, in Nagaland, where insurgency had become a serious problem.\n\nAs GOC, Zoru experienced an incident which was to earn him the reputation of being a very strict disciplinarian. One of his Brigade Commanders was Brigadier SK Sinha, (who later rose to the position of Vice Chief of Army Staff), under whose command two Nagas were killed reportedly because they were hostile. Zoru personally got involved in the enquiry and soon the truth was out that one of the battalions, in a bid to notch up the counter insurgency score had actually tortured and killed  two Nagas, and their bodies were disposed off.Zoru was extremely upset.\n\n Since this happened under Sinha’s command, Sinha was informed by Zoru, that the recommendation for an AVSM for Sinha was not being withdrawn. The commanding officer of the Battalion was removed from command and demoted to the rank of Major. Two more officers were court martialled and either dismissed from service or imprisoned.When the 1971 operations against Pakistan became imminent, Zoru was commanding 26 Infantry Division in Jammu. As part of a strategic initiative planned for 1 Corps, Zoru’s Division was assigned a strategically important mission which was to advance towards Sialkot, Pakistan. However, soon after hostilities commenced on December 3, 1971, the situation on the ground changed fast, and soon, the original plan to advance towards Sialkot had to shelved, and 26 Division was redeployed to defend Jammu.\n\nZoru proceeded to capture ‘Chicken’s Neck’ a phrase coined by Zoru himself, that was of extreme strategic importance. That Chicken’s Neck was captured within 48 hours of implementation of plans, is a feat in itself. It was an operation reminiscent of the capture of the Hajipir Pass. Zoru once again proved the point that it wasn’t numerical superiority, but daring and audacity that bring success.\n\nAfter the war, Zoru was posted to the Directorate of Military Operations. On promotion to Lt. General Zoru took charge as Military Secretary, at the Army HQ.\n\nIn 1975 Zoru was assigned 2 Corps as Corps Commander, replacing Lt Genl TN Raina who moved to take over as Western Army Commander.Zoru undertook his responsibility in a most distinguished manner, till the time he retired in 1979.\n\nAge was against Zoru, else (there is little doubt) that he would have moved right up to the top most position.\n\nZoru is one of the most well known Generals of the Indian Army. A highly decorated soldier, he was a very successful military leader. He was also a brilliant strategist and a tactician. In all missions assigned to him, he did not taste defeat even once, nor did he lose an inch of territory to the enemy. His courage on the battlefront was matched by his sense of fair play, upright behaviour and the courage to stand by his convictions.\n\nZoru – a true ‘son of the soil’ defended the honour of his motherland and of his command, always and every time."
  },{
    "id": "1027",
    "name": "Rifleman Jaswant Singh Rawat",
    "title": "1962",
    "operation": "Battle of Nuranang",
    "url": "http://media.indiatimes.in/media/content/2015/Dec/thumb_img_3435_1024_1448972182_725x725.jpg",
    "moredescription": "\n\nReference: en.wikipedia.org",
    "description": "4 Garhwal Rifles",
    "description1": "Service : Indian Army",
    "description2": "Born: 19 August 1941\n",
    "description3": "\n    The Orders for the 4 Garhwal rifles were to retreat from their position but Rifleman Jaswant Singh, remained at his post and repulsed Chinese troops for three days from overrunning the post. The local story goes that he was assisted by two Monpa girls named Sela and Nura some others say that the village lady was Boom la.\n\n They had put guns at various places in such a manner that the Chinese were made to believe that the post had many soldiers.\n\n But the Chinese got hold of the man who was supplying rations to Jaswant Singh Rawat and it became known to them that only one man was guarding the post.\n\n The infuriated Chinese attacked with full force. Sela was killed in a grenade blast, Nura was captured and Jaswant Singh Rawat killed by a head shot.\n\n According to the legend he killed more than 300 Chinese Soldiers in the battle and the Chinese were so angry with him that they cut off his head back to China.\n\n After the ceasefire impressed by the soldier’s bravery, the Chinese returned the head along with a brass bust of Jaswant Singh."
  },{
    "id": "1028",
    "name": "Wg Cdr	SB Noronha",
    "title": "1951",
    "operation": "Operation Tomahawk",
    "url": "http://pinnacleprism.com/website/images/history7.jpg",
    "moredescription": "\n\nReference: indianairforce.nic.in",
    "description": "",
    "description1": "Service: Indian Air Force",
    "description2": "\n",
    "description3": "\n    In the close support role, intrepid fighter pilots like Sqn Ldr D Subia and Sqn Ldr RS Kalavaniwala accurately and repeatedly attacked enemy positions at Gurais, Zoji La, Pindras, Rajauri etc., winning many Vir Chakra awards.\n\n One can well imagine the skill and courage required to hit pin-point targets, among high hills and deep valleys, in the face of heavy machine gun fire.\n\n Though Skardu could not be maintained by air supply and fell after six months of siege when ammunition was totally exhausted, and tough inclement weather over the high hills sometimes kept the planes grounded, the overall performance of the RIAF was superb indeed.\n\n Not only Air Cmde Mehar Singh, the AOC of No. 1 Group RIAF controlling all the air operations in J & K, but also Wg Cdr MM Engineer, Wg Cdr H Moolgavkar and Wg Cdr SB Noronha were honoured with the MVC for this superb performance and their vitally important contribution to it.\n\n The RIAF won, in all, four Maha Vir Chakra and 28 Vir Chakra awards in operations in J & K in 1947-48."
  },{
    "id": "1029",
    "name": "Air Cmde Mehar Singh",
    "title": "1947",
    "operation": "Indo Pak Kashmir War",
    "url": "http://indianairforce.nic.in/writereaddata/exchief_uploaded_photos/meharsingh.jpg",
    "moredescription": "\n\nReference: http://www.bharat-rakshak.com/",
    "description": "Fighter Pilot(British India)",
    "description1": "Service: Indian Air Force",
    "description2": "Born: 20 March 1915\n",
    "description3": "\n    After the outbreak of World War 2, Mehar Singh formed No.6 Squadron at Trichinopoly on 1st December 1942. The squadron was formed with the merger of the Coastal Defence Flights and was equipped with the Hawker Hurricane.\n\n The squadron flew its first operational sortie in November 1943 and was trained in the role of a recon squadron. Under Mehar Singh's able leadership, the squadron earned the sobriquet,\n\n \"The Eyes of the Fourteenth Army\" (The 14th Army was the British Army commanded by Gen William Slim).\n\nThe squadrons Hurricanes became a popular sight with the forward troops, who used to call them different names ranging from \"The Arakan Twins\" to \"The Maungdaw Twins\". \n\nThe squadron reached such heights of efficiency that Field Marshal Slim remarked in his book Defeat into Victory that, \"I was particularly impressed with the conduct of the squadron led by a young Sikh Squadron Leader(Mehar Singh).They were a happy and an efficient unit.\" At the end of the tour of the Squadron, Mehar Singh was decorated with the Distinguished Service Order (DSO). The only such award to the Indian Air Force ever.\n\nThe call of duty beckoned again in 1947 after independence, during the tribal invasion of Kashmir. Mehar Singh, now an Air Commodore, was put in charge of No.1 Operational Group at the time of independence, was in charge command and control of air operations in India. Mehar Singh led from the front.\n\n He flew many of the pioneering and daunting missions himself. He never put into risk his men in tasks for which he would not venture himself first.\n\nOne of the first assignments on Mehar Singh's task list was the relief of Poonch. Poonch was an isolated garrison which was cut off from motorable roads due to enemy incursions, and it was left to Mehar Singh to supervise the air relief of Poonch. Mehar Singh personally flew a Harvard aircraft and landed it at Poonch airstrip which was newly constructed.\n\n The very next day, Mehar repeated the feat, this time flying a Dakota. Soon after Dakotas started bringing in supplies, evacuating causalities and when the necessity arose, flying down the Mountain Howitzers of the Hazara Mountain Battery for the defence of Poonch.\n\nMehar Singh's flight to Leh in Ladakh has been well chiseled into annals of the Indian Air Force's legend. When the remote district of Ladakh was in a danger of being cut off and overrun by a Pakistani force from Skardu along the Shyok Valley, a decision was taken to fly troops by air to Leh, which had an airfield at an altitude of 11,540 feet. flying an uncharted route, over hills and peaks ranging from 15000 feet to 24000 feet, Mehar Singh flew the first Dakota to Leh and landed it at the highest airstrip in the world. The faith in this man was re-imposed by none other than the commander of land forces in the Srinagar Valley sector, Major General K.S. Thimmayya, DSO, who accompanied Mehar Singh on the pioneering flight.\n\nMehar Singh also undertook the conversion of Dakotas into bombers. The Dakotas were modified to carry 500 lbs. bombs in their cargo bay and the cargo handlers were trained to roll out the bombs out of the door onto targets below.\n\nThings were not fine, however, though fighting the war was taking up most of Mehar Singh's time, there was also an undercurrent of resentment building up inside him. Mehar felt that the recognition due to him in the air force was not given, and added to the fact that he did not get along with some of his senior officers in the air force, Mehar decided to put his papers in August 1948. The Defence Minister, Sardar Baldev Singh, relieved Mehar Singh in September. Thus ended Mehar's association with the service he loved.\n\nBut he still carried on the profession he loved...flying. Mehar Singh moved onto civilian flying. He returned to the spotlight for a brief moment in 1950, when he recieved the Maha Vir Chakra (MVC) from a grateful nation, when the gallantry awards were instituted.\n\n As the senior most officer, Mehar Singh received the first Maha Vir Chakra to the Indian Air Force. Therafter, Mehar went back to flying Dakotas and transports, becoming the personal pilot of the Maharaja of Patiala.\n\nIndian Aviation suffered one of its most tragic losses on 11 March 1952, when Air Commodore (retd.) Mehar Singh, MVC, DSO, was killed in an civilian air crash. Thus, in a violent end, was cut short the life of a legend."
  },{
    "id": "1030",
    "name": "Major	Satyapal Chopra",
    "title": "1948",
    "operation": "Operation Polo-Hyderabad",
    "url": "",
    "moredescription": "\n\nReference: Facebook ADGPI-Indian Army",
    "description": "Maratha Light Infantry",
    "description1": "Service : Indian Army",
    "description2": "Born: 12th November 1922\n",
    "description3": "\n    On 15 march 1948, Major Satyapal Chopra while commanding a company during the advance on Jhangar,came under heavy fire of four machine guns and six light automatics.\n\n The hostiles lay strongly entrenched on Pir Thal Nakka, a formidable hill feature. Major Chopra rushed forward with a platoon and gave his troops covering fire. Despite being wounded, he led the operation. In the process of evacuating his men, he was mortally wounded. Major Satyapal Chopra made the supreme sacrifice saving the lives of his comrades and displayed leadership qualities and devotion to duty of the highest order.\n\n He was awarded the MahaVirChakra Posthumously"
  },{
    "id": "1031",
    "name": "Major Chewang Rinchen",
    "title": "1947",
    "operation": "Indo Pak Kashmir War",
    "url": "http://www.bharat-rakshak.com/ARMY/Galleries/1618-5/Arul05.jpg",
    "moredescription": "\n\nReference: This write-up is based on the contents of a book 'Hero and Their Deeds'",
    "description": "Nubra Guard and Ladakh Scouts",
    "description1": "Service : Indian Army",
    "description2": "Born in 1931\n",
    "description3": "\n    As a young lad of 17 Chewang Rinchen* enrolled himself in the Ladakh Guards on 25 July 1948. With hardly a week’s training he organised and trained a local militia unit of 28 youths. In September, operating alongside Indian Army units, he fought in the Nubra Valley.\n\n His grim defence of a position on the Kharu Nullah earned him promotion to the rank of Jemadar (Naib Subedar).\n\n In the same month, negotiating a 17,000 feet high snow clad pass under most trying conditions, he helped the capture of Lama House, a vital enemy stronghold.\n\nOn 15 December, having marched for three days over high snowdrifts, he put in a fierce attack on a high hill feature near Biagdangdo and captured it.\n\n This action was immediately followed by his capture of Tukkar Hill, the last enemy position in Leh tehsil.\n\n This last action involved crossing over snow clad hills 21,000 feet high. Half of his platoon was suffering from frostbite. But under his inspiring leadership and following his example of personal bravery, his men had accomplished a seemingly impossible feat. He was then promoted Subedar.\n\n In these actions, Subedar Chewang Rinchen displayed personal bravery, resourcefulness, leadership and dedication of duty of a high order."
  },{
    "id": "1032",
    "name": "Lt Colonel	Dewan Ranjit Rai",
    "title": "1947",
    "operation": "Indo Pak Kashmir War",
    "url": "https://pbs.twimg.com/media/CSUkmLyVEAAks9W.jpg",
    "moredescription": "\n\noneindiaonepeople.com",
    "description": "5th battalion, 11th Sikh Regiment",
    "description1": "Service : Indian Army",
    "description2": "Born : 6 February 1913\n",
    "description3": "\n    The only unit in Delhi then was 1 Madras. It was considered inappropriate to send it as its commanding officer (CO) was an English man. Instead, 1 Sikh was detailed for the task. The unit was deployed all over Gurgaon for internal security duties and only by late evening of 26 October, battalion HQ with two companies could be assembled at Delhi airport. Major (later Lt General) S. K. Sinha of HQ Delhi and East Punjab Command came to the airport. Latest information of the raiders was not available. Even the information of strength and location of state troops available was as known 36 hours earlier.\n\nThe status of Srinagar airfield was not clear. The instructions were to return to Jammu if the Srinagar airfield had been run over. \n\nBattalion HQ and two companies took off in Dakota aircrafts at 5.30 a.m. on 27th morning and landed at Srinagar at 9.30 a.m.\n\n Immediately on landing, Rai realised that it was imperative to hold and oppose the enemy as far away from the airfield as possible. He planned a series of delaying actions to gain time for additional troops to arrive. Rai sent one company under Captain Kamaljit Singh to Baramula in whatever transport he could get. The other company under Major Harwant Singh MC carried out a flag march in Srinagar city to build up the confidence amongst the people.\n\nKamaljit saw smoke columns rising in Baramula town and realised that it had fallen to the raiders. It was ransacked by the raiders on 26 October. \n\nThey could have easily reached Srinagar before the arrival of Indian troops if they had not wasted two days in plunder.\n\n Kamaljit took up defences at Mile 32. He had no mines or defence stores, and only a few digging tools. After the flag march, Harwant deployed one platoon each at air field and Sopore Bridge over Jhelum and joined Kamaljit at Mile 32 in the early hours of 28 October. Col. Rai waited at the air field for the remaining unit. He had no communication with his companies as the aircraft carrying the equipment had developed a snag and was diverted to Jammu.\n\n He gave instructions for the remaining companies to move to Mile 32 and went there himself. He sent a message to Army HQ to send more troops.\n\n The two remaining companies had also reached and Rai went forward next morning to deploy them.\n\nAt about 11.30 a.m., a large number of enemy troops supported by machine gun and mortar fire attacked the 1 Sikh position. \n\nBitter fighting ensued and the attack was repulsed. The enemy started an outflanking move and cut off the 1 Sikh position from the rear.\n\n Rai decided to move the unit to a position 8 km nearer to Srinagar. He ordered his unit to withdraw to the new position, which they did with skill and in good order. While seeing the last of the rearguard, a stray bullet hit Rai in the head and he was killed instantaneously.\n\n A gallant son of India fell. He was awarded MVC (posthumous) and was the first recipient of this award. He was also the first officer to lay down his life for the motherland after Independence. "
  }
  ,{
      "id": "1033",
      "name": "Brigadier (Later General) Raina, Tapishwar Narayan",
      "title": "1962 ",
      "operation": "Operation Leg Horn",
      "url": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Gen_T_N_Raina.jpg",
      "moredescription": "\n\nReferences: indianarmy.gov.in\n              en.wikipedia.org",
      "description": "Unit: Kumaon Regiment",
      "description1": "Service : British Indian Army & Indian Army",
      "description2": "Born in 1921\n",
      "description3": "\n    Brigadier TN Raina took over the command of an infantry brigade just before the Chinese invasion.\n\n The Brigade at that time was responsible for defence.\n\n It was October 1962, he moved at very short notice and strengthened the defences there.\n\n Within a short time, with his determination and boundless energy, he organized the brigade and raised it to a state of remarkable preparedness.\n\nDuring the battle, he visited the forward posts in complete disregard of his personal safety, directed the operations and adjusted the defences effectively.\n\n When a locality was lost, he organized a systematic withdrawal of troops who would have been cut off, thus saving valuable men and material from falling into enemy hands.\n\nBy the morning next day, he had readjusted his defences and was once again ready to repulse any enemy onslaught.\n\n Brigadier Raina showed commendable devotion to duty, conspicuous courage and exemplary leadership in handling his brigade."
    }
  ,{
      "id": "1034",
      "name": "Lieutenant Colonel Dharam Singh",
      "title": "1948",
      "operation": "Operation Polo-Hyderabad",
      "url": "not found",
      "moredescription": "\n\nReferences: indianarmy.gov.in",
      "description": " ",
      "description1": "Service : Indian Army",
      "description2": "Born : 10th July, 1910(Haryana)",
      "description3": "\n    In a night of November 1948,during the attack on a feature, Lt Colonel Dharam Singh led his battalion extremely well over a difficult country side and against a determined enemy.\n\nThe whole operation was called the 'Second Punch link-up against the Pakistani raiders'.\n\nTo capture the feature, he fought five actions in pitch darkness without  artillery support. This officer was always with his forward company and did not care for his personal safety.\n\n His conduct in carrying out this attack was an inspiration to all his men, which eventually led to the capture of the feature at dawn.\n\n But for his personal bravery, initiative and strong leadership this attack would not have succeeded jeopardizing the entire operation.\n\n For his gallantry he received the Maha Vir Chakra (MVC) on 8th November, 1948."
    }
  ,{
      "id": "1035",
      "name": "Sepoy Man Singh",
      "title": "1947",
      "operation": "Indo Pak Kashmir War",
      "url": "not found",
      "moredescription": "\n\nReferences: indianarmy.gov.in",
      "description": "",
      "description1": "Service : Indian Army",
      "description2": "  Born - 12 April 1926-Rohtak(Haryana)",
      "description3": "\n    During January 1948, Sepoy Man Singh was in a picket in Poonch in Jammu & Kashmir Sector when it was very strongly attacked by the enemy more than two hundred strong.\n\n His platoon was holding the front sector of the key defensive position. They approached close to the picquet perimeter covered by their six Light Machine Guns and grenade discharges firing very heavily from a distance of about 400 yards.\n\n  Sepoy Man Singh's platoon had suffered about 50 percent casualties and enemy was going to rush in at any moment.\n\nSepoy Man Singh, on his own initiative, came out of his slit trench and ran forward engaging the enemy with grenades and eventually succeeded in silencing two of the enemy Light Machine Guns.\n\n In the meantime, a burst of Light Machine Gun fire hit him on his head. In spite of the mortal wound sustained by him, he fired another grenade saying, \n\n\"I 'm finished but I will finish you too\", \nand thus smashed another enemy Light Machine Gun with its accompanying numbers.\n\n This gallant action of Sepoy Man Singh at the cost of his own life, which set an example of bravery and devotion to duty, saved a terrible loss of lives to his company and helped in protection of Poonch Garrison. "
    }
  ,{
      "id": "1036",
      "name": "Sepoy Dewan Singh",
      "title": "1947",
      "operation": "Indo Pak Kashmir War",
      "url": "http://2.bp.blogspot.com/-G3Jwpgfn84o/UtIo9hATyDI/AAAAAAAAAIY/S7_kvDTo0B0/s1600/Khushal_Chand_MVC.jpg",
      "moredescription": "\n\nReferences: indianarmy.gov.in",
      "description": "",
      "description1": "Service : Indian Army",
      "description2": "14 July 1923-Purdam,Pithoragarh\n",
      "description3": "\n    During November 1947 at Srinagar in Kashmir, during an action at Badgam, against  the  Tribesmen   Sepoy Dewan  Singh was No 1 Bren Gunner his Section.\n\nThe Tribesmen were advancing in an over-whelming majority and his Platoon position was being swept away by enemy Light Machine Gun fire.\n\n The odds were such that the platoon commander was ordered to withdraw his Platoon from the position.\n\n  The enemy by now had reached very near. On seeing this Sepoy Dewan Singh picked up his Bren gun and commenced firing from his hip with great accuracy and speed and was himself responsible for accounting at least 15 casualties on the enemy thereby repulsing the enemy advance and allowing the other personnel of his Platoon to withdraw.\n\nWhile thus firing at the enemy, he was severely wounded on the shoulder but this was not sufficient to make this Sepoy leave his position.\n\n The enemy now finding that the remainder of the Platoon had withdrawn and that this was lonely Bren gun firing being manned by one man, started concentrating on his post.\n\n But Sepoy Dewan Singh would not leave his Bren gun  till he himself got a burst of Bren gun on his chest and died.\n\nThis sepoy with complete disregard for his own life and through his example of determined and heroic offensive action undoubtedly saved not only his Section but the whole of the remaining Platoon personnel from being completely overrun.\n\n His courage, gallantry and devotion to duty is an example to other soldiers. For this heroic action, Sepoy Dewan Singh was awarded MAHAVIR CHAKRA."
    },{
      "id": "1037",
      "name": "Major Malkiat Singh Brar",
      "title": "1948",
      "operation": "Operation Polo, Hyderabad",
      "url": "not found",
      "moredescription": "\n\nReferences: indianarmy.gov.in",
      "description": "",
      "description1": "Service : Indian Army",
      "description2": "15 Aug 1918(Pune)\n",
      "description3": "\n    It was February 1948 at Poonch, Major MS Brar was commanding a Company of his Battalion which captured an important hill feature against heavy opposition.\n\n With daybreak, the enemy launched a determined counter-attack at about 1030 hours.The forward platoon post had suffered heavy casualties and there were only two men capable of fighting.\n\n Major Brar ran with a Bren gun to the forward post with utter disregard for his personal safety and fired from the hip at the advancing enemy from point-blank range.\n\n His fire stopped the hostiles who ran back and took cover behind the rocks.\n\n Thus Maj Brar's gallantry saved the forward platoon from being over-run.Then despite his wounds, Major Brar personally evacuated most of his casualties under very heavy enemy automatic fire.\n\n He went round all the forward posts and collected two Bren guns and five rifles belonging to the dead.\n\n In spite of the orders to stop he went on supervising the evacuation of the Company's casualties, when a 3-inch mortar bomb landed close to him and wounded him mortally.\n\n Major Brar was killed on the spot saying, \n\n\"well done Company. Get down, I am all right\".\n Personal bravery of a higher type has rarely been seen.\n\nFor his personal act of bravery and command of  his troops, Major Brar was awarded MAHAVIR CHAKRA."
    }

  ]
}