{
  "heros": [{
    "id": "1001",
    "name": "Major Somnath Sharma",
    "title": "1947",
    "operation": "Battle of Badgam",
    "url": "http://www.thebetterindia.com/wp-content/uploads/2016/11/120.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "4th Battalion, Kumaon Regiment",
    "description1":"Service: British Indian Army,Indian Army",
    "description2":"Born: 31 January 1923\n",
    "description3": "\n\nBadgam, Jammu and Kashmir\n\n3 November 1947\n\n Resting his plastered left arm on the edge of the trench, Major Somnath Sharma raises his head and squints at the sun; it has moved west but there are still a few hours of daylight left.\n\n He has to move his company soon and if they make good time, they can be back at the Srinagar air-field by night.\n\n It has been a tense and gruelling morning, but now he is feeling quite relaxed.\n\n  At first light that day, a fighting patrol comprising A and D Companies of 4 Kumaon (under Somi) and one company of 1 Para Kumaon (under Captain Ronald Wood) had been sent to Badgam after intelligence reports had warned that a 1000-strong lashkar of Pathans, led by Pakistan Army regulars, was heading towards Srinagar.\n\n Their aim, the reports had said, was to take over Srinagar air-field and thus handicap the Army by cutting of their supplies.\n\n The fighting patrol's job had been to search for the raiders and engage them at Badgam, a small village three to four miles from the Srinagar air-field.\n\n  Each morning, Sharma had reported that his company was positioned on a hillock west of the village and that they had dug trenches there.\n\n 1 Para Kumaon had established themselves south east of the village and had reported that the village was quiet and peaceful Sharma had also reported that the villagers had been going about their chores quietly though they looked scared.\n\n He has also noticed that some of them were clustered in a nala where they seemed to be taking shelter.\n\n Since Badgam appeared peaceful, 1 Para Kumaon was ordered to ‘circle east and search; and then return to the air-field after making contact with 1 Punjab'.\n\n They did so, and were back in Srinagar by 1 p. m. Since Badgam is quiet, Sharma is also ordered to start pulling his companies out.\n\n At 2p.m. he reports that A Company, which had been ordered to circle to the west, had done so and was also on its way to the air-field.\n\n Somi plans to keep D Company in Badgam till late evening and then withdraw to the airfield. His decision is supported by Brig. L.P. Sen, DSO. The two know each other well from battles in the Arakan in 1944-45.\n\n The soldiers are just biding time since there are only a few hours to go.\n\n  The lashkar was arriving in Badgam in bits and pieces to conceal their movement and it was led by a Pakistani major, who was hatching a crafty plan even as he watched the soldiers of the Indian Army patrolling the village.\n\n He had asked his men to mix with the locals and wait for the rest of the Pathan's, who were quietly making their way to Badgarn after slowly trooping in through the gap between the ranges at Gulmarg, He planned to attack Badgam when they reached a count of around 1000 men and then advance to the Srinagar airlield.\n\n Pakistan’s plan was to attack the airfield, cut off the Army's access and then takeover Jammu and Kashmir.\n\n ‘It was a great plan.’ the general acknowledges grudgingly Around 2 p.m., well after A Company left Badgam, the villagers grouped in the nala began to disperse. While Sharma and his men thought they were returning to their homes, they were quietly positioning themselves around D Company.\n\n The Pakistani major had decided not to wait beyond afternoon and as soon as he had about 700 men, he launched his attack. Sharma and his company, consisting of about 90 men. were the only ones left to fight the raiders. They were outnumbered seven to one.\n\n Wrinkling his forehead in an effort to rememember, Lieutenant General Sharma says it was around 2.30 p.m. that Somi and his men were taken by surprise when gunfire Started coming at them from the village.\n\n Soon, they were receiving machine-gun fire as well.\n\n Somi reported to is brigade commander that his position was under attack.\n\n He added that he was apprehensive about returning fire in the direction of the village because he could hurt innocent people including women and children By then, the raiders had started coming up in large numbers from a depression in the west.\n\n 'There were hundreds of them, and they started targeting Somi’s company with mortar and automatic fire,’ says Lieutenant General Sharma.\n\n ‘Since the Pathans were nor trained soldiers, every 100 men were commanded by a Viceroy’s Commissioned Officer (VCO) while every 10 men had a regular Pakistani Army soldier with them who inspired them to fight. '\n\n  LieutenantGeneral Sharma says he heard from soldiers of 4 Kumaon who returned alive from the battle how Somi encouraged his men to retaliate and, completely unmindful of his own safety, rushed from one trench to another urging them to fight back bravely .\n\n Such was the grit and determination of the men that the first few attacks, which came from different directions, were successfully repulsed.\n\n The Pathans, however, drew strength from sheer numbers and began to increase the pressure.\n\n Soon they had surrounded D Company from three sides and started climbing up the hillock where the trenches were.\n\n They came in hordes, brandishing automatics and shouting ‘Allah ho Akbar!’ .\n\n  Somi knew he was outnumbered. He called the brigade commander and asked for ammunition and reinforcements. He was told that 1 Punjab was being sent for their support but Somi realized they would take time to get there since they had to move in battle formation.\n\n He also understood how important it was to hold back the enemy till reinforcements could be sent to close the gap leading to Srinagar. If that was nor done, the raiders could advance right up to the airfield and take over Srinagar.\n\n  Somi decided to hold back tenaciously and urged his men to light to the last. It is to their credit that they did, despite the fact that they were completely outnumbered and their .303rifles were no match for the enemy’s medium machine guns.\n\n ‘Somi knew his company would nor be able to hold out for long but he did not let his men lose confidence. With complete disregard for his own safety, he rushed across the open ground in full of the enemy and went about encouraging his men.\n\n When the heavy casualties started affecting the men manning the light machine guns, Somi himself went around, using his good hand-his left arm was in plaster-to fill magazines and hand these over to the light machine gunners.\n\n He would tell them when and where to fire.\n\n \"Idhar maro, udhar maro,” he would say, and the battle raged for almost five hours,' the general tells me.\n\n'That was precious time for the Indian Army, since the raiders were being delayed and they were getting time to plug the gaps as they built up strength with Indian Air Force planes flying in more troops.’\n\n Eventually, the men started running out of ammunition. When Somi informed brigade headquarters (HQ) about this. he was asked to pull back.\n\n He refused outright. \"The enemy is only 50 yards from us. We are heavily outnumbered. We are under devastating fire.\n\n I shall not withdraw an inch but will fight to the last man and the last round ,' was his last message to the HQ.\n\n Just a few minutes later, while he was crouched in a trench next to the Bren gunner, helping him load the gun, a mortar shell landed on the open ammunition box next to them.An eardrum-shattering blast rent the air.\n\n ‘It blew up Somi, his sahayak (an officer’s helper or man Friday who looks after his uniform and turnout). the machine gunner and a JCO, whowas standing nearby,' recounts Lieutenant General Sharma, his voice gentle.\n\n  For Somi, who had insisted upon leading his company to Kashmir despite having his arm in plaster, it was all over.\n\n But it is considered a credit to his leadership that the men under his command kept his word. The non-commissioned officers (NCOs) of the company decided to fight on, they managed to hold back the raiders for another hour even after Somi had died.\n\n In fact, as the ammunition became desperately short, another hero emerged. Lieutenant General Sharma talks with great respect about Lance Naik Balwant Singh of D Company, who took a brave initiative when most of the soldiers were left with just one round or two.\n\n ‘He asked them to collect whatever rounds were left with them and hand those over to him. He then loaded his gun with these two or three magazines and told the rest of the men to retreat while he held up the enemy.\n\n “There is no point in everybody dying,” he said. “I will hold them back for the few minutes you need to disappear into the fields.\"\n\n  ‘So he and three others stayed back to battle the raiders while the rest left the hillock from the back. Shooting the last of their rounds, these four bravehearts got out of their trenches and charged at the enemy.\n\nThey were killed but they helped their comrades survive,’ recalls the general.\n\n  Overall, the brave action of D Company resulted in the raiders being delayed by close to six hours by which time the Indian Army had managed to get into position and block the enemy advance to Srinagar airfield.\n\n As aircrafts continued to fly in with more and more soldiers, the air-field defence had become strong enough to Stop any attack.\n\n  On the morning of 5 November, Badgam was counter attacked by the Indian Army and captured. The bodies of 300 raiders were counted, which proved just how ruthless the fight had been.\n\n The retaliatory fire had been so harsh that the Pathans had not been able to pick up their dead. Since they were not trained soldiers, they were not used to losing men in such a big way.\n\n The big losses broke their resolve and they started pulling back. When the Army took over Badgam, they found the Pakistanis retreating.\n\n ‘When a man’s will is broken, he cannot fight,’ says Lieutenant General Sharma.\n\n  In the battle of Badgam, 4 Kumaon lost Major Somnath Sharma, Subedar Prem Singh Mehta and 20 other ranks. Twenty-six people were wounded in the operation. For his gallantry, tenacious defence and exemplary leadership that inspired his men to fight the enemy, in spite of being outnumbered seven to one, Major Somnath Shanna was awarded the Param Vir Chakra (PVC) posthumously. It was the first PVC of independent India."
  }, {
    "id": "1002",
    "name": "Lance Naik Karam Singh",
    "title": "1948",
    "operation": "Indo-Pakistani War",
    "url": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Lance_Naik_Karam_Singh.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 1 SIKH",
    "description1":"Service: British Indian Army,Indian Army",
    "description2":"Born: 15 September 1915\n",
    "description3":"\n\nRichhmar Gali,\n\nKashmir 13 October 1948\n\n The Sikh soldier peering out of the trench looks worried.\n\n ‘Dushman nedhe si. Assi tinn see, tey chautha tu---hun kee kariye?’ (The enemy has come close. We are just three, and you are the fourth---what do we do?) he whispers to his section commander Lance Naik Karam Singh, who is standing beside him, still and ramrod straight.\n\n Karam Singh is a handsome Sikh, more than six feet tall. A proud upturned moustache and dark beard lend him a dark, brooding appearance.\n\n He is holding a .303 rifle. His trousers are soaked with blood from the injuries he has been subjected to in the earlier gunfight.\n\n He and his men have been able to beat back the first attack from the Pakistanis, but the enemy is back with renewed vigour.\n\n Karam Singh does not answer. His eyes are narrowed in concentration. He is watching the armed Pakistani soldiers advancing towards his outpost.\n\n There are just four men in his section and they have already been under intense shelling.\n\n All of them are bleeding 190m bullet as well as splintering rock hits from continuous artillery shelling by the enemy.\n\n  He looks at the gun is in his hands but he knows there are too many of them for gunfire to be effective.\n\n Besides, he is running short of ammunition and since there is continuous shelling there is no way to get more from the main company position, which is hit behind.\n\n The enemy soldiers have come closer.\n\n  Karam Singh reaches into his backpack and, pulling out a grenade, bites the pin of with his teeth. Swinging his arm in a wide half-circle he dings it at them with the war cry of\n\n 'Jo bole so nihal, sat Sri Akaal’.\n\n The physical strain of the muscle movement runs right down to his leg and he winces in pain, but he does not take his eyes of the arc of the grenade flying through the air.\n\n It lands right in the path of the first row of advancing soldiers and a loud blast echoes through Richhmar Gali.\n\n Some of the men fall, screaming in pain; the others have lost their composure.\n\n It is only then that Karam Singh turns to look at the tense, mud-stainedfaces of his tired and injured comrades and smiles.\n\n'Jadon assi ithe jaan de dange tan saddi keemat wadh jaavegi, ’ (If we die fighting, we will always be remembered he says, his voice firm.' Sade piche bathere ne ladanwaale.\n\n Saari company sade piche hai '.(There are many who will continue the fight after we die) With that, he rummages in his backpack for another grenade, removes the pin and tosses it at those of the enemy soldiers who are still advancing.\n\n Another deadly blast rents the air.\n\n He and his men were heavily outnumbered at one to ten; three of them had already sustained serious injuries and they were also running out of ammunition.\n\n In the intense artillery shelling and mortar fire that was coming from the enemy there was no hope of ammunition being brought to them from the main comme position either.\n\n He decided to rejoin the main company, but insisted on carrying along his two badly wounded comrades.\n\n  Without a thought for his own safety or injuries, he pulled out the two wounded men with the help of the fourth soldier, who was the only one left unharmed.\n\n Putting their lives on hold, the two of them dragged the injured men through the intense enemy shelling and managed to get them back to the main company bunkers.\n\n Around 10 a.m., the enemy launched another attack. this time on the company position. Without a thought for his grievous injuries, Karam Singh went about lighting from the frontline trenches.\n\n He held on even when the enemy mortar lire and shelling managed to destroy almost every single bunker of the platoon.\n\n Moving from bunker to bunker, he implored his tired men to continue being brave; to light like proud Khalsa warriors.\n\n He helped in getting the wounded out and encouraged the uninjured to fight back without fear.\n\n He did not let the morale of the soldiers sag though the day when the enemy launched one attack after another.\n\n During one of these attacks, Karam Singh was injured yet again, but he kept his faith and, despite the depleting strength of the company, continued the fight.\n\n In the next attack that came around 1 p.m., Karam Singh immortalized himself in the war records of his paltan (unit) by another exemplary act of bravery.\n\nFifth Pakistani attack, 1 p.m.\n\nThe Pakistani soldiers have launched a fifth attack. There has been no respite since 6 a.m. and the tiredness as well as the strain of his injury is bogging Karam Singh down.\n\n He grits his teeth to bear the pain and trains his gun on the enemy soldiers moving forward through the grenade smoke.\n\n He finds that two of them have sprinted the final few yards and are now right in front of his trench, brandishing their rifles. They are too close to be shot without hurting his own men.\n\n Without hesitating for a second Karam Singh fixes the bayonet on to his rifle and leaps out of the trench.\n\nLiffting the bayonet in the air with a blood-curdling war cry he shoves it right inside the chest of the Pakistani soldier in front of him. Before the shocked man can realize what has happened the hefty Sikh has struck again.\n\n ‘Ghonp nikal, ghonp nikal', Karam Singh mumbles under his breath, remembering the trill taught to him by his ustad (instructor), at the centre.\n\n The enemy soldier lies dead before him, horror writ large in his open eyes. Pulling the bayonet out of his body Karam Singh pulls it back as far as his arms can go and in a split second brings it forward again with force, pushing it into the stomach of the next man, who is trying to shoot.\n\n A fountain of red springs fourth as the lethal blade cuts into the man's skin and intestines, making him double up and collapse in pain and terror.\n\nKaram Singh pulls his bayonet out, and lifting his arm right over his head, pushes it into the fallen man once again relieving him ofall pain forever.\n\n He jumps back into the trench before his comrades can even fathom what has happened.\n\n  Shocked by this savage attack and the coldblooded killings by the hefty Sikh warrior, the enemy soldiers retreat one more time.\n\n They do not give up though and keep returning despite being beaten back each time by the strong defence put up by the company.\n\n It is 7p. m. when the enemy's will is finally broken and they give up. By then, they have launched eight attacks on Karam Singh company; all of which had been repulsed by the Sikhs. \n\nThey have fired 3,000 shells, which have taken a heavy toll and destroyed almost all the A Company bunkers but have not been able to break the spirit of the men.\n\n 1 Sikh lose 10 men and have 37 wounded during the battle, which is later described by division commander Major General KS. Thimayya, DSO as a ‘uniquely magnificent fight’.\n\n Lance Naik Karam Singh MM is awarded the Param Vir Chakra (PVC) for his devotion to duty and brave beyond comparison. He is the first soldier to receive it live."

  }, {
    "id": "1003",
    "name": "Second Lieutenant Rama Raghoba Rane",
    "title": "1948",
    "operation": "Indo-Pakistani War",
    "url": "http://2.bp.blogspot.com/_sPt34uCgjSU/SlfbdJhU7jI/AAAAAAAACEY/adgEiIHNxlM/s320/2)+2nd+Lt.+Rama+Raghoba+Rane,+Corps+of+Engineers.JPG",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: Bombay Sappers",
    "description1":"Service: Indian Army",
    "description2":"Born: June 26, 1918\n",
    "description3":"\n\nJammu and Kashmir\n\nApril 1948\n\n  Rama Raghoha Rane is on his stomach and crawling under a Stuart tank that is slowly making its way across a minefield. \n\nHe is trying to do it at a pace that matches the speed of the tank that is moving above him. His leg, badly slashed from exploding mortar, hurts with any movement hut he ignores the pain, concentrating instead on the massive wheels that are turning with a deep rumble that is reverherating in his ears. \n\nRane holds in both his hands thick ropes that are attached to the tank. He is using them as a signal for the tank to stop or move .\n\nEach time he spots a mine ahead, he pulls-the rope in his right hand and tie tank stops. After he has cleared the mine, he pulls the rope in his left hand and the tank starts moving again.\n\n The armoured vehicles are part of a plan to attack Rajouri and stop the Pakistani raiders, who are intent on carnage, rape and loot.\n\n Since every second means a diference between life and death for innocent locals, speed is of the essence and the Indian Army must get there as fast as it can.\n\n  Rane has devised this method of moving in the minefield under cover of a tank since the area is under constant enemy machine gunfire and his mine-clearing section is not able to work otherwise.\n\n  He spots a telltale, circular depression that means there is an anti-tank mine lying underneath. He tugs on the rope in his right hand. Above him the tank grinds to a stop.\n\n Using the fingers of both his mud-streaked calloused hands, Rane scrapes the stones and rubble from around the mine.\n\n He then gently removes the cover and reaches in to deactivate the fuse. Putting the lid back on again he closes his eyes for a fraction of a second and heaves a sigh of relief .\n\n He then tugs the rope in his left hand and starts crawling again.\n\n  Advance to Rajouri\n\n  It is 6 a.m. on a sunny April day when Rama Raghoba Rane and his section are put on mine-clearing duty starting from Nadpur South Fort area, near Naushera. Their task is to create a safe passage for tanks so that they can move fom Naushera to Rajouri, where the raiders are attacking the civilian population.\n\n  After the recapture of Jhangar, the Pakistani army flees, has not before completely destroying the national highway from Rojouri to Punj.\n\n With no other way to reach Rajouri the Indian troops are ordered to create their own route till Chingas, which is an old Mughal passage to Kashmir.\n\n 2nd Lieutenant Rane and his section of 37 Assault Field Company are attached to 4 Dogra, which starts the advance to Rajouri on 8 April 1948, with an attack on Barwali ridge, 11 km north of Naushera.\n\n They drive out the enemy and capture Barwali ridge by 4.30 p. m. but cannot go beyond because not only is the area hilly, there are give road blocks and mine fields on the road.\n\n This is when Rane and is small team of Sappers are pressed into action. They start clearing the road blocks, but it gets dark soon and they are surprised by enemy fire.\n\n The Pakistanis have returned and are launching mortar hursts at the men trying to clear the road. In a stroke of had luck, Rane loses four of his men.\n\n Sappers Abaji More and Raghunath More are killed; Sappers Sitaram Sutar and Keshav Amhre are hadly wounded and later die in hospital, while a splinter hits Lance Naik MK. Jadhav in the spine, paralysing him for life.\n\n Rane also gets a deep cutfrom a splinter that slashes his thigh hut he refuses to he evacuated despite the heavy hleedingfrom his leg and asks only for first aid.\n\n  The bulldozer operator does not hear the enemy fire since his own dozer is making so much noise and has to he pulled out and evacuated.\n\n Though the Pakistanis are chased off again, plans to clear the road block at night are dropped.\n\n Rane returns at dawn the next day to start clearing the landslide again. By 10 a. m., he has managed to clear the road block ant the tanks move ahead. It soon run into another landslide that is again cleared by Rane 3 p.m.\n\n The procedure continues, with Rane hitching a ride on the tanks; each time there is a hindrance in the path, he quickly dismounts along with his men and they work on clearing the track.\n\n They encounter fallen trees that have to be blown up, a culvert that has been damaged so badly that a new path has to be made and continuous enemy fire that has to be dodged.\n\nThis continues till dusk when the tanks are halted and the men quickly dig trenches for themselves and take cover for the night.\n\n Around 4.45 a.m. the next day Rane is back on the job. Despite  great risk to his life, he continues to clear road blocks and minefields, helping the tanks move ahead.\n\n Slowly and steadily, they make a path for the advancing troop of tanks, and reach Chingas at 2p.m.\n\n Rane keeps working till 9 p. m. to open the road completely.\n\n Finally, at 11 a. m. the next day, the road is thrown open to all vehicles but the men soon discover that the road from Chingas has even worse road blocks. Since reports of the massacres in Rajouri are reaching the Army, a decision is taken for the rest of Ranes unit to work at clearing the road from Chingas, while he and his platoon make a path for the tanks along the bed of the river 72m all the way to Rajouri.\n\n The men get to work again, blowing up the big boulders along the riverside. The river follows an undulating course and often the tanks have to get in and out of water.\n\n Sometimes, they get stuck and have to be pulled out.\n\n On 11 April, they halt again and finally, on 12 April at 6 p. m., the tanks reach Rajouri.\n\n Rane has worked without any rest all these days and itis a miracle that he has managed to get the men of 1 Kumaon and the tanks there.\n\n  Once the men reach Rajouri, the find it is a ghost town. They cross two blood-soaked pits of bodies, including those of women and children who have been massacred by the raiders.\n\n The arrival of the Army ends the violence and soon refugees start returning to their villages. The engineers are awarded the battle honour of Rajouri and Rane the Param Vir Chakra for his devotion to duty courage and gallantry."
  }, {
    "id": "1004",
    "name": "Naik Jadunath Singh",
    "title": "1948",
    "operation": "Indo-Pakistani War",
    "url": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Naik_Jadu_Nath_Singh.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "1st Battalion, Rajput Regiment",
    "description1":"Service: British Indian Army,Indian Army",
    "description2":"Born: 21 November 1916\n",
    "description3":"\n\nTain Dhar, Kashmir\n\n6 February 1948\n\n Dawn has not broken, but all signs indicate it is going to be a cold and grey February morning. There is fast on the grass, masking the green with translucent white fluff .\n\n A swirling mist swept in through the night and a dense fog still hangs over the slopes of Thin Dhar Ridge, where the ten men of 9 Platoon, C Company of 1 Rajput battalion, sit guarding picket Number 2.\n\n They have just finished making tea in silence and are now, over steaming enamel mugs of the milk powder-sweetened brew, exchanging their concerns with each other in hoarse whispers, their voices still gruf from another endless, stressful night.\n\n The orders for them had been to had been the picket , which lies on the shoulder of the Tain Dhar range, against an enemy attack and they have been holding fort sincerely, though it has been peaceful so far.\n\n Intelligence reports have repeatedly hinted that Pakistani raiders out to take over Kashmir would be heading for Naushera, and Tain Dhar falls on the way which is why the men have been placed there.\n\n Every day and every night, the soldiers waited for an attack, but there have been none, even though excessive enemy build up had been reported in the areas around.\n\n Shivering in their trenches in the brutal cold of Kashmir that morning, the ten men do not know that today is going to be the day. \n\nThousands of Pakistani raiders have crept up on their tiny post in the darkness of the night and are just waiting for daybreak to attack.\n\n 6 February 1948\n\n It was dawn and a weak orange sun was slowly lighting up the horizon. Looking into the distance Yadunath noticed moving specks that appeared to be coming closer.\n\n The fog was hampering his vision and he wasn’t sure if it was just an illusion of the mind so he nudged the soldier standing next to him and they bath watched in quiet concentration.\n\n Jadunath had not been mistaken. The Pakistani raiders were here and, even as his eyes adjusted to the translucent haze, he noticed that they were slowly coming closer.\n\n The time for battle had come. As Yadunath’s eyes darted from one speck to anorher, he realized that there were hundreds of them; fully armed and striding across the vegetation.\n\n A cold shiver ran down his spine. He had only nine soldiers with him. The enemy had surrounded them in numbers he didn't men count.\n\n He and his men had only choices.\n\n To surrender or fight till the last man. He knew what he was going to do.\n\n  Even as Jadunath and his men watched from their trenches, the specks in the distance turned into the bearded, sunbumt faces of Pakistani raiders and Pathans.\n\n Guns in hand they were now emerging one after the other from the thickets and behind rocks and boulders.\n\n The moment they were within firing distance, the started shooring, and soon the surrounding hills rang with the sound of machine-gun mortar fire. The raiders had a mad ferocity about them.\n\n They had been promised wealth and women. Some of their comrades had already returned home with the booty and the women they had abducred after raiding border villages and the others were looking forward to the , same experience.\n\n They had not expecred the Indian Army to come to Kashmir’s aid, but they were prepared for battle and they knew the Indian soldiers were heavily outnumbered.\n\nJadunath shouted to his men to take position and together the ten brave men directed their light machine guns at the first wave of attackers.\n\nCries of 'Allah hu  Akbar’ rang out as the two warring sections met. As soon as an enemy soldier fell dead, two more would take his place. The men came like a swarm of locusts.\n\n In hundreds. One after anorher. They made their way to the picket in droves, shooting continuously.\n\nJadunath and his men started flinging hand grenades at them but despite that some of the raiders managed to enter the trenches. Bloody hand-to-hand combat followed with clashing bayonets glistening in the morning sun.\n\n The first wave of raiders was eventually beaten back, but at a heavy cost.\n\n Of Jadunath’s force of ten, four men had been wounded. They had barely recovered when the second wave of the assault came---stronger and even more brutal.\n\n The raiders managed to get so close that Havaldar Daya Ram, the mortar NCO (non-commissioned ofhcer), took a big chance. Putting his own life at stake, he removed the secondary charges from the tubes to fire within 35-50 yards of the unit defences.\n\n  The mortar fire became more accurate, but it was so close that there was danger of Daya Ram killing his own men. It is to his credit that the risk was overcome and great devastation caused amongst the attacking raiders.\n\n The brave men were unfortunately completely outnumbered and almost all the soldiers of Jadunath’s section had been injured. The cries of the injured men rent the air but even then those who could stand continued to hold their guns despite their injuries and fought.\n\n  Jadunath himself had received bullet injuries on his right arm and thigh. Though badly hurt, he dragged himself to his wounded Bren gunner and took over the gun.\n\n By this time the enemy had reached the walls of the post, but Jadunath and his men did not give up. One of the non-combatants, who was not even trained to fight, also picked up an enemy rifle and shot dead a few attackers.\n\n Records say that when his ammunition finished he picked up an enemy sword and charged bravely at the raiders till he was finally shot dead.\n\n There are many such Stories of bravery, but Jadunath's towered above all the others. Battered and bleeding yet completely unmindful of his own safety, he encouraged his men to fight and battled valiantly by their side.\n\n He fought so bravely and with such unflinching courage and determination that what looked like certain defeat was turned into victory.\n\n The post was saved a second time.\n\n  By now, however. all the men of the post had become casualties. Realizing this, the enemy was quick to attack again.\n\n In the third attack, Naik Jadunath Singh, now wounded and alone, rose to fight single handedly.\n\n Like a warrior blessed with eternal life, became our of the trenches, bloody and limping, gun in hand. Firing at the enemy, his injured arm dripping blood, he charged.\n\n Shocked by his mad disregard for personal safety, the surprised enemy fled in disorder.\n\n Jadunath was still walking when a bullet came whizzing and lodged in his chest. He ignored it and continued to lire till anOther one whipped into his head. Eyes still open and breathing fire, Jadunath dropped to his knees and crumbled in front of No. 2 picket ofTain Dhar.\n\n His bullet-riddled body lay there with his eyes still staring at the retreating enemy soldiers. And there Naik Jadunath Singh breathed his last.\n\n He had not allowed the enemy to take over his picket.\n\n It was discovered later that Jadunath suffered eight bullet wounds during the three waves of the attack. There were many Other heroes besides him who died fighting that day.\n\n They were men who had lived up to the highest traditions of bravery and glory.\n\n  Jadunath Singh stood tall for his own sacrifice. For his gallant action in the face of the enemy, he was honoured posthumously with the Param Vir Chaltra.\n\n His story has been immortalized in the battalion war records.\n\n The war record of 6 February 1948 that I come across in the 4 Guards archives, written in ink on parched paper that feels brittle to the touch, reads: 'No. 2, 9, 7 and Kipper’s post attacked simultaneously.\n\n Enemy put in about 1500 to 2000 on each piquet. Enemy launched the attack in several waves.\n\n The battle lasted for two hours. Last wave beaten back by cold steel and bayonet. Enemy retired leaving 260 bodies, 131 rifles, and over 200 swords.\n\n Total enemy casualties believed 3000 killed. 1000 wounded. Own casualties--21 killed and 62 wounded."
  }, {
    "id": "1005",
    "name": "Company Havildar Major Piru Singh",
    "title": "1948",
    "operation": "Indo-Pakistani War",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Company_Havildar_Piru_Singh_Portrait.jpg/220px-Company_Havildar_Piru_Singh_Portrait.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "6th Battalion, Rajputna Rifles",
    "description1":"Service: British Indian Army,Indian Army",
    "description2":"Born: 20 May 1918\n",
    "description3":"\n\n The Battle of Darapari\n\n 18 July 1948\n\n It is a dark-purple moonlight night. But Company Hawaldar Major Piru Singh cannot afford to look up. The route is steep and filled with loose stones; one misstep can send him plunging down into the valley, leaving a mass of broken flesh and bones.\n\n  Piru Singh's  boot has just struck a rock that has gone tumbling down. For a fraction of a second, he stops to look at its deep descent.\n\n  And then he looks up at the treacherous ridge he and his section from Delta Company, 6 Rajputana Rifles, are trudging up. If he arches his neck right up, at an angle of nearly 180 degrees, he can see where the mountain ends, dark, craggy, uninviting.\n\n  That is where the enemy sits and that is where he and his men are headed.\n\n   D Company has been tasked with attacking and dislodging Pakistani irregulars from Darapari in the Tithwal sector of Kashmir. It is at a height of 11,481 feet and the attacking company has been told that the enemy is sitting there watching the narrow path that winds its way up though they have probably not had enough time to dig in deep.\n\n  Piru Singh takes a few deep breaths and resumes his climb; the air is starting to get colder and the long march of 30 miles all the way from Tangdhar has started telling on the spirit of the soldiers.\n\n  He knows they are tired.So is he. But in war tiredness is the least of a soldier's concern.\n\n   To distract himself fom the long climb ahead, Piru Singh lets his thoughts drift to nine months back. His battalion had been in Gurgaon, involved in internal security duties when orders came for them to move to kashmir.\n\n  The hill state needed to be defended from raiding Pathans and Pakistani Army regulars.\n\n  The soldiers were airlifted to Srinagar on 5 November 1947. For many of them it was the first ride in an airplane and for a few moments at least the threat of war was overshadowed by the thrill of that first plane ride.\n\n   18th July 1948, 1.30 a. m.\n\n  The path that leads from D Company's forward position to Darapari is barely one metre wide; on both sides are deep gorges and the soldiers are moving ahead silently in the dark; loaded rifles in their hands.\n\n  D Company has been tasked with clearing Darapan' and after that had been secured C Company is to move in, pass through, attack and capture the second feature.\n\n  Night- time has been chosen fbr the offensive deliberately so as not to alert the enemy soldiers and to take them unawares.\n\n  Nobody will talk, light a match or even cough, ’Piru Singh, whose platoon is leading the attack, tells his men and they nod in agreement.\n\n  Up above somewhere are the Pakistanis, and Piru Singh is sure they have the path in their gun-sights. Alerting them to the presence of the Indian Army soldiers climbing up would be suicidal.\n\n   Though intelligence reports say that the enemy could not have had time to make proper trenches and hence it would be easy to throw them out, these reports turn out to be wrong.\n\n  Unknown to the soldiers, the enemy has dug five bunkers that overlook this narrow path and had it covered completely by three medium machine guns (MMGs).\n\n  The Pakistanis are also anticipating an attack and are alert, so the moment the advancing soldiers reach Close to their bunkers, they open fire.\n\n  D Company is trapped in this bottleneck and caught completely unaware.\n\n  Bullets and shells fly in the cold night which reverberates with the screams of hit soldiers. Within a short span of 30 minutes, as many as 51 soldiers become casualty to the machine guns, grenade attacks and 2-inch and 3-inch mortars.\n\n   Suddenly there is complete chaos. If at that crucial moment.\n\n  Piru Singh does not step in and decide to put his own Iife at risk to further the advance of his company the battle would be lost right then.\n\n   Piru Singh is with the forward section. Half of his men have fallen already and he can see them bleeding, limbs ripped apart, their moans filling the gaps in the din of the crossfire.\n\n  Some of them are dead, others disabled by their injuries. Piru Singhhimself has miraculously escaped though his clothes are singed and ripped by the grenade attacles and his arms and legs are bleeding from shrapnel injuries.\n\n  He knows that the onlyway to tackle this attack is to silence the machine guns that are breathing fire on the mountain.\n\n  Completely unmindful of his own safety, he makes a dash for the nearest bunker from where the machine-gun fire is coming. Rushing through the hail of bullets, he sprays the enemy soldiers lodged in the trench with Sten -gun fire.\n\n  Before they realize he is there, he jumps in and bayonets the men handling the gun. They fall with loud screams of pain and shock and the gun falls silent.\n\n  By then the damage is done and Piru Singh realizes that all his comrades are dead. He is the only one left alive in his section. Screaming in anger; he leaps across the boulders to the next MMG post.\n\n  The enemy have noticed his lone act and direct fire at him. A grenade flung at him finds its mark.\n\n  It wounds him in the face and eyes but Piru Singh is beyond pain and discomfort. He doesn’t notice the blood dripping down his chin and seeping into his shirt collar. '\n\n   Climbing out of the trench, he wipes the blood out of his eyes and starts lobbing grenades at the next enemy position. Walking through the attacking fire, he makes his way to the second bunker and, climbing in, bayonets the two soldiers manning the second MMG.Two of the guns have now fallen silent but he knows there is one more.\n\n  By now that's. he is starting to lose consciousness because of the massive blood loss. His eyes are shutting and the blood is dripping right into them. By sheer dint of will powe, Piru Singh forces his eyes to stay open.\n\n  He pulls himself out of the second trench with great difficulty and shouting out the battalion war cry ‘Raja Ramchandra ki Jai’, he pulls out a grenade. He has not reached the third bunker when a bullet hits him in the head.\n\n  Piru  Singh knows he is falling; he wants to reach the next machine gun but he no longer has any power over his limbs. Grenade in hand, he tries to walk but his legs collapse under him.\n\n  Even as he drops to the ground, he manages to remove the pin from the last grenade and labs it at the third bunher.\n\n  The grenade traces an arch and as Piru Singh lies breathing his last on the ridge of Darapari, he wills his eyes to stay open. He watches the grenade find its mark. A loud blast rings out and he watches the bunker collapse, hilling the enemy soldiers and silencing the MMG inside.\n\n  Piru Singh Shehhawat finally closes his eyes.\n\n   C Company commander witnesses this act of heroism while directing fire in support of the attaching company. For his unmatched bravery inspiring example and superhuman courage in the face of the enemy, CHM Piru Singh is awarded the Param Vir Chakra posthumously The 6th Battalion, Rajputana Rifles, is awarded the Battle Honour of Darapari.\n\n  In a letter to Piru Singh’s mother; the then Prime Minister of India, Pandit Jawahar Lal Nehru writes:\n\n  'He paid with his life for his singularly brave act, but he left for the rest of his comrades a unique example of single-handed bravery and determined cold courage.\n\n  The country is grateful for this sacrifice made in the service of the motherland and it is our prayer that this may give some peace and solace'."
  }, {
    "id": "1006",
    "name": "Captain Gurbachan Singh Salaria",
    "title": "1961",
    "operation": "Congo Crisis",
    "url": "http://4.bp.blogspot.com/-a1vDynLnZSw/U_UjkAPhFCI/AAAAAAAAAoU/iaLsy7fJ1_M/s1600/Gurbachan-salaria-Param-Vir-Chakra-winner.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 3/1 Gorkha Rifles",
    "description1":"Service: Indian Army",
    "description2":"Born: 29 November 1935\n",
    "description3":"\n\nElizabethville, Katanga\n\n5 December 1961, 1.12p.m.\n\nSixteen small, slim Gorkha soldiers stand quietly in the shrubbery their olive green combats blending in.\n\n In their hands they hold their .303 rifles and between their teeth, their khukris, blades glinting dangerously in the afternoon sun.\n\n The soldiers are still 1500 yards from Roundabout, the location they have been ordered to close in on. They were to approach from the airport side, along with a troop of Swedish armoured personnel carriers, and block the gendarmerie’s withdrawal route. However, they had run into an ambush and now have enemy fire coming at them from a subsidiary location.\n\n Just a little way ahead stand the hutments that have been deserted by the locals and converted into bunkers by the revolting gendarmerie of Katanga. The enemy has two armoured cars and 90 men holed up in trenches and on rooftops, equipped with semi-automatic guns, far superior to the obsolete .303 rifles that the Gorhhas are using, the pre-World War II rifles painfully tedious to handle. After every round is fired, the bolt has to be pulled up and brought back to eject the cartridges and then moved forward to load fresh ones. Khikris their traditional Nepali knives, are much, much faster.\n\n That is why the Gorhhas have unsheathed them and are now waiting for orders to attack.\n\n ‘We will storm their location,’ orders their company commander, Captain Gurbachan Singh Salaria, his cool, no-nonsense voice cutting through the moist heat of the afternoon.\n\n The men get into position. They steel their hearts against all fear of death and when Salaria yells out their war cry Jai Mahakali, Aayo Gorkhali’, breaking into a sprint towards the enemy location, they follow.\n\n Salaria is the first to charge. He runs across with his gun blazing, bared khukri clasped in his mouth, flashing in the sunlight. Tahing on the first trench, he shoots dead the big gendarmerie on the left.\n\n From the corner of his eye he catches movement to his right, turns around and, gripping the khukri with his right hand, whips it fiercely through the air, slicing the man's horrified face.\n\n It rips of an eye and runs down his nose, slicing it into two bloody halves that bare the cartilage.\n\n Salaria’s trained hand followed the standard slashing drill of right to left, left to right and, blood spraying from his lacerated face, the man falls into the trench, his intact eye still open in shock and terror.\n\n  With a snarl, Salaria turns to the next man, the blood-soaked blade glinting. He leaps into the trench and cuts the throat of the enemy soldier, who hasn’t even had time to code his rifle.\n\n Awarm spray of red splashes across Salarias sweat-soakedface. He wipes it with the sleeve of his shirt and turns to the next trench.\n\n  2 December 1961\n\n   Captain Salaria, with one platoon of Alpha Company, is ordered to take over the protection duty of a refugee camp in Elizabethville.\n\n Around the same time, there is a skirmish between two drunken gendarmerie, who are trying to inolest Congolese woman, and soldiers of the peacekeeping force.\n\n It has led to a shootout. Though no one is hurt, it has resulted in the nearby gendarmerie garrison creating a roadblock and, over the following days, they manage to create a lot of trouble. \n\nFourteen UN personnel are abducted in those days of trouble. Earlier in November, Major Ajeet, also from 3/1 Gorkha Rifles-who had been tasked to force the release of two kidnapped UN offcials-had been abducted by the gendarmerie along with his driver.\n\n While Ajeet never returned, the driver’s body was later found wrapped in green canvas. He had been shot at point-blank range. Ajeet had most certainly been taken hostage but all efforts to trace him were unsuccessful. He was reported missing and later declared dead.\n\n  Theabduction of Ajeet is playing heavily on Salarias mind when he goes in for the final battle. He has been seething with fury about this cowardly kidnap of a peacekeeping Officer on duty. Alpha Company is guarding the refugee camp when, around 9 a. m. on 5 December, orders come for them to clear the roadblock created by the Katangese gendarmerie at Roundabout, on the route to the airport.\n\n It has to be done immediately because the block is aimed at stifling the lifeline of the UN forces that depend upon planes or not just rations, arms and ammunition, but aim the evacuation of the dead and the wounded.\n\n  Salaria was like a man possessed. He had lost count of how many men he had killed; he’d turned into a killing machine, flinging grenades, bayoneting men and slicing through necks with his khukri.\n\n Major Ajeet’s abduction and the murder of his driver had been on his mind for many days now.\n\n He was convinced that Ajeet had been killed and his heart shrank at just how painful his death must have been. The mercenaries were cold-blooded killers with no conscience. They needed to be taught a lesson and he was going to teach as many as he could.\n\n Here and now. For him, it was a meditative moment. He lost all fear of pain or death. As he charged at the gendarmerie, all instincts of self-preservation were forgotten and he became a yogic warrior as he wreaked havoc on the battlefield.\n\n With immense satisfaction he watched the much larger group of enemy soldiers scatter and run in terror of the tiny group of Gorkhas. They had never encountered such a ferocious enemy before.\n\n His soldiers had instilled terror with their savage charge and their deadly use of the khukri---a weapon the enemy had never seen before.\n\n In the distance, fumes were Still rising from the armoured car that his men had knocked out with their rocket launcher. It was unbelievable, but they had chased away a 90-Strong enemy force of men, who were bigger and equipped with the latest arms and ammunition. Around him were strewn the corpses of the gendarmerie, stunned disbelief writ large on their lifeless faces.\n\n Salaria had just bayoneted a man who had been trying to escape, when a burst of automatic fire from another fleeing enemy soldier sprayed into his neck.\n\n He felt his neck and found it covered in blood. Two bullets had pierced his neck. The blood was seeping down and soaking his shirt. Right ahead he could see the gendarmerie running away. Some of his brave and gutsy Gorkhas were still giving chase.\n\n He did not resist when an immense weariness enveloped him. He had lost too much blood. His task had been achieved and he was at peace. Closing his eyes, Captain Gurbachan Singh Salaria of 3/1 Gorkha Rifles, dropped his rifle and fell, drifting into unconsciousness from which he would never awaken.\n\n  Many years earlier, when Salaria had joined the Gorkha Rifles, he had been told that his regiment’s morto was:\n\n It is better to die than to be a coward: ‘Kafar hunu bhanda marnu ramro.’\n\n Salaria had lived up to the motto."
  }, {
    "id": "1007",
    "name": "Major Dhan Singh Thapa",
    "title": "1962",
    "operation": "Sino-Indian War",
    "url": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Major_Dhan_Singh_Thapa.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 1/8 Gorkha Rifles",
    "description1":"Service: Indian Army",
    "description2":"Born: 10 June 1928\n",
    "description3":"\n\nBattle For Sirijap 1, Ladakh Region\n\n20 October 1962\n\nThe Gorhha soldier is in his early 20s. He is firing from his trench. His slim fingers hold the .303 rifle so close to his slight frame that it appears to be an an extension of his body A helmet covers his young face.\n\n It is feezing cold but there are beads of sweat on his brow. He is shooting at the Chinese, who are coming in a massive wave, their automatic rifles spraying bullets blindly at the men defending Sirijap 1.\n\n The post lies on the northern edge of the Pangong Tso and is manned by the Delta Company of the first battalion of 8 Gorhha Rifles.\n\n  The soldier uses his bullets with care. He knows ammunition is running short and he and his comrades are completely outnumbered .There were 28 of them when the Chinese started shelling at 6 a.m. but nearly half of them now lie around him, some dead, others dying.\n\n Just then, a shell blows up a bunker that collapses right on top of Subedar Major Bahadur Gurung, the company second-in- command Gurung Sahab crawls out of the debris, injured and bleeding, light machine gun (LMG) still in his hand .He starts firing at the enemy again, his mud-streaked face a mash of cold control.\n\n Major Dhan Singh Thapa, commander; D Company,  continues to move from trench to trench, inspiring those left of his men to be brave\n\n  Just then a bullet hits the soldier in the hand. He drops the rifle and, screaming with pain, runs into the tent that still stands intact. Without losing a second, Major Thapa reaches for the fallen gun and carries it inside.\n\n He finds the terrified soldier cringing in a corner, nursing his injured hand.\n\n Thapa walks across to him and pats him on the head softly. ‘Kafar hunu bhanda marnu ramro’ (It is better to die than be a coward), he says, handing the gun back to the young man.\n\n ‘If we have to die we'll all die together; but kill a few before you die. ’\n\n  With that Major Thapa turns around and quickly makes his way back to where a soldier lies dead with his LMG still in his hands.\n\n He pulls the gun and gets into the trench himself positioning himself in front of the advancing enemy me the corner of his eye he sees the injured soldier walking bath with a determined look on his face and the rifle in his blood-stained hands.\n\n On 19 October\n\n Major Thapa was surprised to find hecticactivity on the enemy side and build-up of the Chinese forces on the posts. Suspecting a possible attack, Maj Thapa and his men began preparing their defence.\n\n The ground was hard and frozen and it was very diflicult to dig in so they piled up sandbags to reinforce their bunkers.\n\n The men waited anxiously that entire night. There were just 28 of them! But Maj Thapa inspired them with his words of courage.\n\n ‘Don’t forget that one Gorkha is equal to 10 others,’ be told them with quiet confidence.\n\n 'We did not panic in any way, neither were we afraid of anything except the biting cold outside the trenches, where freezing winds would blow during our patrols at night,’ Subedar Major Tulsi Ram Thapa, a survivor, will tell Poonam (Major Thapa’s youngest daughter) many years later when she is researching for a biography on her father). ‘We had enough clothing.\n\n Each of us was issued three pairs of woollensocks, woollen undergarments, trousers, goggles, jackets sleeping bags, camouflage raincoats, etc., and physically, We were quite comfortable. Some of us had even received letters from home.‘\n\n That dark night passed without any untoward incident and Slowly the soldiers who were not on duty closed their eyes for some rest. At 6 a.m. on 20 October, there was a blast and Sirijap I shook under heavy artillery fire. Bombs exploded and the air rang with the deadly hiss of shells and screams of those hit, followed by the boom of heavy mortars. The explosions destroyed the bunkers the Gorkhas had constructed and caused devastation amongst their small force.\n\n Many soldiers were killed in their trenches, many more wounded. Very soon the radio network was also disrupted, cutting the company off completely from the rest of the battalion.\n\n  Signal oflicer Major Ved Vyas will later remember the lasy message received from Major Thapa.\n\n ‘Neither will I Withdraw, nor will I surrender,’ he had said.\n\n The observation post atToltung, a ferry point for boats that were used for the maintenance of posts in the Pangong Tso area, was the only place from where soldiers could witness the battle of Sirijap.\n\n The soldiers say the shelling Went on for mom than two hours and Sirijap looked like it had been set on fire.\n\n While the shelling was on, the Chinese army managed to get close so the company position. No sooner had the shelling stopped than they attacked in a strength of more than 500. The Gorkhas put up a very brave fight.\n\n Most of them were in their early 20's with just a few years of service. Their LMGs and .303s were no match for the sophisricated arms and ammunition with the enemy, but they still managed to create havoc in the Chinese army.\n\n Small and slim in stature, they did not lack in courage. Led by their company commander, who was himself just 33 years old, they fixed the enemy soldiers in their gun-sights and shot them down the moment they came close.\n\nThe sheer numbers of the Chinese, however, were overwhelming. Every time they repulsed an advance the enemy would attack in even larger numbers. Naik Krishna Bahadur Thapa, in charge of one secrion, was hit by a splinter that severed his leg.\n\n In spite of his grievous wound, he picked up the LMG of a dead comrade and continued to fire at the advancing enemy till he was hit by an0ther volley of bullets  and dropped dead.\n\nThe men survived remember how Major​ Thapa rose above all others. He proved to them that he was a true commander. While the firing was on, he boldly went around bunkers without a thought for his own safety, strengthening breaches, replacing men who had died or were injured and encouraging the remaining with his brave words.\n\n He inspired them to hang on courageously and not bother about what Was bound to happen.\n\n  After two of their attacks were repelled, the Chinese used amphibious crafts to ferry machine guns and bazookas across the lake. Since D Company had lost all radio contact, the battalion headquarters sent Naik Rabilal Thapa with two boats on the lake to find out what was happening, but the Chinese fired at them and managed to capsize one, drowning all men on board.\n\n The other returned to the battalion with Naik Rabilal on board. He had managed to get within 1000 yards of Sirijap before the enemy opened LMG fire at him from three sides.\n\n He saw clouds of grey smoke and flames rising from Sirijap which appeared totally destroyed. He reported thar the post had fallen to the Chinese and all men defending it had lost their lives.\n\n The fact was that Sirijap had not lost all its men. Seven of the brave soldiers were still holding on though they were fast running out of ammunition. Inspired by the example of their company commander, who continued to fight by their side, they did not lose their nerve. Those who ran out of bullets picked up the rifles of their dead comrades and kept hring. When all their ammunition finished and the Chinese Started using incendiary bombs to start fires to smoke out the soldiers, the Gorkhas pulled out their khukris (traditional Nepali knives), and jumped out of their trenches screaming out their war cry:\n\n ‘Jai Mahakali, Aayo Gorkhali.’ Led by their commander, they plunged their deadly blades deep into enemy throats and chests.\n\n Major​ Thapa was one of the last few left alive and was lighting with his khukri when he was hit in the face by a rifle butt and lost two of his teeth.\n\n He killed the Chinese soldier and was in the process of putting out a fire by rolling over it physically when he was surrounded and taken prisoner along with a few others. When dusk fell over Sirijap on 20 October, the battalion had no idea about the fate of Major Thapa, who had been given up as dead along with the 28 other heroes.\n\n For his devotion to duty, undaunted gallantry and inspiring command, Maj Thapa was recommended for an immediate award of Param Vir Chakra (PVC).\n\n He was awarded the PVC posthumously since he was believed to have been killed in the war."
  }, {
    "id": "1008",
    "name": "Subedar Joginder Singh",
    "title": "1962",
    "operation": "Sino-Indian War",
    "url": "http://im.rediff.com/news/2012/oct/22joginder-singh1.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit:  1 SIKH",
    "description1":"Service: British Indian Army,Indian Army",
    "description2":"Born: September 26, 1921\n",
    "description3":"\n\n23 October 1962, 5.30 a.m.\n\nThe position first wave of Chinese attack comes just a few minutes after the langari or cook Bahadur Singh leaves the cookhouse with thermos flasks holding freshly brewed steaming hot tea for the platoon.\n\nSubedarKala Singh does not hear the gunfire since the soldiers trenches are much lower on the ridge. But the rest of the men reach for their guns as a large force of the Chinese start to cross the stream, their rugged boots splashing across the water. They come in waves of hundreds.\n\n Led by their fearless commander, the brave men of 1 Sikh stand their ground and face the first attack bravely. From their trenches they take on the enemy soldiers, fixing them within the sight of their rifles and shooting them through their heads and hearts.\n\n Thefirst attack is successfully repulsed. The enemy is temporarily halted because of the high casualty. However, within half-an-hour they unleash a second attack with more troops. War cries ring out and joginder Singh inspires his men with his words and action. Roaring like a lion, he keeps up the defence and implores his men to be quick and precise with their bullets. He is wounded in the thigh, and continuing to inspire his men, refuses to be evacuated.\n\n Despite being completely outnumbered the troops stubbornbly hold on to their position and do not withdraw an inch.\n\n  In the meanwhile, communication with the company post is also lost.\n\n  Ammunition is falling short; the old, single-shot loading rifles with the Sikhs are no match for the sophisticated weapons of the Chinese, but they still cannot overrun the post. So, they launch a third wave of attack. By now, nearly half the men in the platoon have been killed and ammunition is very short. Despite his injury joginder Singh himself mans a light machine gun and shoots down as many of the enemy soldiers as he can.\n\n Soon, the men run completely out of ammunition.\n\n The Chinese are still coming at them. When death becomes imminent, Joginder Singh tells the men it is time to prove themselves. They fix bayonets on their guns, jump out of their trenches and rush into the charging enemy soldiers with loud cries of\n\n ‘Bole so nihal sat sri Akal’.\n\n The Chinese are stunned by the courage of these hugely outnumbered but spirited, Sikh warriors with their flowing beards and their turbans. They have never beheld such a sight before.\n\n Ledby the slim and quick Joginder Singh, the surviving men charge head-on into the Chinese columns. The air rings out with screams and cries of the soldiers hurling abuse at each other. As the Chinese keep coming at them with guns blazing, none of the Sikhs tries to run or hide. Drawing courage from Joginder Singh, they rush in and bayonet as many as they can before they finally under enemy fire.\n\n Eventually, every single man collapses.\n\n  As the sun sets that evening, Joginder Singh, the brave Sikh soldier, disabled by his injuries, lies on the Bum La axis, the soft falling snow covering his body gently. But Joginder Singh does not die then.\n\n He is carried away by the Chinese, who return with mules the next day. He dies in captivity. His body is never returned.\n\n  When the Chinese hear over the radio that the Indian government is awarding a PVC to Subehdar Joginder Singh, they reverently return his ashes. Subehdar Kala Singh carries these to Subehdar Joginder Singh's village and hands them over to his wife.\n\n The brave JCO's daughter had died of shock the day she heard of her father's sacrifice, he discovers.\n\n If Joginder Singh had not been killed in the war, he would have hung up his uniform in a year’s time and gone back to his wife and children in his sunny village near Moga in Punjab, with a monthly pension of Rs 116.\n\n Perhaps he would have still been farming wheat there while recounting war stories to his grandchildren about the day the Chinese attacked his platoon on an ice-cold ridge near Bum La.\n\n Joginder Singh died fighting a shamefully unequal battle his government pushed him into, completely unprepared and unequipped, but he is immortalized in the country’s history for his brave act of valour."
  }, {
    "id": "1009",
    "name": "Major Shaitan Singh",
    "title": "1962",
    "operation": "Sino-Indian War",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Major_Shaitan_Singh.jpg/220px-Major_Shaitan_Singh.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 13 KUMAON",
    "description1":"Service: Indian Army",
    "description2":"Born: December 1, 1924\n",
    "description3":"\n\nThe battle of Rezang La\n\n 18 November 1962 is a Sunday. It is colder than usual and snow falls lightly over Rezang La. Around 3.30 a. m, the stillness of the early morning is pierced by the staccato sound of an LMG burst.\n\n Major Shaitan Singh quickly asks Ram Chander to tune the radio set. Jemadar Hari Ram from 8 Platoon comes on air and says that the enemy has tried to attach their listening post with about ten men but were spotted. \n\nNumber 8 Platoon has directed LMG fire at the Chinese soldiers climbing from the gullies and hilled most of them, while the remaining have run away.\n\n ‘Shabash! Chaukas rahiye, ’(Bravo! Be vigilant) says the Major. Suspecting there could be more enemy attacks he orders a patrol to check the gullies between 7 and 9 Platoons.\n\n The patrol returns and reports that these gullies are swarming with Chinese. The LMGs and mortars are put in position. Iemadar Surja Ram, 7 Platoon, reports that around 400 enemy soldiers are climbing up to their post.\n\n ‘We can see them clean} against the snow, ’he tells his company commander.\n\n  Major Shaitan Singh orders him to fire at them the moment they come within shooting range. When the enemy soldiers are 250 yards away 7 Platoon opens fire. Their three LMGs blaze for four minutes.\n\n They report that the enemy attack has been repelled.\n\n Just then, 8 Platoon reports that 800 enemy soldiers are coming up from the ridge near them.\n\n' Aap Veer Ahir hain, poore josh se ladiye, ’ (You are a Brave Ahir; fight with full spirit) the Major tells jemadar Hari who bravely replies,\n\n Aap chinta hi mat kariye Sahab, ham ladenge’ (Don’t worry Sir; we will fight).\n\n Theplatoon opens fire and the attack is neutralized. Major Shaitan Singh orders mortar fire into the gully; Jemadar Hari Ram advises:\n\n ‘Sahab, don’t fire any more into that nala; it is full of dead Chinese men. ’\n\n  After all their frontal attacks fail the Chinese quichly change their plan. Around 4.30 a. m., they begin to shell all the posts at the same time. From the blinds recovered later; it is evident that they use three types of mortars; 120 mm, 81 mm and 60 mm.\n\n To destroy bunkers, they use 75 mm and 57 mm recoilless (RCL) guns that they have brought there on wheelbarrows. The four-foot-deep craters found in solid rock indicate that that they also use 132-mm rockets.\n\n ‘It was such a massive attack that no one could help anyone else, ’ says Ram Chander.\n\n ‘We could not hear each other over the din; shells just came and blew up our bunkers. Of our main operators, one had his head and the other his legs blown off. Wooden planks were reduced to matchwood and sandbags to shreds of gunny.\n\n It was all over in 15 minutes and there was a trail of death and devastation left. ’\n\n When the bombing ceases, the men who survive see yaks and horses on the ridgeline. Company Havaldar Major (CHM) Harphul Singh initially thinks it is Alpha Company coming to their aid, but when he looks through his binoculars he realizes  it’s the Chinese bringing reinforcements to attack 8 Platoon. At the same time, 7 Platoon reports that nearly 700 enemy soldiers are climbing up to their post.\n\n Major Shaitan Singh, who has been hit by a shell and has his left arm in a bandage, rushes 190m man to man instilling courage in them. He asked injured jawans to get first aid and be ready to fight.\n\n ‘All our bunkers were destroyed, our men were injured and dead, our ammunition was running out, many of the jawans could not even cock their .303 rifles since their fingers had frozen in the cold, but Major Sahab did not lose his nerve. He stood there calmly and directed the men, telling them to be brave and to battle on, ’ remembers Ram Chander.\n\n NihalSingh is on the LMG at the company HQ with his partner Ram Meher Singh. Ram Meher is hit by a shell and collapses.Left alone in the trench with no means of\n\n Communicating with anyone, Nihal keeps firing till he is shot. He manages to pull apart the pieces of his LMG so that it does not fall into enemy hands. He has grenades but no strength in his arms to pull out the pins and throw them.\n\n Finally, he is pulled out of the trench by enemy soldiers and taken away.\n\n Major Shaitan Singh is on the ridge when a medium machine gun-burst hits him in the stomach. It also burns down the radio set with Ram Chander so they are now completely cut off from everyone else.\n\n CHM Harphul Singh grabs an LMG and kills the enemy soldier who has hit Major Shaitan Singh.\n\n He is hit by RCL fire and collapses. Breathing his last, he tells Ram Chander, ‘Don’t let Major Sahab fall into the enemy’s hands’.\n\n Major Shaitan Singh is losing blood and slipping in and out of consciousness. He repeatedly tells Ram Chander to open his belt since his stomach is hurting. RamChander puts his hand inside his shirt to find his intestines spilling out.\n\n I didn’t open his belt because everything would have fallen out, ’ he says.\n\n RamChander holds him in a tight embrace and rolls down into the ravine with him. Then, carrying his company commander on his back, he walks 800 metres and, stopping near a boulder, lays down the major. He meets another soldier, who is injured and bleeding.\n\n They get caught in enemy crossfire.\n\n Realizingthat his men will not have a chance to escapes they have to carry him, Major Shaitan Singh orders them to leave him where he is and save their own lives. ‘Go back and tell them how we fought till the last. This is my company. I want to die here. Yeh aapke liye aadesh hai, ’ (This is my order) he insists, his breath coming in painful gasps.\n\n It is 8.15 am. The snow is still falling and the sky is a dull grey. Reluctantly, the soldiers leave. They find their way to the quarter master’s shed only to find it burning. It has been set on fire by their own men, who had received orders to destroy everything and come back to battalion HQ in Chushul.\n\n The survivors walk six miles to reach the battalion.\n\n Meanwhile, Nihal escapes that night from enemy custody and manages to reach his post. He finds bodies scattered like rag dolls. Major Shaitan Singh's tent lies shredded to bits. His friend Chiman has his head blown of Mahender from Mandola village is dragging himself around, his legs crushed.\n\n  ‘Bhai mujhe bhi le chal (Buddy, take me along), ’Mahender implores him, but Nihal tells him he is helpless since his own arms are useless.\n\n I couldn’t help Mahender, ’ he says sadly. . ‘Theek hai bhai, phir tu nikal (Alright buddy, you carry on ), ’ Mahender tells him and Nihal turns to find his way back to his battalion headquarters.\n\n He sees the enemy firing illumination rounds into the air to spot him, but his white parka blends in with the falling snow and he manages to climb down the ridge ' undetected .\n\n  When he is tired and lost, Tommy, a big local dog from a nearby village, who has been a routine visitor to their post for meat, finds him.\n\n Nihal follows the dog blindly, tripping and killing on the slope.\n\n Manyhours later, a soldier at the battalion HQ in Chushul, looking through his binoculars, finds a wounded man pulling himself through the snow.\n\n He is recognized as Nihal of C Company Both his arms are hanging limply by his side, his uniform is blood-stained and tattered, he has lost a lot of blood and is weak from lack of food and water. Nihal is brought back quickly,  and tea and then sent to jammu hospital for treatment.\n\n He is one of the survivors of Rezang La; he recounts the brave tale of the handful of men who tried desperately to save their post font falling into enemy hands.\n\n He speaks of the 1310 dead enemy soldiers whose bodies were taken hitch by the Chinese. He says the Chinese got 25 trucks in which they loaded the bodies of their men.\n\n  After the ceasefire, Rezang La falls into no mans land, which means it is disputed and not to he occupied by either country.\n\n Major Shaitan Singh and his men lie frozen there till a shepherd discovers their bodies three months later.Great glory did come to Major Shaitan Singh in a war that is mostly remembered with shame.\n\n Every man of C Company who fought at Rezang La was a hero. The name of Major Shaitan Singh, who inspired his men so much that they preferred death 'to surrender, will live forever in the pages of India’s military history.\n\n His supreme courage, leadership and exemplary devotion to duty inspired his company to fight gallantly to the last man. For this act of undaunted courage in the face of the enemy, he was awarded with the Param Vir Chakra (posthumously)."
  }, {
    "id": "1010",
    "name": "Company Quarter-Master Havildar Abdul Hamid",
    "title": "1965",
    "operation": "Battle of Asal Uttar",
    "url": "http://3.bp.blogspot.com/-LQJ9j5eZmA8/VqmNtFQzyTI/AAAAAAAG0jw/j4OkTLjoX3I/s320/3-733554.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 4 Grenadiers",
    "description1":"Service: Indian Army",
    "description2":"Born: 1 July 1933\n",
    "description3":"\n\nKhem Karan Sector\n\n8 September 1965, 9 a.m.\n\nThe fields are rustling with sugar cane and even as Hamid sits in the passenger seat of his jeep, which has mounted on it a recoilless (RCL) gun, he can hear the wind.\n\n The Jeep trundles over a narrow mud track ahead of Cheema village. Hamid knows Pakistan has launched an attack with a regiment of Patton tanks that has barged right into the forward position.\n\n He hears the rumble of armour first and then catches sight of a few tanks that are heading towards his battalion.\n\n  Taking cover hehind the tall crop, Hamid points his gun in their direction and then waits.\n\n The Grenadiers hold their fire so as not to warn the enemy just as the tanks come within 30 yards, Hamid asks his loader to load the gun and shoot. He watches the shell go up and arch towards the first enemy tank.\n\n Even as he picks up his binoculars, he hears the blast.\n\n The tank is burning in front of his eyes.\n\n  Hamid and his men rejoice.\n\n ‘Shabaash!', Bravo, he mouths and they exchange wide smiles.\n\n They spot the crew of the two following tanks dismount and run away. Hamid orders the driver to reverse and move.\n\n  Around 11.30 a. m., the battalion is subjected to heavy artillery shelling and then they hear the familiar rumhle again.\n\n Hamid whips out his binoculars. Three more tanks are heading in their direction.\n\n He positions his jeep in the midst of the field to hide it from view and, positioning his gun, waits.\n\n The moment the tank comes within shooting distance, he signals to the loader and watches the trajectory of the shell It hits target and one more tank is burning in front of his eyes while the remaining two are again abandoned by the Pakistanis.\n\n By the end of the day, Hamid has destroyed two tanks while four have been abandoned.\n\n  Demands are now made on the engineers to lay out anti-tank mines in the area since that is where the enemy tanks are coming in from.\n\n They do the best they can under the time available. It is clear that the battalion is facing a brigade-level attack from the Pakistani armoured forces and all they have to fight them with are RCL guns.\n\n That doesn’t bother the soldiers who in high spirits after  their initial victories.\n\n The next morning Hamid is back at his job and he destroys two more tanks with his RCL gun. The battalion also faces an air attack from Pakistani Sabre jets but these don't do much damage.\n\n By the end of the day, Hamid and his team have shot down two more tanks.\n\n It is a remarkable achievement.\n\n That night Abdul Hamid sleeps well. He is happy with his achievement.\n\n His citation has been sent for a Param Vir Chakra (PVC). It credits him with the destruction of four tanks.\n\n The next day Hamid shows up on the battlefield yet again. He will destroy three more tanks (according to Jameel, who has heard about the battle from a survivor, who died few years back).\n\n This, however, Will not get entered into his records since his citation has already been sent.\n\n 10 September 1965\n\n 4 Grenadiers comes under heavy enemy shelling. After that there is another assault by enemy tanks. They are moving in a formation of three.\n\n Hamid waits under cover of vegetation and when the first tank gets close, he blows it up, quickly asking his driver to move away.\n\n Just as they do, a tank shell drops and bursts at the very spot where they were a few minutes ago.\n\n The brave Grenadiers have moved to another point behind a thicket from where they are training their gun on another Patton. They shoot it down as well. By now, the shelling has started.\n\n The enemy tanks have noticed the jeeps and they concentrate machine gunfire on them.\n\n Hamid is tricking them by constantly changing his position and by keeping his jeep camouflaged by the tall sugar cane crop. Another tank slowly lumbers towards him, but he does not have the time to move since they have both spotted each other. Both place each other in their sights and shoot.\n\n Both shells hit their targets. There is a loud blast, fire and smoke. Even as the tank is blown up, its shell hits the jeep. The impact flings it in the air.\n\n There are screams of pain, a lound crash and then complete silence intercepted only by the crackle of flames.\n\n Abdul Hamid is dead. He has blown up a total of seven enemy tanks, even more than an armoured formation can hope for. For his remarkable achievement, bravery and courage, Abdul Hamid is awarded the PVC posthumously.\n\n The battalion is awarded the Battle Honour of Asal Uttar and the Theatre Honour (Punjab).\n\n  For first time in military history a battalion with only RCL guns at its disposal has fought of an armoured division."
  }, {
    "id": "1011",
    "name": "Lieutenant Colonel Ardeshir Burzarji Tarapore",
    "title": "1965",
    "operation": "Battle of Chawinda",
    "url": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Lt_Col_A_B_Tarapore.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Hyderabad Lancers,Poona Horse(17 Horse)",
    "description1":"Service: Hyderabad Army,Indian Army",
    "description2":"Born: August 18, 1923\n",
    "description3":"\n    Zarine, was listening to her father. She would never forget his words or his love for his men. Adi was to spend just one more year with his family.\n\n In September 1965, during the biggest tank battle fought between India and Pakistan at Phillora in the Sialkot sector, an enemy shell would hit his tank.\n\n Adi would be standing in the cupola when the tank would erupt in flames consuming him and his intelligence officer.\n\n He would die a hero’s death right there on the battlefield, to the shock of the men he loved so much.\n\n At that time his left arm was already in a sling from an earlier injury for which he had stubbornly refused to be evacuated. Before that he would have led his men right into Pakistan and his unit would have successfully captured Jassoran and Buttar Dograndi.\n\n For the valour displayed by him in this action, lasting six days, Lt Colonel Ardeshir Burzorji Tarapore, would be awarded with the highest war-time gallantry medal, PVC, posthumously.\n\nThe Battle of Chawinda\n\n It was the first day of the battle of Chawinda. The regiment was deployed in Sialkot district of Pakistan’s Punjab province.\n\n When Lt Col Tarapore called his second-in-command Major N.S. Cheema (now Lieutenant General [retired]) aside, the latter thought it was a regular war briefing that the CO wanted to give him.\n\n However, it seems that the colonel had had a premonition about his own death.\n\n  Major Cheema was surprised when Lieutenant Colonel Tarapore went on to give him detailed instructions on what do in case he was killed in battle.\n\n “‘I must be cremated in the battlefield,” he said.\n\n “My prayer book must be given to my mother;\n my gold chain to my wife;\n my ring to my daughter;\n my bracelet and pen to my son,”’ Colonel Tarapore told (then) Major Cheema, who later recounted this to Sakal Times in an interview. ‘He paused and then added,\n\n “And, Niranjan, please tell my son Xerxes to join the army”. ’ Five days later, on 16 September 1965,\n\n Tarapore was fatally wounded after being hit by an enemy artillery shell.\n\n The biggest tank battle of the 1965 lndo-Pak War took place at Phillora in the Sialkot sector. During the southern thrust of the Indian Army on the Kaioi-Phillora axis, 17 Horse commanded by Lieutenant Colonel Tarapore advanced on the right flank.\n\n The battle for Phillora started on 10 September with the Indian troops launching a massive attack.\n\n On 11 September, the regiment was assigned the task of delivering the main armoured thrust for capturing Phillora. It decided upon launching a surprise attack on Phillora from the rear.\n\n The 1st Armoured Division, equipped with four armoured regiments, was on the offensive in the area. Unstopped by the enemy, the tanks just kept moving into Pakistan.\n\n ‘At around 11 a.m. the first air attack came. Till then the buggers had had no idea that we were so much inside their country,’ chuckles General Ajai Singh, who was a young Major in the C Squadron of 17 Horse, which was leading.\n\n Pakistan surprised the advancing Army by sudden strafing though the air attacks did more damage to lorry and infantry columns and less to the tanks.\n\n The toll was heavy, however, General Ajai Singh remembers; the regiments 16 Cavalry and Hodson Horse were butchered. There was complete chaos.\n\n Many of the men standing in their cupolas were hit and just collapsed or were badly injured.\n\n General Ajai Singh remembers he was standing on his turret when a shell hit his toolbox and his blanket caught fire.\n\n The fire was quickly put out and no damages were incurred.\n\n  The Patton tanks of Pakistan were facing the armoured units 16 Cavalry and Hodson Horse. The air attack had taken such a heavy toll that they were reeling back.\n\n The morale of the men was at a low. It was at this time that, on Tarapore’s initiative, 17 Horse moved in to stabilize the situation.\n\n As was typical of him, he did not wait for instructions and just attacked the Pakistanis without any warning.\n\n ‘And what a ferocious attack it was,’ says the old General remembering that smoke-filled morning with pride.\n\n ‘We destroyed 13 tanks in the first go.’ Intense fighting continued for two days and Pakistani forces were forced to beat a retreat towards Chawinda.\n\n Phillora was captured by the Indians 3.30 pm. on 11 September. Pakistan’s 11 Cavalry fought well, but lost so many tanks that from that day onwards it ceased to function as a complete tank regiment.\n\n Tarapore was wounded in the operation. A splinter had smashed through his arm leaving a gaping wound.\n\n Since he was not able to move his arm, it had to be put in a sling.\n\n  After the capture of Phillora, the brigade commander and general officer commanding came over to compliment 17 Horse.\n\n Immediate awards were discussed but Lieutenant Colonel Tampore brushed them off saying his regiment was just doing its duty.\n\n He refused to be evacuated insisting that the wound was ‘ just a scratch’. Besides, he still had to oversee the attack on Chawinda.\n\n Meanwhile the Pakistani forces retreated and regrouped. They would put up a last fight at Chawinda.\n\n  The capture of Buttar Dograndi\n\n The plan was that Chawinda would be attacked by the infantry on the afternoon of 13-14 September and 17 Horse would encircle it. The task was given to C Squadron. General Ajai Singh remembers how his squadron’s tanks started moving in with 9 Garhwal as support, The Indian Army did not realize that Pakistani tanks were already hiding under cover in Buttar Dograndi, waiting for the attack. \n\nWhen C Squadron’s tanks broke cover to attack the village, six out often were shor on the spot by the Pakistani Pattons. Since the enemy was hidden and the 17 Horse tanks had to move out of the sugar cane fields and expose themselves for the attack, the situation quickly took a tum for the worse.\n\n Major Ajai Singh immediately called his CO on the wireless and informed him about the situation.\n\n‘I asked him for immediate reinforcements Otherwise Buttar Dograndi would be lost.’ He recollects how Tarapore moved in at once with his own tank while directing A Squadron to join the battle as well. \n\n‘I don’t know if the message got relayed properly or not in the complete chaos of war but when the others saw the CO’s tank moving towards Buttar Dograndi, some started following him as well. \n\nThe result was that I had reinforcements.’ says Gen Ajai Singh.\n\nWhile the Pakistani Pattons were well-hidden in the foliage in the village a km away, the Indian tanks had broken cover from sugar cane fields for the attack.\n\n It was a daring attack, but the nine Centurions which included five of Major Ajai Singh, three of A Squadron and one of CO Tarapore-attacked the Pattons and destroyed all six of them. Buttar Dograndi was captured.\n\n It was a moment of silent celebration for 17 Horse and its CO. Not only had Lieutenant Colonel Tarapore defied the enemy’s charge, he had held his ground and gallantly attacked Phillora.\n\n Though under continuous enemy tank and artillery fire, he had remained unperturbed throughout this action.\n\n When Wounded, he had refused to be evacuated.\n\n  On 14 September, he again led his regiment to capture Wazirwali. Unmindful of his injury, he captured Jassoran and Buttar Dograndi on 16 September. In this battle his own tank was hit several times.\n\n But despite the odds, he maintained his pivots at both these places and thereby helped the supporting infantry to attack Chawinda from the rear.\n\n Inspired by his leadership, the regiment fiercely attacked and destroyed approximately 60 enemy tanks, suffering only nine tank casualties. The valour displayed by him in this aetion, lasting six days, was in keeping with the highest traditions of the Indian Army.\n\n But soon, he would meet a painful though glorious end.\n\n  The last day\n\n  Tarapore is quite relaxed. He has finished his prayers in a relaxed way, the daring capture of Buttar Dograndi is fresh in his mind and he is proud of the men he has commanded. \n\nThe battle is still on, but he knows it is just a matter of time before Pakistan caves in. Standing at his tank hatch, he is watching the battlefield, a cup of tea in his right hand, the left arm still in a sling. He is discussing the situation with his intelligence officer who is also on the tank and standing to his right. It is typical of him to stand in the open, unguarded, giving instructions or just surveying the area.\n\n At that unfortunate moment, a freak shell whizzes in and hits his tank, setting it on fire at once. Both Tarapore and his intelligence officer are enveloped in flames.\n\n They have taken a direct hit.\n\n Major Ajai Singh 13 evacuating a gunner who has fallen off his tank, and he freezes  when he hears from his operator that the as een hit. Shocked, he rushes to the spot to find Lieutenant Colonel Tarapore's lifeless body laid out on the ground, bathed by the orange rays of the setting sun.\n\n  It is 6 p.m. While Lieutenant Colonel Tarapore,s body is tearfully taken back, his disabled tank Khushab, named after a famous battle honour where the 17 Horse got two Victoria Crosses, has to be left behind.\n\n It is later captured by Pakistan.\n\n  For the valour displayed by him in this action, lasting six days, which is in keeping with the highest traditions of the Indian Army, Lieutenant Colonel Ardeshir Burzorji Tarapore is decorated with the highest war-time gallantry medal, the Param Vir Chakra, posthumously."
  }, {
    "id": "1012",
    "name": "Lance Naik Albert Ekka",
    "title": "1971",
    "operation": "Battle of Hilli",
    "url": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Lance_Naik_Albert_Ekka.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 14 GUARDS",
    "description1":"Service: 14 GUARDS",
    "description2":"Born: December 27, 1942\n",
    "description3":"\n    A man is crouched motionlessly on the ground; around him are nasty swamp bubbles. His boots are caked with dried mud, and he can feel an ant crawl across his left leg.\n\n He does not move an inch; ants are the Ieast of his worries.\n\n Something drips down his neck and instinctively he touches it. It feels too sticky to be sweat. Lance Naik Albert Ekka brings his hand forward.\n\n It is too dark to see but he isn’t surprised to smell blood. Wiping his palm on his pants, he grips his gun again It is going to be first light soon.\n\n Ekka can tell this even before he notices the faint orange glow seeping through the purple sheen of the night up in the east.\n\n He is an adivasi and knows these things instinctively, as do most tribals.\n\n The stars are still in the sky when he drops to his knees and goes into a make crawl with his 7.62 rifle in his hands.\n\n   The bullet lodged in his arm sends a shooting pain down his arm. Another has caught him in the neck, making him stagger and fall before he grits his teeth and picks himself up again.\n\n A thin trickle of blood is oozing from the gaping hole and curving right down to his collar and into his neck.\n\n This wound is still warm and isn't hurting just yet but he knows it is just a matter of time before the blood loss and the pain gets him.\n\n Ignoring it for the time being, he put his weight forward on his elbows and crawls into the darkness making his way to the old double-storied railway signal building from where the enemy medium machine gun (MMG) fire is coming.\n\n  When Lance Naik Albert Ekka reaches the building where the enemy soldiers have made a bunker; he can hear the deadly rattle of the machine gun booming in his ear.\n\n The ground trembles under his feet each time the gun goes off filling the night with cries of his own men, helpless before its killer accuracy and range.\n\n The guns his own troops have are no match for the powerful MMG fire.\n\n If this operation is to be successful the enemy MMG has to be silenced.\n\n Slinging his rifle on his back, Ekka reaches for the grenade on his belt Removing the pin with his teeth and spitting it out in one quich move, he lobs it inside the old brick structure through a gap.\n\n He then waits for the soft hiss to die down.\n\n  Before the two men inside can realize what has happened, the grenade has exploded, making Ekka squint in the sudden light and recoil from the splinters that hit him in the stomach.\n\n It throws one soldier against a wall with its force, reducing him to a mass of flesh and blood. The other is unharmed and still bent over the MMG.\n\n  Ekka climbs up the rusty old iron ladder leaning against the building and jumps in from a window. He takes his rifle of his shoulder and with the gleaming blade of the bayonet charges at the soldier operating the machine gun.\n\n Ghonp-nikal, ghonp-nikal: he remembers the ustads instructions clearly.\n\n It has been hardly four years since his training and he has always been a quiet, but good student, silently absorbing lessons.\n\n  The time has come to put what was taught to test. Screaming with cold fury, Ekka charges at the machine gun operator and just as he turns around pushes the bayonet right into his stomach.\n\n Pulling it out with all his might, he raises his raises and plunges the blade back into the man's chest. Again. And again.\n\n   The MMG is still smoking when its operator drops down in a bloody pile. Ekka wipes the dead man’s blood off his face and stands there with the bloodied bayonet in his hands. His eyes bear a look of quiet satisfaction. And extreme exhaustion.\n\nThe machine gun has fallen silent. Everything is at a standstill The night is suddenly quiet.\n\n And then the battle turns in favour of the Indian soldiers. Major O.P. Kohli, company commander, Bravo Company, who is just 10 feet away directing the other men, has watched Ekka lob the grenade and climb into the signal station.\n\n Though the cracks in the building he can see Ekka attack the gunner and then turn.\n\n His heart fills with pride at what his man has done and he watches the building, waiting for Ekka to show up at the window.\n\n  He is relieved to find the small slim soldier climb out and step on the iron ladder to join the rest of the men. With bated breath, he watches Ekka start to climb down.\n\n And then suddenly, Ekka's body goes limp and he collapses and falls of the ladder.\n\n  Lance Naile Albert Ekka is dead. He has succumbed to his injuries. But he has accomplished his mission.\n\n While the men of Bravo Company go about clearing bunkers, free of the MMG that has been stalling their attack, Lance Naik Albert Ekka lies dead under the iron ladder that leads to the old brick signal station of Gangasagar.\n\n The sun slowly appears from behind the darkness. The stars disappear one by one and soon it is dawn.\n\n  Gangasagar, Eastern front, Bangladesh Liberation War\n\n Night of 3 December 1971\n\n The Alpha and Bravo Companies were told to attack Gangasagar railway station, which the enemy had convened into a virtual fortress by establishing bunkers all around.\n\n The C Company was moved out to create a diversion while the D Company stayed with the battalion headquarters.\n\n The artillery was kept on all but not brought into action since the aim was to surprise the enemy by moving into their defences silently and the big guns would have alerted them.\n\n It was 2 a.m. when the men of Alpha and Bravo Companiesstarted their match into enemy territory. Since the general area was marshy and a soldier walking there could easily sink up to his knees in the slush, the men were asked to walk in single file long the railway track that had been laid on an embankment H0 feet high and equally wide.\n\n Enemy soldiers had earlier been observed walking along the track so the guards knew that the area was not mined.\n\n  As per plan, Alpha Company started walking along the right of the track and Bravo on the left.\n\n The men were moving quietly in the night, one behind the other. To maintain coordination bemeen the two marching companies, Lance Naik Gulab Singh and Lance Naik Ekka were appointed as guides to march on top of the embankment, one on either side guiding their respective companies from the height.\n\n The orders were that the men would move along the railway track and charge when they saw the enemy. B Company Commander Major Kohli (he had been promoted) was walking down below along the railway track with the troops. He could see Ekka right above, his thin frame a dark shadow moving silently in the night.\n\n This was how the two companies marched on, one on either side of the railway track with the two guides moving together on top, till they reached the enemy position.\n\n All was going well till one of the guides walked into a trip-flare wire that the enemy soldiers had laid out across the railway line.\n\n The moment the device went off, it sent a bouquet of fireworks into the air, illuminating the area like daylight. The two men on top stood exposed.\n\n Just 40 yards away from where Ekka was standing was an enemy bunker with a sentry on duty outside.\n\n  Startled by the noise and light, the soldier on sentry duty shouted:\n\n ‘Kaun hai wahan?’ (Who goes there?) It was 2.30 a.m. and he was still trying to figure out if the trip wire had been set off by a man or an animal.\n\n  ‘Tera baap,’ (your father) replied Ekka and charging ferociously with his gun he bayoneted the enemy soldier.\n\n There were four men, a light machine gun (LMG) and a recoilless (RCL) gun in that first bunker they encountered, Ekka was shot in the arm but the bunker was quickly taken over .\n\n Thereafter, all hell broke loose. Pakistani troops started lighting up the area, firing illumination rounds.\n\n LMG and MMG fire was directed at the two attacking companies. The night rang out with the sound of gunfire and cries of men attacking each other.\n\n There was a pond behind the railway station with a bandh (dam) around it and the enemy soldiers had fortified the entire area with numerous bunkers.\n\n A and B Companies, with 120 men each, split up here. While A Company moved straight down, B Company moved around the pond, from one enemy bunker to another.\n\n Molotov Cocktails were charged and activated. Flinging them at the enemy soldiers the two companies moved on with complete disregard for their personal safety.\n\n They went from bunker to bunker, assaulting armed soldiers and taking over the enemy positions. The single aim was to kill enemy soldiers and clear the bunkers.\n\n  Despite the bullet in his arm Ekka was charging like a lion. He was walking alongside Major Kohli when another bullet hit him in the neck.\n\n  Kohli watched him stagger and fall. ‘But then, he quickly picked himself up. stood tall and kept walking.’ he recounts.\n\n By then, the men had reached the railway signal building from where the MMG was firing continuously. It was a big hindrance to the soldiers. There was a need to silence the deadly machine gun.\n\n This was exactly where Ekka would perform his supreme act of bravery.\n\n  In the battle of Gangasagar, 11 soldiers lost their lives while one officer, three junior commissioned officers (JCOs) and 55 Other ranks were seriously injured.\n\n Twenty-five enemy soldiers were killed while six were taken prisoners of war. \n\nThe battalion was awarded three Sena Medals, one Vir Chakra and one Param Vir Chakra (PVC) for the bravery of its men."
  }, {
    "id": "1013",
    "name": "Flying Officer Nirmal Jit Singh Sekhon",
    "title": "1971",
    "operation": "Indo-Pakistani War",
    "url": "https://lh6.googleusercontent.com/proxy/s4qOvdlS2IzwFXJ7qr0QKdKFucuBW73hvXu7ECR4biaD-ptdSjuw-L6kGPJEZ-lgWonRVH66gW0FC9evp4tCPbWWi1lENIcAWPJDsPgJ3fpRPf9PhfRfkfx9RyV3GfwUNRZENlFV3kyF8HzvA7_p=w5000-h5000",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "No.18 Squadron",
    "description1":"Service: Indian Air Force",
    "description2":"Born: 17 July 1943\n",
    "description3":"\n\nSrinagar\n\n14 December 1971\n\nIt is another freezing morning at the Srinagar air force base. And who would know the bone-chilling cold better than the 26-year-old tall and lanky Flying Officer Nirmal Jit Singh Sekhon, with the crisp upturned moustache, and Flight Lieutenant Baldhir Singh Ghuman, both of whom have got there at 4.30 a.m. in a bus with most of its windowpanes missing.\n\n The 45-minute ride from Badami Bagh officer’s mess, where they live in dingy, dimly ‘ lit rooms, to the airbase has made their teeth chatter and nearly fozen their joints but for the pilots of 18 Squadron (Flying Bullets), this is routine.\n\n Those on morning shift have to get to the base and he battle ready at least half-hour before daylight. Pilots on two-minute standby have to remain strapped to their seats in the cockpit of their parked planes but since it is extremely cold.\n\n They are relieved after every three hours.\n\n  The two young officers are sitting in the small, cramped aircrew room, 30 meter from where their Gnats are parked in the open, though neatly camouflaged, pens.\n\n Since it has been a particularly foggy morning with very low flight visibility, they have been taken of the two-minute standby, but are still on air defence alert and a two-minute standby, which means they should be able to get airborne in five minutes.\n\n  Both are from the 18 Squadron, which has been stationed atAmbala but is now more at Srinagar since March 1971 after tensions have escalated between India and Pakistan.\n\n Until now, the Indian Air Force has been following UN restrictions of no combat aircraft in jammu and Kashmir.\n\n Neither Sekhon nor Ghuman are new to Kashmir terrain and weather and both are fully confident since they have complete faith in the Gnats they  fly The tiny planes have been termed Sabre Slayers after their phenomenal performance in the ’65 war when they held their own against the larger Pakistani Sabre jets, shooting down as many as seven of them.\n\n  Suddenly an alarm is sounded from Awantipur Airbase. Pakistani Sabre jets are headed towards Srinagar.\n\n Since the base does not have air defence radar and visibility is also low, it is very dificult to spot enemy planes till they are very close.\n\n A chain of observation posts has been set up along the hill crest in the west where a soldier from the local regiment is put on duty He has battery-operated radio set and his task is to report immediately if he spots enemy aircraft in the air.\n\n   The two fighter pilots are told to be on Standby 2. They run out of the aircrew room and make a dash for the pens when their faithful Gnats are standing.\n\n Clipping on his helmet, Sekhon, called Brother by his friends, climbs into his Gnat. Ghuman, popularly called G'Man, makes a dash for his own plane.\n\n Both are in high spirits. It is every pilot's desire to get a slice of action and it looks like the dream is about to come true for the two of them today.\n\n Earlier that day, in Pakistan\n\n  A information of four plus two F 86 Sabres of Pakistan Air Force’s 26 Squadron (Black Spiders) takes off from Peshawar air force base and heads towards Kashmir.\n\n Their orders are to dive into the Kashmir Valley, bomb Srinagar, turn and get back to Pakistan.\n\n Each is carrying two 500-pound bombs and is ready for attack.\n\n All six Sabres also carry external 760 litre fuel tanks to stretch their endurance.\n\n While four of them are on the bombing mission, the other two are escorting them to facilitate the attack.\n\n Both have six fully loaded M3 Browning machine guns.\n\n   On this morning, the Sabres cross Pakistan and enter India by flying over the Pir Panjal range at 10,000 feet.\n\n They are spotted when they cross Awantipur air force base, and an alarm is immediately raised.\n\n At the Srinagar Airbase, Sekhon and Ghuman have started their Gnats. The airbase has a 3,500-yard runway, a parallel taxi track and a few airplane shelters made of concrete, called blast pens, right at the end of the runway where four Gnats are usually stationed at a time.\n\n The two fighter pilots are impatiently waiting for clearance from the air traffic control which is a dug-out on the eastern side of the runway.\n\n The din of the approaching planes is getting closer every moment and now reverberating in their ears. Ghuman decides not to wait any more and takes off By then the Sabres are overhead and two of them have dropped lower and are strafing the airstrip.\n\n  Ignoring the risk to his own life, Sekhon, who has been waiting for the runway to clear, lifts of in another 20 seconds.\n\n Even as the two Sabres drop their bombs on the airstrip, his Gnat lifts gracefully into the air. Beneath him the air strip is covered with smoking potholes. Above him, somewhere in the fog, is Ghuman.\n\n Ideally, the scramble or the order for take off should have been cancelled since the enemy aircrajt were overhead and had already begun bombing the runway, but this does not concern Sekhon, who smiles to himself and pulls the joystick.\n\n He doesn’t know then that this is the last time he and Ghuman will fly together.\n\n  Once in the air, Sekhon immediately lines up behind the two Sabres that are regrouping after their bomb run and starts chasing them.\n\n Ghuman is lost in the fog. They have lost each other and will not reconnect.\n\n Ghuman will land bath on the bombed airstrip, half an hour after the air battle is over.\n\n After a fierce and daring fight at treetop height, the completely outnumbered Sekhon would have crashed in the valley by then, his parachute only half deployed.\n\n  The moment the Sabres realize they are being chased by the tiny though lethal Gnat, they take a sharp left turn. High on adrenaline, Sekhon turns with them and fearlessly follows.\n\n His voice crackles over the radio set: 'I am behind two Sabres. I won’t let the bastards get away.\n\n ’Meanwhile, Sabre nos 3 and 4 have also dropped their bombs and are pulling up. While Sabre no. 3 spots the dogfight and joins up with the two Sabres Sekhon chasing, Sabre no. 4, possibly way/aid by the fog, turns back towards Pakistan. Sehhon positions himself behind Sabre no. 2 and opens fire with his 30-mm gun.\n\n The familiar gunfire is heard at the airbase. A plume of fire and smoke is seen rising from the Sabre.\n\n Flight Lieutenants Bopaya and Naliyan of 18 Squadron later verify seeing a Sabre with its right wing on fire.\n\n Pakistan denies any hit.\n\n  Sekhon revs up his engines and now decides to go after Sabre no.1. Sabre no. 3 has, however, closed the gap and Sekhon issandwiched between the two large planes with the one behind shooting at him.\n\n The three get locked in a herce dogfight.\n\n' I'm in a circle of joy, but with two Sabres. I am getting behind one, but the other is getting an edge on me, ’ Sekhon’s voice is heard on the radio.\n\n   None of the action is visible to onlookers from the airfield. The Sabre behind Sekhon continuously spews out a stream of 0.5” bullets, but he dodges them efficiently and continues to trail the Sabre in front.\n\n The third Sabre shoots his gun empty and fails to get a hit.\n\n The Pakistanis are shocked when the pilots voice crackles on the radio:\n\n ‘Three is Winchester, ’meaning he has finished 1,800 rounds and his guns cannot fire any more.\n\n  Ammunition finished, Sekhon drops out of the fight and is now free of its threat.\n\n He uses this moment of temporary relief to straighten and drop his external fuel tanks so that he is much lighter and more agile.\n\n He goes after Sabre no. 1 with renewed enthusiasm. Nimbler than before, he starts making even tighter turns.\n\n The Sabre tries its best to lose the Gnat on its tail, but Sekhon closes in and after he gets the Sabre in his shooting range, starts firing at it with his 30-mm cannon.\n\n The Sabre gives up and makes an SOS call for help.\n\n  Sekhon is completely unaware that the formation of attacking Sabres actually has six and not four planes and that the two escorts are watching the fight from a distance, astonished by the dexterity with which the Gnat is turning and holding the big Sabre prisoner.\n\n On hearing the SOS call they dive down. Gaining a speed advantage from its dive, one of the Sabres closes in on Sekhon.\n\n Sekhon spots the two newcomers and realizes he is outnumbered.\n\n The rear Sabre fixes the Gnat with his machine gun and makes a continuous attack.\n\n The Gnat gets the bullets.\n\n  'I think I have been hit, G'Man come and get them, ’is Sekhon’s last message. Trailing smoke and fire, the tiny Gnat tries to steady itself, but continues to lose height and snaps over backwards.\n\n It nosedives and corkscrews into a gorge near Badgam.\n\n Sekhon tries to save himself by ejecting but he is too low and his parachute does not deploy properly.\n\n He crashes. Ghuman lands on the badly bombed runway half an hour later.\n\n  When the crashed Gnat is finally found, it has 37 bullet holes around the rear fuseldge, tail plane and fin.\n\n It has however singlehandedly sabotaged the attack by six Sabres, which is a remarkable achievement.\n\n  For his exemplary courage and heroism in the Indo-Pakistan War of 1971, Flying Officer Sekhon is posthumously awarded the Param Vir Chakra.\n\n He remains the only Air Force personnel to be awarded the country's highest gallantry award."
  }, {
    "id": "1014",
    "name": "Second Lieutenant Arun Khetarpal",
    "title": "1971",
    "operation": "Battle of Basantar",
    "url": "http://cdn.thestorypedia.com/images/2016/02/arun-khetarpal.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 17 POONA HORSE",
    "description1":"Service: Indian Army",
    "description2":"Born: 14 October 1950\n",
    "description3":"\n\nBattle Of Basantar, Shakargarh Sector\n\n16 December 1971\n\nSeated inside the cramped Famagusta, his Centurion battle tank named after a port Cyprus, 2nd Lieutenant Arun Khetarpal is watching with narrowed eyes the enemy tanks before him.\n\n Most of them are wrecked and burning, the flames filling the sky with billowing grey smoke.\n\n He is trying to judge the trajectory of the shot his gunner has just fired. He will know if it has hit home because the moment a tank is hit the Pakistanis raise their gun and run out.\n\n Their religion forbids them a death by burning.\n\n  A vein is throbbing madly in Khetarpal’s neck. If he manages to get this one, his tally will be five.\n\n He knows his tank is already on fire and exposed. He has switched of the radio set because he is being asked to pull back.\n\n His gun is still firing and he wants to get the bastards. He knows changing his position will give the enemy an opening. He will not let that happen.\n\n  There is a deadly whistling sound as a shell shoots in through the cupola of Khetarpal’s tank.\n\n In that split second, he doesn’t realize it has ripped his stomach he is surprised when the confined interior of the tank fills with the acrid stench of burning flesh. When it moves further, smashing into his thigh.\n\n It Shatters the bone and bends it at an angle that traps it under the seat of his tank.\n\n  Bleeding profusely, all he can whisper hoarsely to his gunner Sawar Nathu Singh, who is imploring him to climb out of the tank, is:\n\n ‘I won’t be able to do it. ’ With that, Khetarpal collapses, guts spilling out of the bloody wound in his abdomen. It is around 10.15 a.m.\n\n The date: 16 December 1971. Khetarpal, breathing his last, is 21.\n\n 15 December, 11pm.\n\n  The winter night is pitch-dark. The young wheat in the fields is rustling gently in the breeze. In the daytime it had shimmered a brilliant green.\n\n At night it is like a soft carpet that shows the tracks of the tanks that have passed over it like ghosts of the night, crushing the fresh fronds under their weight.\n\n  The massive Centurion tanks of the Poona Horse are moving in a single file.\n\n Each is locating the one in front by the tiny glow of a red tail light small as the tip of a burning cigarette, directed at the ground so that it cannot be seen by enemy tanks or aircrafts, only the tank following it.\n\n Their instructions are clear. They have to cross a 1500 square yard minefield strewn with anti-tank and anti-personnel mines to reach the infantry in the bridgehead. They have to do it fast.\n\n  That same morning, the commanding officer of 16 Madras had reported that enemy tanks were gathering for a major counterattack and unless the Indian tanks reached them quickly they would not be able to hold on much longer.\n\n The retreating Pakistani army had Ieft behind antitank and anti-personnel mines.\n\n It was up to the engineers to breach this minefield and make a safe passage for the tanks.\n\n As the engineers were clearing the minefield with the trawls, the tanks of the regiment started moving behind them so they could speed up the induction into the bridgehead .\n\n 16 December\n\n The squadron commander of B Squadron, 17 Horse, asks for reinforcements as Pakistanis tanks have started counterattacking at Jarpal, in the Shakargarh Sector.\n\n This is the same area that has earlier been captured by 3 Grenadiers in an operation where Major Hoshiar Singh has got his PVC and Maj Cheema his Sena Medal.\n\n Captain Malhotra, Lieutenant Ahlawat and 2nd Lieutenant Khetarpal are sent to assist B Squadron.\n\n Such is the intensity of the battle that within minutes they have knocked of seven enemy tanks.\n\n However, Ahlawat's tank is hit, and it is in flames. just then Khetarpal’s tank is also hit. Capt. Malhotra orders him to pull back and bail out. But Khetarpal is unstoppable. He starts to chase the withdrawing enemy tanks and even manages to shoot and destroy one. The enemy sends in more tanks.\n\n   In the course of this battle Khetarpal is severely wounded. He is asked to abandon his tank but he realizes that the enemy is continuing to advance in his sector and if he abandons his tank they would break through.\n\n ‘No Sir, I will not abandon my tank. My gun is still working and I will get these bastards, ’ is what he famously says on radio on being asked to fall back. Malhotra tells him one more time:\n\n ‘Don’t be silly. You get out of the tank, otherwise you and your crew will be killed. ’Khetarpal does not come on the air again. He has deliberately switched of his set.\n\n Malhotra's gun has also stopped functioning which makes Khetarpal feel even more responsible for stopping the attack.\n\n  Four enemy tanks are still advancing when he calmly sets about shooting them one by one.\n\n The last tank that he shoots is barely 75 yards from him. This is the enemy squadron commander’s tank.\n\n (‘It was really one against the other, ’ says Cheema, who was holding the area west of Jarpal and was a witness to this action.)\n\n Khetarpal shoots the enemy tank and the enemy tank shoots him back.\n\n  Arun Khetarpal is dead, but he has by his intrepid valour saved the day. The enemy cannot get the passage that it is so desperately seeking.\n\n Not one enemy tank gets past Khetarpal.\n\n Second Lieutenant Arun Khetarpal is awarded the Param Vir Chakra for displaying the highest qualities of valour, leadership and strength of purpose.\n\n The young man of 21 years has performed an act of courage and self-sacrifice that goes far beyond the call of duty."
  }, {
    "id": "1015",
    "name": "Major Hoshiar Singh",
    "title": "1971",
    "operation": "Battle of Basantar",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Major_Hoshiar_Singh.jpg/220px-Major_Hoshiar_Singh.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 3 GRENADIERS",
    "description1":"Service: Indian Army",
    "description2":"Born: 5 May 1936\n",
    "description3":"\n\nBasantar Nala, Shakargarh Sector,\n\nPakistan 15-16 December 1971\n\nIt is a chilly winter night. Across the shadowy sugar cane and wheat fields that the soldiers of 3 Grenadiers have already crossed flows the Basantar Nala.\n\n The water is not in spate and has taken on a gentle, white glow in the moonlight.\n\n Looking at its sublime stillness, one cannot guess just how figid it is.\n\n Only after one dips the foot in and the wetness seeps into leather boots and socks, pricking the soles like hundreds of sharp needles does one realize it.\n\nThe 120-plus men of Charlie Company (led by Major Hoshiar Singh) and the 120 of Bravo Company (led by Major SS. Cheema) wading across the river are oblivious to its beauty and to an extent, even the coldness.\n\n What concerns them more is the near-constant shelling right in their face and the minefields that they know the Pakistanis have laid out on the other side, which they will have to cross to reach their objective-the village of Jarpal.\n\n The orders for the two companies are to attack around midnight and capture Jarpal from east and west.\n\nIn their parkas, helmets and ankle boots, with small packs on their back, the soldiers splash across the freezing nala in silence.\n\n Each time the ice-cold water lashes the skin it feels like a knife cutting into flesh.\n\n After a while their exposed bodies go numb and the men trudge on, water up to their knees, weapons held above their heads to protect them from getting wet.\n\n They carry 7.62 mm rifles and Sten guns while the radio operators have their pistols.\n\n Each of them has at least two grenades, if not more. These will be required in the close combat that is expected to follow.\n\n Their faces are smeared with mud and gunpowder from the shelling they have endured.\n\nA grim-faced Major Hoshiar Singh is standing by as his men go across one by one-trousers soaking wet, his Sten gun in his arms and head covered by a balaclava.\n\n He is known for not wearing helmets. The map of Jarpal stamped on his mind, he knows he has to attack in the dark; the enemy has to be taken unawares.\n\nIt is going to be a long night.\n\n What he does not know is that his company will be fighting one of the fiercest battles ever fought by the Indian Army, not just in terms of attack but also for the number of vicious counterattacks that come from the enemy.\n\n16-17 December\n\nThe Pakistanis launch a record number of six counterattacks to reoccupy Jarpal, but all of these are beaten back by the men of B and C Companies.\n\n The enemy soldiers start coming in wave after wave, starting at 3.30 a.m. on 16 December; the moment one lot is beaten back, another appears.\n\n Though each attack is neutralized by the men, the fatigue of fighting almost constantly with little or no time to rest and recoup is getting to them.\n\nThis is where Major Hoshiar Singh and Major Cheema stand by their side and egg them on with their words and action.\n\n Between attacks they eat the field rations they are carrying and drink tea that is quickly prepared in the trenches and sipped from their canteen caps, tiffin boxes and whatever else they can lay their hands on.\n\nThen comes startling information from a listening post that Maj Hoshiar Singh has created near the Gazipur Reserve Forest, south of Jarpal, about 400 m away from where the soldiers have dug their trenches.\n\n The men radio Maj Hoshiar Singh, saying they have noticed activity in the forest and are certain the enemy is planning to attack from that side.\n\n Major Hoshiar Singh tells them to stay very quiet and to not open fire as it would warn the enemy about their presence.\n\n Instead, he orders them to fall  back and join up with the rest of the company.\n\nMeanwhile, he informs his CO on the radio set of the coming massive enemy attack and he would need artillery support to beat it back.\n\n He also ensures that his men are on alert and have taken cover in the trenches they had dug during the daytime.\n\n The soldiers are strictly warned to keep silent with no movement, no coughing, no sneezing, etc. For hours, they wait in complete silence, their hands clasped firmly around their rifles, faces dark with fatigue.\n\nAround 4 a. m. the final attack comes as expected. The Pakistani army has attacked Jarpal with two companies of 35 Frontier Force Rifles that are led by Colonel Mohammad Akram Raja the C O.\n\n Major Hoshiar Singh allows the enemy soldiers to get closer even as his men watch impatiently, rifles cocked .He orders them to not open fire till he says so.\n\n It is only when the enemy soldiers are in the range of 100-50 yards that he yells out:\n\n ‘Fire. ’\n\nAll hell breaks loose as his men give it all they have got-medium machine guns (MM Gs), light machine guns (LMGs), rifles, mortar, the artillery starts firing at the advancing enemy soldiers, who are taken completely unawares.\n\n It is a bloody sight with the men screaming in pain as bullets and shells whip into their bodies. Each man, from either side, gives it all he has.\n\n Amidst war cries, exploding shells, mortar bursts, bullets and exchange of abuse, the fight continues well into the morning.\n\nMajor Hoshiar Singh is hit by splinters from an artillery shell and his leg is badly injured. He repfuses to be evacuated, despite being told to by his CO.\n\n Supported by a soldier, he continues to wavefront one trench to another, encouraging his tired men to not give up, inspiring them to hold on to their strength and courage.\n\nWhen an MMG gun jams, he climbs into the trench and, fixing it himself, he uses it to keep up the firing.\n\nThe firing is called of only after all enemy activity has ceased.\n\n As many as 42 Pakistani soldiers are tahen POW. When a final count is done in the daylight, 89 of the enemy are lying dead in front of the C Company trenches.\n\n Colonel Cheema remembers how Captain Bhatt, the adjutant of Pakistan’s 35 FE had told him:\n\n ‘There are 350 lying dead and wounded with us, and now we will have to re-raise 35 FF ’ .\n\nAmongst the dead are five officer's, including Colonel Raja, who was leading the attack. He has been hit by an MMG burst right in the face and has died a hero's death.\n\n His arms are frozen in the position in which he had been holding his Sten gun.\n\n Colonel V.P. Airy later writes a tribute for Colonel Raja on the basis of which he is given Pakistan’s second highest award for gallantry-the Hilal-e-jurat.\n\nMajor Hoshiar Singh has displayed personal bravery and dauntless courage, with complete disregard for personal safety in the face of heavy odds, for which he is awarded the Param Vir Chakra.\n\n He is one of the rare few to have won the medal alive."
  }, {
    "id": "1016",
    "name": "Naib Subedar Bana Singh",
    "title": "1987",
    "operation": "Operation Rajiv-Siachen Glacier",
    "url": "http://iitk.ac.in/vs/vylc_2014/img/speakers_pic/Bana_Singh.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 8 JAK LI",
    "description1":"Service: Indian Army",
    "description2":"Born: 6 January 1949\n",
    "description3":"\n    In January, however, retired Subedar Major (Honorary Captain) Bana Singh, Param Vir Chakra (PVC), opens his old black steel box and takes out his war medals to polish them till they sparkle.\n\n That is the time he goes to New Delhi to participate in the Republic Day Parade.\n\n Each time he holds the PVC in his hand, he remembers a very cold day in Siachen when the winds were blowing at 50 km an hour and sweat was freezing on his palms.\n\nSaltoro Ridge, Siachen\n\n25 June 1987\n\nSmall and slight, Naib Subedar Bana Singh of 8 J&K Light Infantry (8 JAK LI) was wading through waist-deep snow, his/1K 47 rijqe slung across his back.\n\nAbove 19, 000 feet, the days were no different from the nights and it was impossible to tell what time it was. A short while before, icy winds had been blowing at more than 40 km an hour, striking the soldiers like bullets on their open faces.\n\n No sooner had the winds dropped than a snowstorm had started.\n\n The visibility was down to near zero. An impregnable grey mist had dropped around Bana Singh and the two soldiers trudging wearily through the snow.\n\n The temperature had dropped to -45 degrees, making the sweat on their palms and the breath from their nostrils freeze into needle-like icicles.\n\nFor a moment, Bana Singh wondered if the task before him was even possible. But he shook his head and refused to even consider it impossible.\n\n Instead he concentrated on placing one weary foot after another.\n\nMaybe it was best that they couldn’t see what was around, he thought.\n\n He was still to recover from the shock of seeing the bodies of his comrades, massacred in cold blood by the Pakistanis.\n\n Preserved by the extreme weather; they had been lying half buried under freshly fallen snow, their faces grotesque masks of ice, their weapons fallen beside their bullet-riddled bodies.\n\n Though he had told his eyes not to look, they had ignored his command and continued to scan the faces of the dead soldiers scattered like rag dolls.\n\n He instinctively knew they had found what he didn’t want to look at.\n\n The crumpled body on the far side bore the handsome face of Second Lieutenant Rajiv Pande, his eyes blank and staring into nothingness.\n\nBana Singh froze. Only a few days back, the young and gutsy officer had been joking and laughing in the warm langar at Sonam Post. Now he was cold and dead.\n\n Bana Singh gritted his teeth and moved on.\n\nUp ahead was the hazy outline of Quaid Post, at 21,153 feet, where the enemy soldiers were holed up. His task was to capture the post.\n\n ‘I don’t care if we lose every man. We want that post. They killed our men.\n\n We can’t let that go unavenged.\n\n Unit ki izzat ka sawaal hai (It is a matter of the units pride), ’ the cutting words of his commanding officer echoed in his ears.\n\nBana Singh gestured to his companions to stop. Their orders were to wait for three other soldiers being sent as reinforcement.\n\n Using their ice picks, the men cut into the snow wall and made place to sit huddled together, drawing heat from each other's tired bodies. There they waited for the others to join them.\n\n Frozen, tired and hungry, they had to fight a war, when such a war had never been fought at those precarious heights ever before, anywhere in the world!.\n\nSaltoro Ridge, where Bana Singh and his men were operating, is close to the Everest in terms of climate and terrain.\n\n Not only were they above 19, 000 feet where the oxygen deficit made even walking a challenge, the temperature would fall below -45 degrees Celsius and just survival would become a challenge.\n\n Now they had to fight the enemy and recapture the post. What made it more challenging was that the enemy was sitting at a height and could fire down at them anytime.\n\n However, the task had to he done because the Pakistanis had not only occupied the post by stealth but they were also firing at helicopters and had fired at and killed unsuspecting men from the 8 JAK LI patrol that had gone there earlier.\n\nSecond Lieutenant Rajiv Pande, Naib Subedar Hemraj and 10 jawans were in the first patrol that was sent on a reconnaissance of the area.\n\n The team was specially trained in skiing and mountain warfare, yet it was a Herculean task for them to fix ropes and scale the ice in that thin air.\n\n Every step was a challenge, but they persevered for over 48 hours in the sub-zero temperatures.\n\n When the post was just 500 m away, Pande asked his commanding officer Colonel AP. Rai for further orders on the radio set. He was told to advance.\n\n The patrol did not realize that Pakistanis SSG commandos were watching them fom an overhang, waiting for them to come within firing range.\n\n The moment the unsuspecting men came closer; the Pakistanis opened fire killing all but two soldiers.\n\n Pande and his men died but the ropes they had tied would show Bana Singh and his team the way.\n\n Their dead faces would also fill the soldiers with sadness and cold jury, giving them the strength to go on.\n\n The very next day, shocked by the cold-blooded killing of the men, senior officers of the Indian Army rushed to Sonam Post.\n\n These included the corps commander, the Army chief and the defence minister. Colonel Rai, who had lost his men in the terrible shootout, was bristling with rage. He pleaded for another chance to take over the post. A full-fledged attack was planned. A small camp was established ahead of Sonam Post. Five Cheetah helicopters did 400 sorties, flying on minim um fuel to maximize load-bearing capacity, and the post was equipped with rations, pup tents, arms and ammunition.\n\nA team of two officers, three JC0s and 57 men was earmarked for the task.\n\n Naib Subedar Bana Singh did not figure in the selected team but Colonel Rai handpicked him for the task.\n\n 'Bana will go, 'he said, ‘I have a lot of faith in him.\n\n ’No one knew at that time just how prophetic this inclusion was going to be. When Bana Singh was told he was going, he unquestioningly packed his rucksack, laced up his snow shoes and joined the others.\n\n Operation Rajiv had been launched to avenge the loss of 2nd Lieutenant Pande and his team.\n\nOn 22 june, the first attempt was made to reach Quaid Post.\n\n During the night two jawans died of hypothermia, a dangerous condition where the organs start to shut down because of an extreme drop in body temperature.\n\nIt was decided that the next attempt would be made directly from Sonam Post.\n\n On 23 june, the men started climbing again at 8p. m., but the high wind-velocity, deadly gaping crevasses and snowfall made it impossible to move ahead.\n\n The men also found it increasingly difficult to breathe in the rarefied air. By 4 a. m. they had only covered 150 metres.\n\nThey had to return to the camp disheartened, where they were met by a furious Colonel Rai, who had arrived by helicopter.\n\n ‘Hamari joota parade hui, ’Subedar Major Bana Singh now recollects with an embarrassed smile.\n\n Aur honi bhi thi. Hamara haam tha, hame harna tha. ’(We were summoned for a dressing-down. And it was right too. It was our job. We had to do it.) Colonel Rai told the men in no uncertain terms that he wanted the post. ‘The post has to he captured We cannot let the deaths of Rajiv and his men go uavenged 'he thundered as the men listened silently.\n\nThe very next day (24 June), the ropes were tied once again this time in the same direction that Pande's ill-fated patrol had taken. At 8 p.m., the climb began once again.\n\n The task force commander Major Virender Singh was the first to go, saying be would not hesitate to shoot anybody who turned back. The mission will be completed this time, ’he said, his voice colder than the wind .With that be turned and pulled bimself up by tbe rope dangling in the snow.\n\n The men followed.\n\nThey reached tbe exact spot where the earlier patrol bad been massacred. The bodies of their comrades lay buried in the snow around them.\n\n All discomforts were forgotten in the rush of adrenaline and the desire to seek vengeance.\n\n Right above the men was the critically positioned overhang from where the Pakistanis had shot the entire team.\n\n Luckily the snowstorm and cold winds that bad reduced visibility drastically also made the enemy complacent in their confidence that tbe Indians would never think of an attack in such bad weather conditions.\n\n The terrible pall of grey around them was deadly for the climbing soldiers. since it bid tbe gaping mouths of treacherous crevasses. Two of the men slipped and fell to their deaths.\n\n Some were injured and had to be left bebind .Some fell, but climbed back to rejoin the attack team, But no one waited for anyone this time.\n\n They just kept moving abead. One by one, more soldiers were lost or evacuated because of injuries, chest trouble and frostbite.\n\nFinally,only Bana Singh and two others managed to reach Quaid Post.\n\n About 15 m away fom it, they sat huddled together in tbe shelter they bad cut in the snow and waited for the other soldiers so that they could attack the next day.\n\nQuaid Post, 26 June\n\nBana and his comrades had spent the night in the snow. They had hardly been able to sleep in the extreme cold. Soon they saw three hazy figures walking in their direction.\n\n In their white snow suits and shoes, they looked like ghosts.\n\n Bana's blood froze and he reached for his rifle, but then he realized that the reinforcements had reached them.\n\n All five waited in the snow for a while and it was decided that they would attack the enemy post by 4.30 pm.\n\n They closed their eyes in prayer. and then Bana told them to start moving.\n\n The heavy, persistent snowfall did not abate and they trudged on, keeping a sharp watch for craters that had heen covered by falling snow and meant a painful death.\n\nNaib Subedar Bana Singh led his men alone along the extremely dangerous route, climbing in near darkness.\n\n He inspired them with his indomitable courage and leadership.\n\n Despite the bad weather and the screaming winds the six brave men reached the post and stormed it. Flinging grenades into the enemy bunker, the men charged at the enemy soldiers.\n\n Bana Singh reached for a grenade and flung it inside a bunker; latching the door from outside.\n\n He didn’t let the screams of the dying men distract him and charged with all his might, bayoneting those who were outside, taking them completely by surprise.\n\n Some ran down the slope into the Pakistani side, some were killed, others injured Major Virender Singh and two more soldiers had also joined Bana by then.\n\n With their light machine gun on single-shot mode since the guns had stopped firing more than once at a time in the extreme cold, Bana directed the fire at enemy soldiers who were trying to climb back.\n\n The soldiers were either killed or scared away.\n\n However, realizing that their post had heen captured, they started shelling it.\n\nMajor Virender received our bullets in his chest and stomach but refused to be evacuated. He told Bana Singh to try and capture the enemy alive, to which Singh shook his head and famously replied:\n\n ‘Sir, these bastards are not my cousins!' made the injured officer smile even in those moments when they were courting death.\n\n Rifleman Om Raj’s arm was blown off by a shell and hung loosely by his side as he gasped in shock and pain.\n\n Bana Singh tried to stem the bleeding with bandages from his/first-aid hit, but he couldn’t.\n\n Both Om Raj, who was losing blood fast, and Major Virender were taken a little lower down, where the weather had opened up and a helicopter could land to evacuate them.\n\n While Major Virender survived and later rose to the rank of Brigadier, Om Raj died on the glacier in the arms of the men he had climbed up with.\n\n Both the men received Vir Chakras for their bravery.\n\nOn 27 june 1987, Brigade Commander Brigadier C.S. Nugyal climbed up to the post. In a rare, emotional moment he hugged fiercely the dirty and war-ravaged Bana Singh and his men.\n\n The post would thereafter be called Bana Top, he declared.\n\n Naib Sub Bana Singh was awarded the PVC for conspicuous bravery and leadership under the most adverse conditions."
  }, {
    "id": "1017",
    "name": "Major Ramaswamy Parameswaran",
    "title": "1987",
    "operation": "Operation Pawan-Sri Lanka",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Major_R_Parameshwaran.jpg/220px-Major_R_Parameshwaran.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 8 MAHAR",
    "description1":"Service: Indian Army",
    "description2":"Born: 13 September 1946\n",
    "description3":"\n\nNorth Jaffna\n\n24 November 1987\n\nThe time is 7p. m. Dusk has fallen over north Jaffna, Sri Lanka. The sky is dark with rain clouds when the men ofAlpha Company 8 Mahar, start marching towards Kantharodai, ready to fire the self-loading rifles in their hands.\n\n They are deployed at Uduvil  Girls College, and are now out on patrol since information has come that a consignment of arms and ammunition is being unloaded at the house of the headman of Kantharodai village, a man called Dharmalingam.\n\n The patrol of 10 soldiers is being led by Captain D.R. Sharma, A Companys second-in-command.\n\nKantharodai is a small village that comprises a few huts surrounded by dense coconut groves. The soldiers walla as quietly as they can, finding their way in the darkness.\n\n The area around them is swampy and filed with coconut trees and deep undergrowth; there are no street lights and they have been told not to use any lights as they will draw attention to them.\n\n As they trudge along, Sharma has this nagging feeling that they are being watched by LTTE (Liberation Tigers Tamil Eelam).\n\nA few single-storied houses nestle among the clusters of trees.\n\n Sharma reports to his company commander Major Ramaswamy Parameswaran-or Parry sahab, as his troops affectionately call him--that they have been fired at by the LTTE militants from a temple and the militant strength appears to be much larger than anticipated. Parry has been posted to 8 Mahar for less than two months.\n\n He has been picked since he is a Tamilian and can speak the local language.\n\n Also officiating as the battalion quarter master after the battalion lost Captain Sunil Chandra in an earlier operation, he is raring to come to the aid of his men.\n\n He has been functioning as quarter master during the day, looking after rations and stores, and taking on the mantle of A Company commander at night.\n\n He quickly puts together another patrol of 20 jawans and junior Commissioned Officer (J C O) Sampat Sable and joins up with the first patrol.\n\nIt is around midnight when the combined patrol of30 soldiers starts moving towards Kantharodai.\n\n It has begun to rain and the soldiers cover the mouths of their guns with polythene sheets.\n\n Some of them have ponchos but since they are inconvenient to wear, most prefer to get wet in the slow-falling rain.\n\nThey keep walking in a column in the pitch dark, cautiously covering 4.5 km while making sure that the coconut groves and swamp around the road arefree of LTTE.\n\n Around 1.30 am, the patrol reaches Dharmalingam’s house.\n\n It is set in an acre-plus compound and has a pond, coconut trees and even a garden.\n\nEveryone appears to be sleeping since the house is in darkness. The weather has worsened.\n\n The rain is now coming down in a thick downpour and the night sky is streaked with flashes of lightning and the sound of thunder.\n\n The men are soaking wet by now, water is seeping out of their heavy woodsoled DMS boots that have become bulky with moisture.\n\nThey surround the house and squat about 800 m from it in groups of 10. No movement is detected but they see an old truck parked nearby, next to what appears to he a garage.\n\n This lends credibility to the reports of the weapon consignment being unloaded there. Not risking attacking in the dark, the men wait for dawn. They squat in the grass even as the rain falls and are told not to move, cough or get up even to relieve themselves.\n\nAround 5.30 a. m., the family's dogs start barking and Parry decides to search the house.\n\n While the rest of the soldiers close in, he, Sharma and radio operator Dilip Maske go in and bring out Dharmalingam and his family.\n\n But even a thorough search yields nothing suspicious and it is decided that the patrol will return to headquarters.\n\n The officers shelter in a deserted house and discuss the route they should take to go back, deciding on the tarred Kantharodai-Uduvil road again since they want to avoid the waterlogged marshy terrain where LTTE ambushes are expected.\n\nUnfortunately for them, the road goes past a pond with three temples around it, where LTTE militants have sought shelter.\n\n Later, much later, it is surmised that since Maratha Light Infantry were operating west of the 8 Mahar area, the LTTE cadre that Parry and his men run into may have accidentally drifted on to the path of this returning patrol.\n\n Now, however, the soldiers do not know all this or even that they have been spotted by LTTE, who are watching them silently, waiting for a chance to attack.\n\n It is 6.30 a. m. when the tired, rain-soahed and sleep-deprived soldiers are passing the pond. A burst of heavy machine gunfire (HMG) hits Sepoy Jagan Lal. Sepoy jagan Lal, who is behind him, shoots and hills one militant but is caught in a burst of light machine gunfire (LMG).\n\n At this moment, the militants open fire from all three temples, scattering the entire patrol.\n\n‘We were walhing on the road, spread out over 300 meters. Sampat Sahab was leading with 10 jawans; he was followed by Captain Sharma Sahab with 10 jawans and Parry Sahab was bringing up the rear with 10 jawans.\n\n Just then the HMG fire came and hit two of our men, ’says Subedar (Retd) Dilip Moshe, who retired as a JCO and now works as assistant manager with a security firm in Aurangabad.\n\n The two soldiers responsible for the LMG are badly injured in the legs. They fall and their LMG drops on the road. The soldiers walking in front also get pinned down because the fire starts coming from all directions and suddenly the air is full of deadly flying bullets.\n\nThe soldiers drop to the ground and Parry orders them to take immediate cover in the forest on the other side of the road.\n\n Picking up the dropped LMG, the men crawl into the thich undergrowth, taking their injured comrades along. Both are bleeding profusely from the bone-shattering shots.\n\n The soldiers go about 5 m into the forest and take cover in a thicket of coconut trees.\n\n From there, they try to return the fire, but it is a futile exercise since the militants cannot be seen.\n\n Parry and Shanna decide that former will move in from the east and the latter from the west and north.\n\nCaptain Sharma and Sepoy Jarnail Singh pick up their rochet launcher and walk into the pond since they need open space to use it.\n\n Standing in the water, they direct a few bursts at the temple font where the most fire is coming; they can't do much since the HMG fire keeps coming and have to return looking for cover.\n\n During this exercise, Jarnail is hit by an LMG burst on his left leg that cripples him, but he drags himself into an under-construction house.\n\n Sharma's team decides to take shelter there. There are two more houses in the area and the soldiers have unknowingly walked into an ambush.\n\n Naik Appanna Sarje comes out of the house to fire and almost walks into two militants. He kills one but the other manages to escape.\n\n As he tries to fire at the fleeing militant, he is shot and falls down, mortally wounded Capt. Sharma asks jarnail to fire a rocket at the house sheltering the LTTE militants, but the round misfires.\n\n The aerial of the radio set with them breaks and they are not able to make any transmissions either.\n\n Just then, they spot two militants looking in through the window, and before they can react, the militants lob a grenade inside. Sharma, who is trying to get through to the battalion HQ by hooking his set to a radio aerial in the house, miraculously gets through.\n\n He shouts at jarnail to pick up the grenade and throw it out of the window, but even as the injured Jarnail bends to do so, the grenade bursts and the flying shards slash into him.\n\n Sharma escapes unhurt and starts lobbing grenades at the militants.\n\n Two of them fall and the soldiers watch from inside the house as their bodies are dragged away by their compatriots.\n\nThe soldiers face heavy firing from all directions. They have inadvertently walked into an LTTE hideout.\n\n The militants are holed up in spaces under the ceiling and even on top of the coconut trees.\n\n 'We did not know much about hideouts in those days and didn't realize that the rebels were hiding all around us.\n\n Captain Sharma and Sampat Sahab, along with their columns, were caught in the ambush.\n\n Where were immediate casualties,' remembers Maske. Radio operator Vidyasagar Dongre and Ramesh Athawale are injured in the fire; Rajan, who is trying to return the attack with mortar fire is hit by a burst that hills him on the spot.\n\n Ganesh Kohle, who is handling the LMG, is also shot dead.\n\n LTTE are using AK-47s, grenades, explosives and the deadly HMGs that inflict the maximum damage.\n\n They have even mined the area, which restricts the movement of the soldiers, who were completely at a disadvantage.\n\nParry sees the firing from his location and decides to step in to save the men.\n\n ‘Sahab told us that our soldiers had walked into an ambush and we would go from behind and do a counter-ambush so that our men could be rescued, ’ \n\nrecounts Maske.\n\nTaking 10 men with him, Parry moves forward. Sepoy Raj Kumar Sharma and Naik Pandurang Dhoble are with him but the group breaks up under the intense fire coming at them.\n\n Parry does not lose his cool even for a moment.\n\n He fixes the LMG and tells Raj Kumar to fire at the militants. He decides that the rest shall move forward under cover of that fire.\n\n Raj Kumar has just started firing when an AK-47 burst from a treetop hits him, and he falls‘.\n\n The soldiers are pinned down by the incessant fire.\n\nParry refuses to be cowed down and with absolutely no concern for his own safety drops on his stomach and crawls forward through the coconut grove where many of the trees have been chopped down to about five feet.\n\n Taking cover behind a tree stump, Parry flres the LMG in the direction of the ambush.\n\n He startles the LTTE militants, who realize they have been surrounded.\n\nJust then an HMG burst from a sniper, sitting atop of a coconut tree, catches Parry on his left wrist, smashing the bone to bits and nearly severing his hand.\n\n The impact is so high that it takes of his watch, which falls some distance away Even as his men watch, Parry charges at the militant closest to him, completely disregarding his grievous injury.\n\n He snatches the man's weapon and shoots him, shouting at his men to follow.\n\nJust then, another HMG burst hits him in the chest. In his pocket he has a Mini Clear pistol and rounds he has planned to use to send a success signal.\n\n They burst and the brave officer collapses,falling on his face.\n\n When his body is recovered by Captain Sharma almost an hour later; his watch is found lying near him.\n\n It has stopped at 8.10 a. m.\n\n ‘I was just three metres behind him, says Maske. However, the fire is so intense that for a long time the soldiers are not able to even reach his body.\n\nThough shocked by the loss of their brave commander, the six jawans are inspired by his sacrijice and continue to fight back.\n\n They can see the militants scattering in panic.\n\n ‘They were young boys and girls in lungis (sarongs) and T-shirts. Most of them were carrying AK-47s though they did not have either helmets or slippers on their feet,\n\n ’remembers Maske.\n\n The rebels start jumping out of their hideouts and running away while still firing at thesoldiers.\n\nThe battalion has, meanwhile, sent reinforcements. Captain TC. Bhattacharya and 20 other ranks reach the location and start firing at the three temples.\n\n Bhattacharya enters the First temple and manages to catch a militant.\n\n It is a bold action that unnerves the other rebels and sends them fleeing.\n\n Bhattacharya succeeds in Extracting information fom his prisoner about a hideout from when three AK-47s, two rocket launchers, 200 booster charges and 100 kg of explosives are recovered .\n\nA team of 1 Marattha Light Infantry led by Major Devendra Brar, also arrives.\n\n This party of 25 soldiers helps Maske and Ankush Waghmare move forward and retrieve Parry's body.\n\n It is brought to an empty bouse where Raj Kumar is given first aid. Slowly the firing stops.\n\nSix militants are billed in the attack and an unknown number wounded. 8 Mahar loses Parry Naib Appana Sarje, Rajan Lal and Milind Koble, while nine others are wounded.\n\nOn 25 November, Parry's body is flown to Chennai and banded over to his kin. The three martyred soldiers are cremated with full military honours at Uduvil.\n\nFor his gallant act of bravery, exemplary leadership and command, Maj Ramaswamy Parameswaran is awarded posthumously the nation's highest gallantry award, the Param Vir Chakra. His saga of valour and selfless sacrifice will continue to inspire new generations of Mahar soldiers.\n\n‘The casualties would have been much higher had Parry Sahab not decided on going for a counter-ambush,’ says Maske. ‘He lost his life, but saved so many others.’"
  }, {
    "id": "1018",
    "name": "Lieutenant Manoj Kumar Pandey",
    "title": "1999",
    "operation": "Operation Vijay-Khaluber /Juber Top",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Manoj_Kumar_Pandey.jpg/220px-Manoj_Kumar_Pandey.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 1/11 Gorkha Rifles",
    "description1":"Service: Indian Army",
    "description2":"Born: 25 June 1975\n",
    "description3":"\n\nBatalik sector, Kargil\n\n 2-3 July 1999 \n\n Manoj Pandey sat crouched in a trench, almost blending in with the rugged brown slope. He was watching a burst of Bofors fire light up the purple sky.\n\n The unruly stubble on his chin made his face itch. He could smell the nauseating sweat in his hair even from under his helmet with a rip in the lining where the hard metal pressed against his scalp-cold yet strangely reassuring.\n\n Under the grime smearing his face, his features were good-a well-defined straight nose, firm mouth, broad forehead creased in concentration.\n\n He didn’t wear a moustache. His chin was determined, his eyes warm, brown and Finely lashed, though at that moment they were bloodshot from serious lack of sleep.\n\n He sat morionless, staring stonily ahead ,his rough , weather-beaten hands clasped firmly around his Insas rifle.\n\nSomewhere behind him, in the gloomy darkness intercepted only by the call of crickets, the Ganasak Nala gurgled, lapping against the quiet of the still night.\n\n Ahead loomed a steep though blurred 70-degree incline.\n\n That was Khalubar, the 5000-metre high ridge he and his men had to climb that night.\n\n Their task: to reach up undetected, take the enemy by surprise and destroy the Pakistani bunkers on top before daybreak.“\n\nSome goals are so worthy; it's glorious even to fail.\n\nThe men had been climbing for more than fourteen hours. They hadn’t slept for twenty-four.\n\n Sudden downpours of sleet and snow had left them chilled to the bone.\n\n They had miscalculated the treacherous path, lost their way twice in the dark and it was already morning by the time they spotted the hazy outline of the top.\n\n They had the option to go back before the enemy spotted them but Manoj made up his mind-they would complete the task they had been sent for.\n\n There would be any turning back now.\n\n They would storm the enemy bunkers, making the best of the bad weather and the wet mist creeping up the cliffs, with its cold fingers on all it found in its path. Another volley of fire lit up the sky.\n\n Manoj knew the guns were lined up on the highway, all along the Indus, firing at least 20,000 rounds at a time.\n\n The aim was to distract the enemy, which was why he and his men had been able to climb the 70-degree incline unnoticed do far, However, this time the fire seemed to be coming dangerously close.\n\n The burst of the shells was accompanied by a hail of bullets and suddenly a soldier screamed out in pain and collapsed.\n\n ‘Take cover,’ Manoj shouted,\n\n ‘this looks like enemy fire.’\n\n 'The bullets, rockets and machinegun fire were coming at them with an unnerving accuracy.\n\n The cries of men who had been hit rang out through the stillness of the chilly morning. From behind the boulder where he had taken cover. Manoj looked out.\n\n Around him was death and destruction. Limbs had been torn apart, flesh ripped into, and blood was seeping into the soil as the gut-wrenching screams of his men echoed in the impersonal stillness of the bare brown mountains.\n\n He knew they would have to storm the enemy in a daring daylight attack, right now.\n\n As soon as him mind was made up, the rush of adrenaline overcame indecision, fear and nervousness.\n\n The paralysing cold seeping into his bones was replaced by the heat of blood coursing through his veins.\n\n As the tracer bullet came flying past, lighting the place with a deadly cocktail of shrapnel and fire, Manoj stood up, tall and brave, his slight frame coiled like spring, his face a mask.\n\n Through the scream of the wind, he roared at those of his men that were fit to light, ordering them to follow him through the hall of bullets.\n\n Like a colossal god with invincible powers he Walked into the curtain of shells and bullets.\n\n He didn’t look back even once to see who had followed his final command but if he had he would have been a satisfied man.\n\n All his Gorkha jawans who could pick themselves up and walk were right behind him, their khukris gripped firmly in their hands.leaving behind those dead or dying, the men charged like angry lions, placing their feet firmly on the sleet-covered jagged rocks.\n\n Following the man, who was nor walking through flying bullets for the first time.\n\n They had seen him do it before.\n\n Just about a month ago.\n\nAbout a month back\n\nIn a narrow gulley, the bodies of four men from an ambushed patrol had been lying for more than 10 days since the Kargil War had started.\n\n They were from an initial patrol that had been sent to reconnoitre the occupied heights when the Indian Army had grossly underestimated the enemy infiltration. Completely unaware that they were being watched by the Pakistanis from both sides of the gulley, the men had walked into a deadly trap.\n\n They were shot dead at point-blank range by enemy soldiers sitting at a height on both sides.\n\n All efforts to retrieve the bodies were repulsed by the Pakistanis, who would start firing indiscriminately the moment they spotted any activity from the Indian side.\n\n Manoj volunteered to go and get the dead men back, insisting that their bodies be wrapped in the Tricolour and sent home to their families.\n\n He and his men had crept behind boulders and climbed the heights, reaching higher than the enemy.\n\n Then while some men were engaged in firing, the officer and a few of his men crawled down to where the bodies were lying, and ignoring the hail of bullets flying past, dragged the bullet-riddled bodies out of the gulley.\n\n Manoj had been one of the first to reach and had boldly crawled up to a dead man, pulling him behind a boulder. For a moment, he had stopped to look at his dead mate and his heart burned with rage.\n\n The body was badly mangled by shrapnel and he couldn’t make out the man’s face.\n\n On his bloody finger there was a gold ring that told him the man had probably been married.\n\n Even the belt he wore around his waist was punctured with bullet holes.\n\n ‘You bloody dogs, I’ll throw you out of my country,’ he had promised the enemy, shouting out in anger and had then used all his strength to drag the dead soldier back.\n\n It was a miraculous retrieval and even a decade later officers who had watched the operation would sit with a glass of whiskey in the mess and remember the amazing man who had managed the impossible.\n\n ‘It needed a very big heart to do what he did,’ they would say.\n\n ‘Only he could have done it.’\n\nThe time has come to show that daring once again and Manoj does not disappoint his men.\n\n Adrenaline coursing through his veins, he gestures to them to follow and, steeling his heart against every instinct for self-preservation, wallet into the curtain of flying bullets to reach the first hunher on the ridge ,a pile of cut rocks with a boulder for a roof, grainy in the hroodingfog that is sweeping across the landscape.\n\n He can make out the shadowy outlines of two Pakistani Northern Light Infantry soldiers.\n\n He is not conscious of an effort but a sharp tug at his belt apprises him that his hand has gripped the handle of the khukri hanging there and whipped it out in a silken move.\n\n The sheath falls away limply by his side as his hand flashes its ferocious blade up in the chilly wind.\n\n The thumping of his heart is left behind in an instant as he runs across the uneven terrain, jumping over boulders in the hilling snow, his face a grotesque mask of death, and falls upon the enemy soldiers, ferocious and proud.\n\n There is a swish in the air as the blade, cutting through the falling snowflakes, flashes and slices into human flesh.\n\n Right to left, left to right. Then again.\n\n And again, The bodies of the shocked Pakistanis, terror written in their eyes, fall in a bloody pile.\n\n They could have never imagined that someone would walk in through the deadly fire.\n\n Had he been watching, the young officer’s regimental centre khukri ustad would be proud of his student as he lets the blood drip of his khukri and looks up to find his next target.\n\n Sprinting across to the second bunker, the men fiercely pounce upon the enemy and a bloody hand-to-hand combat follows, ‘jai Mahakali, Aayo Gorkhali’ piercing the cold morning.\n\n Return shots ring out. Some of the enemy soldiers are charging with their bayonets, but most find they are no match for the gutsy Gorkhas with their lethal khukris that are splashing blood on the wet rocks. Suddenly Manoj winces.\n\n He has been hit in the shoulder by a bullet. Unconcerned, and feeling no pain in the heat of the moment, he takes out his gun and moves on to the next bunker, spraying the ones hiding there with a shower of bullets.\n\n Another bullet comes and hits him in the leg, making him stagger unsteadily. Naa chodnu, ’ (Don’t leave them) he cries out in Gorkhali, telling his men to carry on the carnage, and drags his injured leg forward.\n\n Reaching out for a grenade, he lobs itat the fourth bunker from where mortar fire is coming at them.\n\n Even as an explosion rents the sky, throwing up a dull grey cloud of stone and debris, a fatal shot bursts through the air and hits the officer in the forehead.\n\n There is a flash of yellow and he is engulfed by the smell of burning cordite and a warmth in the feezing cold.\n\n His whole body is wracked by a terrible pain; his brain is on fire his lungs gasping for breath, his heart seems to want to force itself out of his chest and his tongue is dry and swollen with thirst.\n\n He wants to go on and shoot the Pakistani soldier he can see leaping out of the burning bunker and race down the slope, but his disobedient body had stopped listening to his commands.\n\n He can only watch as his arms let go of the rifle he has been holding, his  fingers lose their grip on the trigger, his knees buckle under him and his neck slumps forward on his heaving chest.\n\n Blood courses down his face, blurring his vision.\n\n There is a spurt of light in his head, then stark darkness and silence.\n\n Finally, he has to close his eyes. Manoj Kumar Pandey of 1/11 Gorkha Rifles is dead; his blood-stained body tilts in an arch and falls gently to the ground in front of the fourth bunker of Khalubar.\n\n He was just 24 years and Seven days old."
  }, {
    "id": "1019",
    "name": "Grenadier Yogender Singh Yadav",
    "title": "1999",
    "operation": "Battle of Tiger Hill",
    "url": "https://upload.wikimedia.org/wikipedia/commons/0/01/Yogendra_Singh_Yadav_PVC.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 18th Grenadiers",
    "description1":"Service: Indian Army",
    "description2":"Born: May 10, 1980\n",
    "description3":"\n    Grenadier Yogender Singh Yadav was lying in a pile of bodies. Around him lay his comrades, all six of them, brutally killed.\n\n Their lingers had been ripped off, limbs torn out of their bodies, legs twisted gratesquely under their torsos, heads smashed beyond recognition. War is terrible.\n\n It reduces breathing, living, brave, young men into lumps of bloody flesh and bone. It reduces friends, colleagues, brothers, fathers and husbands into scarred, broken, ragdolls that were indistinguishable from each other, their vacant dead eyes mute witness to the pain they had undergone.\n\n It also reduces soldiers, trained emotionless killing machines, to emotional wrecks. When Yogender Singh tried to stand up his leg just collapsed under him and he lay there and wept, the sound of his loud wailing echoing in the cold, desolate heights of TigerHill.\n\n He wept till his eyes ran dry and his throat didn’t have the strength for another cry. He didn’t know then, but there Were fourteen bullets lodged in his body.\n\n Six of them had cut into his arm, rendering it useless as it hung from the shoulder, the bones exposed and rubbing painfully against each other each time he shifted his weight.\n\n A grenade had burst at his foot, making him feel as if his leg had been cut off-he could not feel it anymore.\n\n Another had smashed across his face, slicing into his forehead leaving a gaping gash from where blood was dripping into his eyes.\n\n It was all over, he thought.\n\nYogender’s story\n\nThere were just seven of us now and we could not even turn back since tbe enemy bad cut of our route.\n\n We decided to go on. Right ahead we could see a post.\n It was a rough sangar ( a small, temporary fortified position originally made up of stone, now built of sandbags and similar materials) made of rocks piled up together.\n\n We bad no idea how many of them were inside it, but since we bad seen tbem before tbey saw us, we just opened fire on them. Four of their men were killed instantly. When they stopped firing.\n\n We knew they had all died. By then, alerted by tbe exchange of gunfire, tbe Pakistani soldiers in another bunker above us bad started shooting at us as well.\n\n It was a Catch-22 situation. Bullets were flying through the air and we could neither go back nor forward.\n\n Just then, Havaldar Madan, who was our team leader, shouted,\n\n ‘Get inside their sangar. That is tbe only safe place.’ Someone sbouted back that tbe area could be mined but Hav.\n\n Madan said there was no choice.\n\n ‘Pehle goliyon se bacbo phir mines ke baare mein socbna, ’ (First, take cover from tbe bullets, then think of mines) be said curtly and we made a dash for the sangar.\n\n They had not had the time to mine it. Once inside, we took up firing positions and, with the bodies of tbe dead Pakistani! lying around us, opened fire on the bunker above us.\n\n The shootout went on for five long bours. There were no casualties, but the constant fire did not allow us to advance an inch.\n\n We realized that with all reinforcements cut of from below, our ammunition would not last very long. The ammunition left behind by the dead Pakistanis was also being used up fasst. It was just a matter of time before we ran out of bullets.\n\n We thought we would die and decided we would kill as many as we could he are getting killed. 50, we decided to stop firing and let them get closer.\n\n Around 11.30 a. m., 12 enemy soldiers came down to check if we were dead or alive. We still had 45 rounds each in our rifles and were just lying low. They came really close.\n\n I still remember them clearly, they were in cream-coloured Pathani suits with yellow pagris and had flowing heards.\n\n They were wearing white coats with hoods. Some of them were really tall while others were of medium height. We kept quiet till they came really close.\n\n Then suddenly all seven of us opened fired at them. Except for two enemy soldiers, who managed to escape, all the others were killed.\n\n The survivors ran up to their other post and within half an hour, more than 35 Pakistani jawans had surrounded us.\n\n The sound of gun fire echoed through the peaks as they directed the fire of their heavy weapons at us.\n\n We were facing HM G (heavy machine gun), UMG (uber machine gun) and RFC (rocket-propelled grenade) rounds that were dying at the sangar from the top.\n\n They also started rolling large boulders down at us. Since there was very limited ammunition with us, we did not want to waste any and stopped firing.\n\n They spotted our light machine gun and directed RPGfire at it, blasting its barrel of A young soldier was manning it and he ran to Hav. Madan in panic, Hav. Madan asked me to throw the LMG in his direction.\n\n Just as I went to pick it up, I looked up and found seven men in Pathani suits standing right ahove the sangar. ‘Ustad, woh aa gaye hain, ' ( they are here) I shouted to Hav. Madan. Ustad told me and Grenadier Ananth Ram to go and support our sniper Lance Naik Naresh. The moment I ran to do that, they flung agrenade at me.\n\n It hit me in the knee; it felt as if my leg had been blisted of I felt it with my hand and was relieved to find it still there.\n\n Just then, another grenade caught me on the forehead. I collapsed, blinded by pain and the blood that was dripping into my eyes from the deep gash.\n\n It was flowing like water from an open tap. I couldn’t see a thing. By then, both Grenadier Ananth and I had reached Lance Naik Naresh, the sniper we had been told to help.\n\n I asked Naresh to bandage my head since the blood was flowing into my eyes but he told me to start firing first. I kept wiping the blood of my face with an old sleeping bag that was lying there. Seeing my plight, Naresh opened his roll of bandage.\n\n As he was trying to put it on my wound, a shell hit him. He closed his eyes, leaned back and fell down. He was dead with the bandage still in his hand.\n\n I turned to Ananth and had only just started telling him this when a UMG burst hit him too.\n\n His head was blown of After that there was complete pandemonium. One after the other, the Pakistanis jumped down on us with cries of‘Allah hu Akbar’.\n\n There must have been around 35 of them with weapons in their hands.\n\n Out of the seven of us, two were dead, two were injured (including me and the other Yogendra whose finger had been cut off).\n\n So there were just three functional men facing 35 heavily armed enemy soldiers.\n\n In a second even that would change.\n\nAll of Yadav’s mates were killed in the machine gun fire that the Pakistani soldiers directed at them.\n\n They were so heavily outnumbered that they did not get a chance to retaliate.\n\nYogender Singh Yadav was the only one who did not die despite the Pakistanis making every effort to ensure that there were no survivors by firing at the fallen men again and again.\n\n When four rounds were fired at the man next to him, Yogender Singh Yadav saw his body shudder and jump in the air. He just closed his eyes and waited for his own turn to be killed.\n\n A Pakistani soldier came close and fired at him even as he lay there with his eyes shut.\n\n Yogender Singh felt the bullets hitting his body, but he promised himself that he would not die.\n\n Satisfied that all the Indian soldiers had been killed, the Pakistanis sent a message to their base camp in the Mushkoh valley that there were Indian soldiers on the mountain and an Indian LMG post down below that should be destroyed.\n\n Yogender Singh knew that 18 of the soldiers, who had split up from his team, were trapped on the mountain.\n\n An overwhelming desire to stay alive if only to save their lives came over him and he willed himself to not lose consciousness.\n\n Through his bloodied eyes, he could faintly see two men coming in his directions one of them picked up his gun, not realizing that he had a hand grenade strapped to his belt Using all his remaining strength, Yogender Singh Yadav pulled out the grenade, removed the pin and Hung it at the retreating Pakistani soldier.\n\n It got stuck in the hood of his jacket and though he tried to throw it off, it was too late. An explosion rent the air and the Pakistani’s head was blown off.\n\n He dropped down dead right on top of Yadav. Yogender Singh Yadav picked up his rifle and though he could nor stand, heStarted shooting the other enemy soldiers who were standing a little distance away.\n\n The shooting created instant panic. The Pakistanis. who had believed that all the Indians were dead, thought reinforcements had arrived from below and panicked.\n\n As they ran, Yogender Singh Yadav crawled after them and saw their camp.\n\n ‘It was 1.30 pm. the sun was out and I could clearly see snow tents and a langar (meal) in progress.\n\n l couldn’t do anything since l wasn't even able to stand, but I had this mad desire to survive and go down to my MMG (medium machine gun) post to warn my battalion.’ As he crawled back to where his comrades lay dead, Yogender Singh looked at them. ‘Someone had his head blown off, someone had a ripped chest, someone's intestines were falling out of a sliced stomach.\n\n 'These were my friends; they had been closer to me than my own brothers.\n\n Everybody had died a painful death except me. I just sat there and cried. And cried,’ he says. As his body started getting cold, he started feeling the intense pain of his terrible injuries.\n\n His shoulder bones had become exposed and were rubbing against each other making him cry out each time he shifted he moved. He realized his arm had become useless.\n\n After unsuccessfully trying to pull it out of the shoulder socket, he just pushed it on his back and tucked it inside his belt so that it would not come in the way. ‘Inside my head I heard a voice saying, if you are not dead yet, you will nor die now.\n\n And then it said get inside the nala,’ says Yogendra. And then, with his shattered arm tucked intohis belt and with fifteen bullets in his body, Yogender Singh crawled into a nala near the sangar and slowly dropped down into it.\n\n5 June\n\nYadav was hanging from a rock with his good hand when he saw the rest of the 18 Grenadiers party down below.\n\n Calling out to them, he asked for help. The men quickly got him down and, taking turns to carry him on their backs, they brought him to the camp that had been established midway on Tiger Hill.\n\n The sun had set by the time a weak and shivering Yogender Singh Yadav was brought to the CO's tent.\n\n The immense blood loss had made him so weak that he could no longer see.\n\n Yet, when his CO asked him if he could recognize him, Yogender Singh Yadav said,\n\n ‘Saab mein aapki awaz pehchanta hun. Jai Hind, Saab!’ (Sir, I recognize your voice. Jai Hind, Sir!) Lying down in the CO’s tent, warmed by stoves that were lit up to stop his constant shivering, Yogender Singh Yadav told his battalion exactly where the enemy was, how their post could be reached and what route should be followed.\n\n He then passed out.\n\nThree days later\n\nYogender Singh Yadav recovered consciousness on 9 July. It had been three days since he had been shifted from TigerHill to the Base Hospital at Srinagar.\n\n He woke up to find a ceiling fan above him and, for a moment, could not figure out where he was. The nurse informed him that he was out of danger and in the hospital.\n\n He asked about his battalion and was told that Tiger Hill had been attacked by around 100 soldiers of Bravo and Delta Companies along with Ghatak the night that he had returned.\n\n They had followed his advise and had taken over the post without any resistance from the enemy.\n\n Almost two truckloads of ammunition were recovered from Tiger Hill. The haul included a .82 mortar.\n\n Yogender Singh Yadav was shifted to Delhi where bone grafting was done on his arm.\n\n He was lucky that all the bullets had missed his vital organs and, though it took many years to recover fully, he now bears only bullet scars and the cut on his abdomen from where ribs were taken for bone grafting.\n\n His arm hurts in the winter and he can’t lift it beyond a certain height, but Yogender Singh Yadav has accepted that gracefully.\n\n Looking at him, it is hard to believe that he shot five men in cold blood, held his own against a company-strength of Pakistani soldiersand nearly died on a craggy peak.\n\n Every Republic Day, he comes down to Delhi, puts on his number one uniform, pins his medals on his chest and leads the parade down Rajpath from an open jeep with the other two living PVCs-Capt.\n\n Bana Singh and Hav. Sanjay Kumar-by his side.\n\nHe was 19 when he went to at fight in Kargil.\n\n The Param Vir Chakra was announced for Yadav posthumously, but it was soon discovered that he was recuperating in a hospital, and it was his namesake, who had been killed in the mission."
  }, {
    "id": "1020",
    "name": "Rifleman Sanjay Kumar",
    "title": "1999",
    "operation": "Kargil War",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Sanjay_Kumar_PVC.jpg/220px-Sanjay_Kumar_PVC.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 13 JAK RIF",
    "description1":"Service: Indian Army",
    "description2":"Born: 3 March 1976\n",
    "description3":"\n\nArea Flat Top, Point 4875\n\n4th July 1999, 1pm.\n\nThe searing heat from the enemy machine gun reaches 23-year old Sanjay Kumar's freezing face. For a moment, he relaxes in its warmth.\n\n He hasn’t slept for 30 hours; he has been climbing for 18 hours, and tiredness and cold have seeped down to his bones.\n\n The temptation to lean back and shut his eyes is tremendous, but he resists. Instead, he reaches into his backpack and pulls out a roll of white gauze bandage from his first-aid kit.\n\n He wraps it around his hands, systematically and meticulously-turning his attention to the left first and then the right.\n\n There isn’t enough in both and he looks at his comrade-Rifleman Najinder Singh, who is leaning back on the rock by his side, face covered with grime, eyes red from lack of sleep, hands lacerated from the sharp rocks he has held to climb through the night.\n\n Najinder moves the grenade he is holding to his left hand and reaches into his backpack. Wordlessly, he hands over his own bandage-roll to his mate.\n\n Holding one end in his mouth, Sanjay carefully wraps the rest around his right hand, taking the roll in clockwise circles, he covers his fingm first.\n\n Only when he is satisfied that the padding is thick enough will he move on to cover his thumb.\n\n The Pakistanis, sitting in an open sangar (a small, temporary fortified position) at Area Flat Top, Pt. 4875, with their machineguns firing down the slope, are under the impression that the Indian Army squad is still climbing up the steep 70-degree incline.\n\n They are mistaken. One JC0 (junior commissioned Officer) and 10 other ranks of Charlie Company 13 JAK Rifles,have already reached them and are now sitting behind boulders just a few feet below their sangar.\n\n Riflemen Sanjay Kumar and Najinder Singh are the first two men of that attack squad. They are the scouts.\n\n Sanjay has finished bandaging his hands. They look like the fat white stumps now. He takes a deep breath and his eyes met Najinder's one last time.The moment is here.\n\nSanjay makes eye contact with Najinder and nods. Najinder pulls the pin from the grenade in his hand and, with his arm arching in a slow semi-circle, lobs it inside the enemy bunker.\n\n There is an evil hiss, a blast, the familiar smell of cordite and then cries of pain as the bunker erupts in the greyfoggy afternoon.\n\n Sanjay keeps his head down until the sharp nooks around him have stopped splintering.\n\n His face an motionless mask, he reaches out for the enemy machinegun closest to him and with his bandaged hands protecting him from the burning metal, he pulls it down and flings it on the rocks below.\n\n He then turns to the second gun. Najinder Singh notices that the bandages around Sanjay’s hands have started smoking and are coiling around his fingers like twisted black snakes hut Sanjay is oblivious.\n\n He reaches for his AK-47, whips it of his shoulder and turns it into the gap from where he has pulled out the guns.\n\n Three Pakistani soldiers are standing in the smoke-filled sangar, paralysed by fear and shock. Around them lie guns, grenades and a large stock of ammunition.\n\n From the corner of his eye, he spots half-a-dozen bodies piled up at the other end. One of the men is trying to reach for a gun.\n\n Sanjay presses the trigger.A volley of gunfire dances across, splattering the rocks with a spray of warm blood, and the three men who had manned the first sangar of Pt. 4875 drop down one after the other.\n\n The soldier with the soot-covered fingers keeps firing and only after he is convinced that the men are all dead does he look at his grubby hands and wipes them on his dirty, threadbare trouser front.\n\n Fourteen years later, he will very humbly tell a writer that there was no special bravery involved. He was just doing what any other soldier in his place would have done under the circumstances.\n\n He would wear the PVC ribbon proudly on his uniform, but be embarrassed by the attention it brought him, insisting that every single soldier in his attack team was as brave as he was.\n\n Yet he would wear a medal that very few people have worn live so far. A medal that even the Chief ofArmy Staff gets up to salute. Even if it hangs on the shirtfront of a 23-year-old foot soldier.\n\nAfter the Indian soldiers have taken over the first sangar, they move to the second.\n\n They are unaware that, anticipating an attack, the enemy soldiers have climbed out of their bunker and have taken up positions further up the mountain from where they will target the Indians at point-blank range.\n\n All of the Indians are shot at. Two of them will never rise again. Naib Subedar Ramesh Singh survives but he is not destined to live long He will come back alive but meet his end in Kashmir soon after.\n\n Sanjay kumar is the one who embraces life despite three bullets in his leg and two in his hip. He and his surviving comrades lie back on the rocks and pretend to be dead.\n\n The enemy soldiers aim 15 minutes of continuous fire at them and then, presuming them dead, start climbing down to the third sangar, which is further down the slope.\n\n This is when Sanjay Kumar and his mates make a superhuman effort. Despite their injuries, they storm the next sangar.\n\n They find it deserted except for dead bodies and unused ammunition. They turn the enemy's machinegun at the fleeing soldiers and shoot them in cold blood before they can reach the safety of the third bunker.\n\n When they take final stock of the captured area, they find 15 bodies of Pakistani soldiers, a large cache of arms and ammunition, snow huts and tents.\n\n They sit down, bleeding from their injuries, using their first-aid hits, waiting for help to reach them. By 5.30 pm, the unit doctor reaches the bunkers.\n\n He gives the men painkillers and first aid. The rest of the team helps the injured to climb down to the base since the heights are too dangerous for stretchers to be used.\n\n It takes Sanjay Kumar the entire night to hobble down. It is 9.30 a. m. when he reaches the Mushkoh valley from where an ambulance takes him to the field hospital at Ghumri.\n\n There are still five bullets lodged in his body; miraculously, none of them has touched his bones or vital organs.\n\n What amazes the doctors even more is that he is conscious and walking despite the unbearable pain and blood loss.\n\n After the bullets are taken out and his wound stitched up, a helicopter shifts him to the military hospital a Srinagar. The nurse on duty is surprised that despite being bone tired he will not close his eyes.\n\n He doesn’t tell her that he has seen his friends shot and dying in front of his eyes. He has killed men he never knew.\n\n He has pulled out burning guns with his hands. He has walked with bullets lodged in his body.\n\n He has suffered a degree of pain that will haunt him for life. He has scars that will remind him of a war fought on a cold, craggy ridge where mere mortals went beyond the natural instinct for self-preservation to fullfil their duty towards their country.\n\n It takes him some time to accept that after more than a month of dodging death on a freezing mountain, his life is not at risk, he has no enemy to vanquish, his mind is without fear.\n\n He lets his mind take him to his old parents who live in the small Bhakhrawater encircled village of Bakain in Himachal Pradesh, when he ran across the green field as a little boy.\n\n Under the influence of a heavy sedative and painkillers, he finally closes his eyes to the horrors of war and drifts off to sleep."
  }, {
    "id": "1021",
    "name": "Captain Vikram Batra",
    "title": "1999",
    "operation": "Operation Vijay-Kargil",
    "url": "http://drop.ndtv.com/albums/NEWS/vikrambatra/1.jpg",
    "moredescription": "\n\nReference: \nThe Brave: Param Vir Chakra Stories\n   Book by Rachna Bisht",
    "description": "Unit: 13 JAK RIF",
    "description1":"Service: Indian Army",
    "description2":"Born: 9 September 1974\n",
    "description3":"\n    When she was blessed with twins after the birth of two daughters, Kamala Kanta would wonder sometimes why she had been given two sons when she had asked for just one.\n\n \"Now I know. One of them was meant for the country and one for us,\" \nshe would later say.\n\n All she has of Vikram are portraits,pictures and medals and memories that she is happy to share.\n\nYeh Dil mange more!\n\nColonel Joshi had decided that these would be the two assaulting companies that would climb up under cover of darkness from different direCtions and dislodge the enemy.\n\n The two young officers were listening to him quietly as he spoke.\n\n Having briefed both, he asked them what the success signals of their companies would be once they had completed their tasks.\n\n Jamwal immediately replied that his success signal would be:\n\n \"Oh! Yeah, yeah, yeah!\"\n He said that when he was in the National Defence Academy, he belonged to the Hunter Squadron, and this used to be their slogan.\n\n Lieutenant Colonel Joshi then turned to Vikram and asked him what his signal would be.\n\n Vikram thought for a while and then said it would be:\n\n \"Yeh dil mange more!\" (This heart wants more!)\n\nCapture of Point 5140 \n\nIt was a pitch-dark night. Lieutenant Colonel Yogesh Joshi was sitting at the base of the hump from where preparatory bombardment of Pt. 5140 had commenced.\n\n He was trying to make out the movement of his troops he knew would be climbing up under cover of darkness.\n\n The Indian artillery had plastered the entire feature with high explosives. For a long time, it appared as If the mountain was on fire and Joshi hoped that the enemy on top was dead.\n\n His hopes were however, dashed very quickly.\n\n The Pakistanis had occupied reverse slope positions when the Indian artillery was pounding them and had now returned to fire at the Indian soldiers climbing up.\n\n From time to time, Joshi would see Hashes on the dark mountain. From that he would know that the enemy was firing at his men and also just where the two teams had reached.\n\n The enemy had also started using \n\n\"artillery illurnination\"\n at regular intervals, which lit up the entire area for about 40 seconds.n\n This was done to spot the climbing Indian soldiers.Joshi hoped that his boys were following the standard drill, which was that everyone freezes and tries to blend into the surroundings when the area lights up like daylight.\n\n Movement would make them visible. Suddenly, his radio set came alive and he could make out the voice of a Pakistani soldier.\n\n He was challenging Batra whose code name Sher Shah the enemy had intercepted.\n\n \"Sher Shah, go back with your men, or else only your bodies will go down.\"\n The radio set crackled and then he heard Batra reply, his voice pitched high in excitement: \n\n\"Wait for an hour and then we’ll see who goes back alive.\"\n At 3.30 a.m., the CO’s radio set crackled again. \n\n\"Oh! Yeah, yeah, yeah!\" \nIt was Jamwal signalling that his part of the peak had been captured. Batra and his team were taking longer since they were climbing up the steeper incline.\n\n The next one hour was to be one of the longest for Lieutenant Colonel Joshi. He could hear gunfire and see the flash of gunpowder, but had no idea what was happening at Pt. 5140.\n\n Finally, at 4.35 a.m., in the cold of the darkness, his radio set beeped again and he heard the now-famous words: \n\n\"Yeh dil mange more!\"\n It was Batra.\n\nThe Last Victory\n\n7 July  1999\n\n    The wind was like a knife-cold and sharp and Captain Vikram Batra, who had been promoted after his first assault in June, knew it could slice the skin right off his cheekbones.\n\n To an extent, it already had. That was why he and his 25 men from Delta Company, 13 JAK Rih, blended in so well with the barren landscape.\n\n Their grey, sunburnt faces with unkempt beards and tissue peeling off under the wind’s painful whipping merged perfectly with the massive boulders behind which they were taking cover.\n\n Pt. 4875 was still 70 metres away and their task had been to reach that ridge, storm the enemy and occupy the post before daylight.\n\n Unfortunately, the evacuation of Captain Navin, who had a badly injured leg, had taken time and it was already first light.\n\n Through the night the men had been climbing the slope with machinegun lire coming almost incessantly from the top of the ridge.\n\n Intermittently, their faces would glow in the red light of the Bofors fire thatwas giving them cover from the base of the Mushkoh valley .\n\n The morning of 7th July there was a lot of pressure to proceed. Lieutenant Colonel Joshi spoke to Batra at 5:30 am and asked him to reconnoitre the area with Subedar Raghunath Singh.\n\nJust before the point was a narrow ledge where the enemy soldiers were and it was almost impossible to go ahead. There Was no way from the left or right either and, on the spur of the moment, Batra decided that even though it was daylight he and his boys would storm the post in a direct assauLt Setting aside all concerns for personal safety, he assaulted the ledge catching the enemy unawares but they soon opened fire.\n\n Though injured, Vikram continued his charge, with supporting fire from the rest of the patrol and reached the mouth of the ledge, giving the Indian Army a foothold on the ledge.\n\n This was when he realized that one of his men had been shot. Even as he tried to keep his chin down with a shot whistling over his head, his eyes rested on the young soldier who had been hit and was lying in a pool of blood just a few feet away. Till a short while ago he had been crying out in pain.\n\n Now he was silent. .His eyes, met those of Sub Raghunath Singh, who was sitting behind a nearby boulder, maintaining an iron grip on his AK‘47. \n‘Aap aur main usko evacuate karenge,’ (We will evacuate him, you and I)\n Batra shouted above the din of the flying bullets.\n\n Raghunath Sahib’s experience told him that the chances of the boy being alive were slim and they shouldn’t be risking their own lives trying to get him from under enemy fire. But Batra was unwilling to leave his man.\n\n ‘Darte hain,Sahib?” (Are you; afraid. sir?) he taunted the JCO. \n\n\"Darata nahin hun. Sahib,\" (I am not afraid, Sir) \nRaghunath Replied and got up. Just as he was about to step into the open, Batra caught him by the collar: \n\"You have a family and children to go back I'm not even even married. Main sar ki taraf rahunga aur aap paanv uthaiyenge.\" (I will take the head and you take his feet) he said pushing the JCO back and taking his place instead.\n\n The moment Batra bent to pick up the injured soldier’s head, a sniper shot him in me chest.\n\n The man who had survived so many bullets, killed men in hand-to-hand combat and cleared bunkers of Pakistani intruders. \n\nFearlessly putting his own life at stake so many times, was destined to die from this freak shot. When he was in Sopore some time earlier, Batra had had a miraculous escape when a militant’s bullet had grazed his shoulder and hit the man behind him killing him on the spot.\n\n He was surprised then. As he lay dying, destiny surprised him yet again. He had plans to follow, he had tasks to achieve, an enemy to vanquish.\n\n He was surprised that the bullet had Enrnd its mark despite all those unfulfilled duties. Batra gasped in disbelief and collapsed next to the young soldier he had wanted to give a dignified death to.\n\n The blood drained out of his body even as his stunned men watched in horror.\n\n Spurred by Batra’s extreme courage and sacrifice, a squad of 10 of his men (each carrying one AK-47 rifle, six magazines and two No. 36 hand grenades) attacked through the ledge, found the Pakisranis making halwa and killed each of the enemy soldiers on top, with zero casualties of their own in that assault.\n\n The herceness of their attack frightened the Pakistani soldiers so much that many of them ran to the edge and jumped off the cliff, meeting a painful end in the craggy valley.\n\n Even in his death, Vikram Batra had kept the promise he had made to a friend casually over a cup of tea at Neugal Cafe' in Palampur, on his last visit home. When his friend had cautioned him to be careful in the war, Batra had replied: \n\n‘Either, I will hoist the Tricolour in victory or I’ll come back wrapped in it.’Death is the ultimate truth of life but how many of us have the courage to face death with open arms? My brother Vikram was a Param Vir-Bravest of the Brave.\n\n I salute all those soldiers who are the real Virs of this nation."}]
}